--
-- Author: Jacob Lee
-- Date: 2014-07-08 10:52:57
--

local lang = {}
local L    = lang
local T, T1

L.COMMON       = {}
L.LOGIN        = {}
L.HALL         = {}
L.ROOM         = {}
L.STORE        = {}
L.USERINFO     = {}
L.FRIEND       = {}
L.RANKING      = {}
L.MESSAGE      = {}
L.SETTING      = {}
L.LOGINREWARD  = {}
L.HELP         = {}
L.UPDATE       = {}
L.ABOUT        = {}
L.DAILY_TASK   = {}
L.COUNTDOWNBOX = {}
L.NEWESTACT    = {}
L.FEED         = {}
L.ECODE        = {}
L.WHEEL        = {}
L.BANK         = {}
L.SLOT         = {}
L.UPGRADE      = {}
L.GIFT         = {}
L.GIFTBOX      = {}
L.CRASH        = {}
L.FBGUIDE      = {} -- facebook登录引导
L.MATCH        = {} -- 比赛场
L.SCOREMARKET  = {} -- 积分兑换奖励
L.PLAYER_BACK  = {} -- 流失玩家回归任务
L.USERINFOMATCH = {}    --比赛场其他玩家信息面板
L.SONGKRAN_ACT = {}
L.FIRST_PAY = {}
L.E2P_TIPS = {}
L.GUIDE_PAY = {}
L.HALLOWEEN = {}
L.CRAZED = {}
L.VIP = {}
L.SHARE = {}
L.PUSHREWARD = {}
L.LOTTERY = {}
L.HIGHROOMREWARD = {}
L.PUSHMSG = {}
L.PLAYERBACK = {}
L.BILLDETAIL = {}
L.MixCurrent = {}
L.TICKET = {}
L.MATCHDETAIL = {}
L.COINROOM = {}
L.DEALERSHOP = {}
L.ROOM_4K = {}
L.POKER_ACT = {}
L.DICE = {}
L.RICHMAN = {}
L.GROUP = {}
L.CARD_ACT = {}
L.PDENG = {}
L.FOOTBALL = {}
L.SONGKRAN = {}
L.WATERLAMP = {}

-- COMMON MODULE
L.COMMON.LEVEL = "Lv.{1}"
L.COMMON.ASSETS = "${1}"
L.COMMON.CONFIRM = "ตกลง"--确定
L.COMMON.CANCEL = "ยกเลิก"--取消
L.COMMON.AGREE = "ตกลง"--同意
L.COMMON.REJECT = "ปฏิเสธ"--拒绝
L.COMMON.RETRY = "เชื่อมใหม่"--重连
L.COMMON.NOTICE = "ข้อความเตือน"--温馨提示
L.COMMON.BUY = "ซื้อ"--购买
L.COMMON.SEND = "ส่ง"--发送
L.COMMON.BAD_NETWORK = "เชื่อมต่ออินเตอร์เน็ตขัดข้อง กรุณาตรวจเช็คเน็ตของท่านก่อนค่ะ"--网络连接中断，请检查您的网络连接是否正常.
L.COMMON.REQUEST_DATA_FAIL = "เชื่อมต่ออินเตอร์เน็ตขัดข้อง กรุณาตรวจเช็คเน็ตของท่านก่อน แล้วกดปุ่มเชื่อมใหม่เพื่อเชื่อมต่อค่ะ"--网络连接中断，请检查您的网络连接是否正常，点击重连按钮重新连接。
L.COMMON.ROOM_FULL = "ตอนนี้มีผู้ชมในห้องมากเกินไปค่ะ กรุณาเปลี่ยนห้องค่ะ"---现在该房间旁观人数过多，请换一个房间
L.COMMON.USER_BANNED = "บัญชีของท่านถูกแบนแล้ว กรุณาส่งฟีดแบคหรือติดต่อแอดมินค่ะ"---你的账户被冻结了，请你反馈或联系管理员
L.COMMON.MAX_MONEY_HISTORY = "ยอดชิปสูงสุด: {1}"--历史最高资产: 
L.COMMON.MAX_POT_HISTORY = "ชนะได้ชิปสูงสุด: {1}"--赢得最大奖池: 
L.COMMON.WIN_RATE_HISTORY = "อัตราชนะ: {1}%"--历史胜率:
L.COMMON.BEST_CARD_TYPE_HISTORY = "รูปแบบไพ่ที่ดีที่สุด:"--历史最佳牌型:
L.COMMON.LEVEL_UP_TIP = "ยินดีด้วยค่ะ ท่านอัพถึง LV{1} ได้รับรางวัล {2}"--恭喜你升到{1}级, 获得奖励:

L.COMMON.MY_PROPS         = "ไอเทมของฉัน:"   -- 我的道具:
L.COMMON.SHARE            = "แชร์"           -- 分享
L.COMMON.GET_REWARD       = "รับรางวัล"       -- 领取奖励
L.COMMON.BUY_CHAIP        = "ซื้อชิป"          -- 购买筹码
L.COMMON.SYSTEM_BILLBOARD = 'ประกาศจากระบบ' -- 系统公告
L.COMMON.DELETE = "ลบออก"
L.COMMON.CHECK = "เช็คดู"

L.COMMON.LOGOUT = "ออกเกมส์"--登出
L.COMMON.LOGOUT_DIALOG_TITLE = "ยืนยันออกเกมส์"--确认退出登录
L.COMMON.BINDFHONE = "ยินดีด้วยค่ะ คุณผูกเบอร์สำเร็จ\nใช้เบอร์นี้ลงทะเบียน/ล็อกอินเวปหลักของเรา\nเติมชิปรับคะแนนสะสมฟรี (10 คะแนน= 1 บาท)\nสินค้ามากมายรอแลกฟรี!"--绑定手机
L.COMMON.NULLPHONE = "จำเป็นต้องกรอกเบอร์มือถือ"
L.COMMON.NULLKEY = "จำเป็นต้องกรอกรหัสยืนยัน"
L.COMMON.DESSHOP = "ผูกเบอร์เสร็จแล้วรีบไปลงทะเบียนในเวปหลัก\nเติมชิปรับคะแนนสะสมฟรี โดย 10 คะแนน= 1บาท\nผูกเบอร์เสร็จฟรีรางวัลชิปทันที!"

L.COMMON.QUIT_DIALOG_TITLE = "ยืนยันออกเกมส์"--确认退出
L.COMMON.QUIT_DIALOG_MSG = "ตกลงจะออกเกมส์หรือไม่คะ?"--真的确认退出游戏吗？
L.COMMON.QUIT_DIALOG_MSG_A = "คุณยืนยันจะออกเกมส์หรือไม่ ？รางวัลล็อกอินพรุ่งนี้รอคุณมารับนะ！"--'确定要退出了吗?明天登录还可以领取更多奖励哦!'

L.COMMON.QUIT_DIALOG_CONFIRM = "ตกลง"--忍痛退出
L.COMMON.QUIT_DIALOG_CANCEL = "เล่นต่อ"--我点错了

L.COMMON.NOT_ENOUGH_MONEY_TO_PLAY_NOW_MSG = "ชิปของคุณมีไม่ถึง {1} ชิป กรุณาไปเพิ่มชิปก่อนค่ะ "--您的筹码不足最小买入{1}，您需要补充筹码后重试。
L.COMMON.USER_SILENCED_MSG = "ท่านถูกปิดแชทแล้วค่ะ กรุณาส่งฟีดแบคเพื่อติดต่อทีมงานค่ะ" --您的帐号已被禁言，您可以在帮助-反馈里联系管理员处理
L.COMMON.USER_NEED_RELOGIN = "สะกิดเพื่อนล้มเหลว กรุณารอสักครู่ค่อยลองใหม่หรือติดต่อทีมงานค่ะ "

-- LOGIN MODULE
L.LOGIN.FB_LOGIN = "บัญชีเฟสบุ๊ค"---FB账户登录
L.LOGIN.GU_LOGIN = "บัญชีนักท่องเที่ยว"---游客账户登录
L.LOGIN.USE_DEVICE_NAME_TIP = "ท่านตกลงจะใช้ชื่ออุปกรณ์ของท่าน\nเป็นชื่อบัญชีนักท่องเที่ยวของท่านหรือไม่คะ?"--您是否允许我们使用您的设备名称\n作为游客账户的昵称并上传到游戏服务器？
L.LOGIN.REWARD_SUCCEED = "รับรางวัลสำเร็จ"---领取奖励成功
L.LOGIN.REWARD_FAIL = "รับรางวัลล้มเหลว"---领取失败
L.LOGIN.REIGSTER_REWARD_FIRST_DAY = "วันที่ 1"--第一天
L.LOGIN.REGISTER_REWARD_SECOND_DAY = "วันที่ 2"--第二天
L.LOGIN.REGISTER_REWARD_THIRD_DAY = "วันที่ 3"---第三天
L.LOGIN.LOGINING_MSG = "กำลังล็อกอินเข้าเกมส์..."--正在登录游戏
L.LOGIN.DOUBLE_LOGIN_MSG = "บัญชีของท่านถูกล็อกอินที่ที่อื่น"   --帐号在其他地方登录

-- HALL MODULE
L.HALL.USER_ONLINE = "จำนวนคนออนไลน์: {1}"----在线人数
L.HALL.INVITE_FRIEND = "เชิญเพื่อนรับรางวัล"----邀请成功:  
L.HALL.INVITE_OLDUSER_FRIEND = "สะกิดเพื่อน+${1}"--"召回fb好友+{1}"
L.HALL.INVITE_FAIL_SESSION = "โหลดข้อมูลบัญชี Facebook ล้มเหลว กรุณาลองใหม่อีกครั้ง"--获取Facebook信息失败，请重试
L.HALL.DAILY_BONUS = "โบนัสล็อกอิน"---登录奖励
L.HALL.DAILY_MISSION = "ภารกิจรายวัน"----每日任务
L.HALL.NEWEST_ACTIVITY = "กิจกรรมล่าสุด"----最新活动
L.HALL.FREE_CHIPS = "ชิปฟรี"

L.HALL.SLOT = "สล๊อต"
L.HALL.LUCKY_WHEEL = "โชคดีหมุนๆ"---大转盘
L.HALL.OPEN_BOX = "เปิดหีบสมบัติ"---开宝箱
L.HALL.NOTOPEN="ใกล้จะเปิดใช้งานแล้ว กรุณาติดตามค่ะ"--暂未开放 敬请期待
L.HALL.MODIFING = "กำลังปรับปรุงอยู่ กรุณาติดตามค่ะ"
L.HALL.STORE_BTN_TEXT = "ห้าง"---商城
L.HALL.FRIEND_BTN_TEXT = "เพื่อน"--好友
L.HALL.RANKING_BTN_TEXT = "แรงค์กิ้ง"---排行榜
L.HALL.ACTIVITY_BTN_TEXT = "กิจกรรม" -- 活动
L.HALL.EXCHANGE_BTN_TEXT = "แลก"--"兑换"
L.HALL.ROOM_TYPE_NORMAL = "ห้องธรรมดา"
L.HALL.ROOM_TYPE_PRO = "ห้องมืออาชีพ"
L.HALL.MAX_BUY_IN_TEXT = "ยอดนำเข้า{1}"----最大买入
L.HALL.PRE_CALL_TEXT = "เดิมพันต่ำสุด"----前注
L.HALL.MIN_BET_TEXT = "เดิมพันต่ำสุด{1}"
L.HALL.BASE_BUY_IN_TEXT = "นำเข้าต่ำสุด {1}"---最小携带
L.HALL.SEARCH_ROOM_INPUT_ROOM_NUMBER_ERROR = "ID ห้องไม่ถูกต้องค่ะ"---你输入的房间号码有误
L.HALL.SEARCH_ROOM_INPUT_ROOM_NUMBER_EMPTY = "กรุณากรอกID ห้องค่ะ"----房间号码不能为空
L.HALL.SEARCH_ROOM_NUMBER_IS_WRONG= "ID ห้องต้องเป็นตัวเลข 5~8 หลักค่ะ"----你输入的房间位数不对
L.HALL.SEARCH_ROOM_INPUT_CORRECT_ROOM_NUMBER= "กรุณากรอกID ห้องที่มีตัวเลข 5-8 หลักค่ะ " --- 请输入5位的房间号码
L.HALL.ROOM_LEVEL_TEXT = {
    "ระดับต้น", ---初级场
    -- "ระดับกลาง", ---中级场
    "ระดับสูง",----高级场
    -- "ชิปทองคำ"----现金币场
}
L.HALL.GCOIN_ROOM_LEVEL_TEXT = {
    "ชิปทองคำ"----现金币场
}
L.HALL.ROOM_LEVEL_TEXT_NOCOINROOM = {
   "ระดับต้น", ---初级场
    -- "ระดับกลาง", ---中级场
    "ระดับสูง"----高级场
}

L.HALL.ROOM_LEVEL_TEXT_ROOMTIP = {
    "ห้องระดับต้น", ---初级场
    "ห้องระดับกลาง", ---中级场
    "ห้องระดับสูง",----高级场
    "ห้องชิปเงินสด",----现金币场
    "ห้องชิปทองคำ" ---- 黄金币场
}

L.HALL.PLAYER_LIMIT_TEXT = {
    "9\nคน", --9人
    "5\nคน"--5人
}
L.HALL.OPEN_CALLBACK_REWARD = 'ยินดีต้อนรับกลับมาค่ะ ท่านได้รับรางวัล {1} ชิป!'
L.HALL.ARENA_LIMIT_TIPMSG = "หากถึง LV.{1} จะเข้าห้องแข่งได้"

L.HALL.TUTORIAL_PLAYNOWCARD = "กดปุ่มเริ่มทันที เริ่มเล่นเกมส์โดยเร็ว"
L.HALL.TUTORIAL_INVITEFRIEND = "กดปุ่มเชิญเพื่อน รับชิปฟรีเพิ่ม"
L.HALL.TUTORIAL_ROOMCARD = "สามารถเลือกห้องได้"
L.HALL.TUTORIAL_MORECARD = "ชิปฟรีและเกมส์อื่นๆ"
L.HALL.TUTORIAL_STORE = "สามารถซื้อชิปที่ห้างได้"
L.HALL.TUTORIAL_CARDTYPE = "สามารถเช็ครูปแบบไพ่ได้"
L.HALL.ROOM_4K_LIMIT_TIPMSG = "ถึง Lv. {1} ถึงจะเข้าห้อง 4 ใบเกได้ค่ะ!"
L.HALL.ROOM_5K_LIMIT_TIPMSG = "ถึง Lv. {1} ถึงจะเข้าห้องมหาละลวยได้ค่ะ"   
L.HALL.ROOM_DICE_LIMIT_TIPMSG = "อัพถึง Lv.{1} ถึงเข้าห้องศึกชิงพิภพได้ค่ะ"   


L.HALL.TUTORIAL_REGISTERREWARD_MSG = "ระบบส่งรางวัลมือใหม่ {1} เข้าบัญชีคุณแล้ว พรุ่งนี้ล็อกอินเข้าเกมส์จะได้รับมากกว่านี้ค่ะ"
L.HALL.ARENA_LIMITE_LEVEL = "เปิด Lv. {1}"
L.HALL.TIP_FRI_GIFT = "วันนี้หมดจำนวนครั้งรับรางวัลแล้วค่ะ" --你今天已达到领取上限

-- ROOM MODULE
L.ROOM.OPR_TYPE = {
    "ผ่าน", --看  牌
    "หมอบ", --弃  牌
    "สู้", --跟  注
    "เกทับ", --加  注
}
L.ROOM.MY_MONEY = "My money {1} {2}"
L.ROOM.INFO_UID = "UID:{1}"
L.ROOM.INFO_LEVEL = "Lv.{1}"
L.ROOM.INFO_RANKING = "แรงค์กิ้ง:{1}" --排名: {1}
L.ROOM.INFO_WIN_RATE = "อัตราชนะ {1}%"--胜率: {1}%
L.ROOM.INFO_SEND_CHIPS = "ส่งชิป"--赠送筹码
L.ROOM.ADD_FRIEND = "ติดตาม" --关注
L.ROOM.DEL_FRIEND = "เลิกติดตาม" --取消关注
L.ROOM.ADD_FRIEND_SUCC_MSG = "เพิ่มเพื่อนสำเร็จ"
L.ROOM.ADD_FRIEND_FAILED_MSG = "เพิ่มเพื่อนล้มเหลว"
L.ROOM.DELE_FRIEND_SUCCESS_MSG = "ลบเพื่อนสำเร็จ"
L.ROOM.DELE_FRIEND_FAIL_MSG = "ลบเพื่อนล้มเหลว"
L.ROOM.SEND_CHIP_NOT_NORMAL_ROOM_MSG = "ห้องนี้ส่งชิปไม่ได้ค่ะ"--当前房间不能赠送筹码
L.ROOM.SELF_CHIP_NO_ENOUGH_SEND_DELEAR = "ชิปของท่านมีไม่พอ ให้ทิปล้มเหลว"--你的筹码不够多，不足给荷官小费
L.ROOM.SEND_CHIP_NOT_IN_SEAT = "นั่งลงถึงจะสามารถให้ทิปได้ค่ะ"
L.ROOM.SEND_CHIP_NOT_ENOUGH_CHIPS = "ชิปของท่านมีไม่พอค่ะ"
L.ROOM.SEND_CHIP_TOO_OFTEN = "ท่านส่งชิปบ่อยเกินไป กรุณารอสักครู่นะ"
L.ROOM.SEND_CHIP_TOO_MANY = "ท่านส่งชิปมากเกินไปค่ะ กรุณารอสักครู่นะ"
L.ROOM.SEND_HDDJ_IN_MATCH_ROOM_MSG = "ขออภัยค่ะ ห้องแข่งขันส่งไอเทมไม่ได้"
L.ROOM.SEND_HDDJ_NOT_IN_SEAT = "นั่งลงถึงจะสามารถใช้ไอเทมได้"
L.ROOM.SEND_HDDJ_NOT_ENOUGH = "ไอเทมของท่านมีไม่พอค่ะ กรุณาไปซื้อไอเทมที่ห้างก่อนค่ะ"
L.ROOM.SEND_EXPRESSION_MUST_BE_IN_SEAT = "นั่งลงถึงจะสามารถใช้อีโมได้ค่ะ"
L.ROOM.SEND_CHAT_MUST_BE_IN_SEAT = "กรุณานั่งลงก่อนนะคะ"
L.ROOM.CHAT_FORMAT = "{1}: {2}"
L.ROOM.ROOM_INFO = "{1} {2}/เดิมพันต่ำสุด{3}"
L.ROOM.USER_CRSH_POP_TITLE = "น่าเสียดายจัง ท่านล้มละลายแล้วค่ะ"
L.ROOM.NO_BIG_LA_BA = "ท่านไม่มีลำโพง กรุณาไปซื้อที่ห้างค่ะ"
L.ROOM.CLOSE_BIG_LA_BA = "ขอโทษค่ะ ลำโพงปิดให้บริการชั่วคราว หลังอัพเดทเซิร์ฟเวอร์เสร็จจะเปิดให้ใช้บริการค่ะ"--"喇叭功能升级中，暂不能使用"  
L.ROOM.SEND_BIG_LABA_MESSAGE_FAIL = "ส่งข้อความด้วยลำโพงล้มเหลว" 
L.ROOM.NOT_USE_HDDJ_MSG = "ห้องแข่งขันไม่สามารถใช้ไอเทมได้ค่ะ"
L.ROOM.CHAT_MAIN_TAB_TEXT = {
    "ข้อความ", 
    "บันทึกแชท"
}

L.ROOM.USER_CARSH_REWARD_DESC = "ท่านล้มละลายแล้ว ได้รับชิปบรรเทา{1} มีสิทธิ์รับได้เพียง 3 ครั้ง/บัญชีเท่านั้น ใช้อย่างประหยัดนะคะ"
L.ROOM.USER_CARSH_BUY_CHIP_DESC = "หรือสามารถซื้อชิปได้ที่ห้างค่ะ"
L.ROOM.USER_CARSH_REWARD_COMPLETE_DESC = "ท่านได้รับชิปบรรเทาล้มละลายไปหมดแล้ว สามารถไปซื้อชิปได้ที่ห้าง และอย่าลืมมารับโบนัสที่แจกฟรีทุกๆวันนะคะ"
L.ROOM.USER_CARSH_REWARD_COMPLETE_BUY_CHIP_DESC = "แพ้ชนะเป็นเรื่องปกติ อย่ายอมแพ้นะ ไปซื้อชิปเพิ่มแล้วมาสู้กันใหม่เถอะ ขอให้โชคเข้าข้างค่ะ"



L.ROOM.WAIT_NEXT_ROUND = "รอรอบหน้า"
L.ROOM.LOGIN_ROOM_FAIL_MSG = "เข้าห้องล้มเหลว"

L.ROOM.BUYIN_ALL_POT= "ยอดชิป\nกองกลาง"
L.ROOM.BUYIN_3QUOT_POT = "3/4\nชิปกองกลาง"
L.ROOM.BUYIN_HALF_POT = "1/2\nชิปกองกลาง"
L.ROOM.BUYIN_TRIPLE = "เก 3 เท่า"


L.ROOM.CHAT_TAB_SHORTCUT = "ข้อความ"
L.ROOM.CHAT_TAB_HISTORY = "บันทึกแชท"
L.ROOM.INPUT_HINT_MSG = "กรอกข้อความ"
L.ROOM.INPUT_ALERT = "กรุณากรอกข้อความก่อนค่ะ"
L.ROOM.CHAT_SHIELD = "ท่านปิดแชทเสียงของคุณ {1} สำเร็จ"
L.ROOM.CHAT_SHORTCUT = {
    "สวัสดีจ้า",
    "เร็วๆ รอไม่ไหวแล้ว",
    "เทหน้าตักไปเลย",
    "ใจเย็นๆนะ",
    "ฝีมือสุดยอดไปเลย",
    "ใครกล้าสู้บ้าง",
    "ขอบใจที่ส่งชิปให้นะ",
    "เล่นกับคุณสนุกมากๆเลย",
    "ไพ่ไม่ดี แต่ชิปเยอะ กล้าสู้ปะ",
    "วันนี้ดวงไม่ดีเลย",
    "อย่าด่าว่ากันสิ",
    "มีแฟนยังจ๊ะ",
    "เปลี่ยนห้องดีกว่า ไพ่ไม่กินเลย",
    "ฝากเนื้อฝากตัว\nด้วยนะ"
}
--荷官反馈
L.ROOM.DEALER_SPEEK_ARRAY = {
    "ขอบใจจร้า ขอให้ {1} โชคดีตลอดไปนะ!",
    "ขอบใจจร้า โชคกำลังเข้าข้างคุณนะ {1}!",
    "ขอบใจนะ คุณ {1}!",
}
--买入弹框
L.ROOM.BUY_IN_TITLE = "นำชิปเข้าห้อง"
L.ROOM.BUY_IN_BALANCE_TITLE = "ยอดชิปที่เหลือ:"
L.ROOM.BUY_IN_BALANCE_TITLE1 = "ยอดชิปเงินสดที่เหลือ:"
L.ROOM.BUY_IN_MIN = "นำเข้าต่ำสุด"
L.ROOM.BUY_IN_MAX = "นำเข้าสูงสุด"
L.ROOM.BUY_IN_AUTO = "ชิปไม่พอ จะนำเข้าอัตโนมัติ"
L.ROOM.BUY_IN_AUTO1 = "ชิปเงินสดไม่พอ จะนำเข้าอัตโนมัติ"
L.ROOM.BUY_IN_BTN_LABEL = "นำเข้าเพื่อนั่งลง"

L.ROOM.BACK_TO_HALL = "ล็อบบี้"
L.ROOM.CHANGE_ROOM = "เปลี่ยนห้อง"
L.ROOM.SETTING = "ตั้งค่า"
L.ROOM.SIT_DOWN_NOT_ENOUGH_MONEY = "ชิปของท่านไม่พอนั่งลงในห้องนี้ กรุณาเปลี่ยนห้องหรือเพิ่มชิปค่ะ"
L.ROOM.AUTO_CHANGE_ROOM = "เปลี่ยนห้อง"
L.ROOM.CHARGE_CHIPS = "เพิ่มชิป"
L.ROOM.USER_INFO_ROOM = "ข้อมูลส่วนตัว"
L.ROOM.ENTERING_MSG = "บางทีโชคดี บางทีโชคร้าย\nอยากชนะ ต้องใจร่มๆจ้า"
L.ROOM.OUT_MSG = "กำลังออกเกมส์..."--正在退出，请稍候...
L.ROOM.CHANGING_ROOM_MSG = "กำลังเปลี่ยนห้อง..."
L.ROOM.CHANGE_ROOM_FAIL = "เปลี่ยนห้องล้มเหลว ลองอีกครั้งสิคะ"
L.ROOM.STAND_UP_IN_GAME_MSG = "กำลังเล่นไพ่อยู่ ตกลงจะลุกขึ้นหรือไม่คะ"
L.ROOM.RECONNECT_MSG = "กำลังเชื่อมต่อเซิร์ฟเวอร์ใหม่..."
L.ROOM.OPR_STATUS = {
    "หมอบ",
    "ALL_IN",
    "สู้",
    "สู้ {1}",
    "SB",
    "BB",
    "ผ่าน",
    "เกทับ {1}",
    "เกทับ",
}
L.ROOM.AUTO_CHECK = "ผ่านอัตโนมัติ"
L.ROOM.AUTO_CHECK_OR_FOLD = "ผ่านหรือหมอบ"
L.ROOM.AUTO_FOLD = "หมอบอัตโนมัติ"
L.ROOM.AUTO_CALL_ANY = "สู้ตลอด"
L.ROOM.FOLD = "หมอบ"
L.ROOM.ALL_IN = "เททั้งหมด"
L.ROOM.CALL = "สู้"
L.ROOM.CALL_NUM = "สู้ {1}"
L.ROOM.SMALL_BLIND = "SB"
L.ROOM.BIG_BLIND = "BB"
L.ROOM.RAISE = "เกทับ"
L.ROOM.RAISE_NUM = "เกทับ {1}"
L.ROOM.CHECK = "ผ่าน"
L.ROOM.BLIND3 = "เดิมพัน\nต่ำสุดx3"
L.ROOM.BLIND4 = "เดิมพัน\nต่ำสุดx4"
L.ROOM.TABLECHIPS = "กองกลาง\n x 1"
L.ROOM.TIPS = {
    "Tips：ท่านสามารถออกเกมส์ในศูนย์การตั้งค่าค่ะ",
    "Tips：บัญชีนักท่องเที่ยวสามารถตั้งรูปประจำตัวและชื่อได้นะ",
    "Tips：ถ้าพบปัญหาใดๆ กรุณาส่งฟีดแบคค่ะ",
    "Tips：ช่องฟีดแบคอยู่ในศูนย์การตั้งค่าค่ะ",
    "Tips：ที่หน้าแฟนส์มีกิจกรรมและโบนัสเพียบเลยค่ะ",
    "Tips：ถ้าโชคไม่ดี อย่าลืมลองเปลี่ยนที่นั่งดูนะ",
    "Tips：ถ้าชอบเกมส์นี้ อย่าลืมไปเชิญเพื่อนมาเล่นด้วยกันนะ",
    "Tips：บางทีโชคดี บางทีโชคร้าย ใจร่มๆ เด๋วจะดีเอง",
   "Tips：ถ้าพบปัญหา กรุณาเก็บรูปไว้แล้วฟีดแบคมาให้เรานะ",
   "Tips：ห้องเกสองใบจะสนุกมากกว่านะ ไปสู้กันเถอะ",
   "Tips：สะสมวันล็อกอิน จะได้รับโบนัสมหาศาล",
   "Tips：คนแจกไพ่เขาเหนื่อยมากเลยนะ อย่าลืมให้ทิปเขาด้วยหล่ะ",
   "Tips：ท่านสามารถรับไอเทมในโชคดีหมุนๆหรือซื้อได้ที่ห้างค่ะ",

}
L.ROOM.SHOW_HANDCARD = "เปิดไพ่"
L.ROOM.SERVER_UPGRADE_MSG = "กำลังอัพเดทเซิร์ฟเวอร์ กรุณารอสักครู่.."
L.ROOM.KICKED_BY_ADMIN_MSG = "ท่านโดนระบบเตะออกจากห้องแล้วค่ะ"
L.ROOM.KICKED_BY_USER_MSG = "ท่านโดนผู้เล่น{1}เตะออกจากห้องแล้วค่ะ"
L.ROOM.TO_BE_KICKED_BY_USER_MSG = "ท่านโดนผู้เล่น{1}เตะออกจากห้อง เกมส์รอบนี้จบจะกลับสู่ล็อบบี้อัตโนมัติค่ะ"
L.ROOM.BET_LIMIT = "แทงชิปล้มเหลว แต่ละรอบไม่สามารถแทงชิปได้มากกว่า 100M ชิปค่ะ "
L.ROOM.BET_LIMIT_1 = "แทงชิปล้มเหลว แต่ละรอบไม่สามารถแทงชิปได้มากกว่า {1} ชิปค่ะ "
T = {}
L.COMMON.CARD_TYPE = T
T1 = {}
T[1] = T1             --点牌
T[2] = "ไพ่สี"         --同花
T[3] = "ไพ่เรียง"         --顺子
T[4] = "ไพ่เซียน"     --小公牌
T[5] = "สเตรทฟลัช"     --同花顺
T[6] = "ไพ่ตอง"         --三公
T1[0] = "ไพ่บอด"        --0点
T1[1] = "ไพ่หนึ่งแต้ม" --1点
T1[2] = "ไพ่สองแต้ม"     --2点
T1[3] = "ไพ่สามแต้ม"     --3点
T1[4] = "ไพ่สี่แต้ม"     --4点
T1[5] = "ไพ่ห้าแต้ม"     --5点
T1[6] = "ไพ่หกแต้ม"     --6点
T1[7] = "ไพ่เจ็ดแต้ม"     --7点
T1[8] = "ไพ่แปดแต้ม"     --8点
T1[9] = "ไพ่เก้าแต้ม"     --9点

TT = {}
L.COMMON.PDENG_CARD_TYPE = TT
TT1 = {}

TT[1] = TT1
TT[2] = "ไพ่เรียง"
TT[3] = "ไพ่เรียงดอก"
TT[4] = "ไพ่สามเหลือง"
TT[5] = "ไพ่ตอง"
TT[6] = "ไพ่ป๊อก"
TT1[0] = "0 แต้ม"
TT1[1] = "1 แต้ม"
TT1[2] = "2 แต้ม"
TT1[3] = "3 แต้ม"
TT1[4] = "4 แต้ม"
TT1[5] = "5 แต้ม"
TT1[6] = "6 แต้ม"
TT1[7] = "7 แต้ม"
TT1[8] = "8 แต้ม"
TT1[9] = "9 แต้ม"

T = {}
L.ROOM.SIT_DOWN_FAIL_MSG = T
T["IP_LIMIT"] = "ขออภัยค่ะ  IP เดียวกันไม่สามารถนั่งได้"
T["SEAT_NOT_EMPTY"] = "ขออภัยค่ะ ที่นั่งนี้มีผู้เล่นอื่นนั่งลงแล้ว"
T["TOO_RICH"] = "ขออภัยค่ะ ท่านมีชิปเยอะเกิน ไม่ควรมาเอาเปรียบมือใหม่นะ"
T["TOO_POOR"] = "ขออภัยค่ะ ชิปไม่พอที่จะนั่งลงค่ะ"
T["NO_OPER"] = "หากท่านไม่ได้ดำเนินการใดๆมากกว่า 3 ครั้ง จะลุกขึ้นเองอัตโนมัติ กรุณานั่งลงใหม่ค่ะ"

L.ROOM.SERVER_STOPPED_MSG = "ขออภัยค่ะ กำลังปรับปรุงเซิร์ฟเวอร์อยู่  เล่นเกมส์ไม่ได้ค่ะ"

L.ROOM.GUIDEHEIGHT = "ไปห้อง {1} จะได้ชิปมากขึ้นนะ"
L.ROOM.GUIDEHEIGHT1 = "ไปห้อง {1} จะได้ชิปทองคำมากขึ้นนะ"
L.ROOM.GUIDELOW = "ไปห้อง {1} จะดีกว่านะคะ！"

L.STORE.NOT_SUPPORT_MSG = "บัญชีคุณไม่สนับสนุนการเติมเงินชั่วคราวค่ะ"
L.STORE.PURCHASE_SUCC_AND_DELIVERING = "ชำระเงินสำเร็จ กำลังจัดส่งสินค้า กรุณารอสักครู่ค่ะ"
L.STORE.PURCHASE_CANCELED_MSG = "ยกเลิกการชำระเงินแล้ว"
L.STORE.PURCHASE_FAILED_MSG = "การเติมเงินล้มเหลว กรุณาลองใหม่ทีค่ะ" --支付失败，请重试
L.STORE.PURCHASE_FAILED_MSG_2 = "กรอกรหัสบัตรผิด กรุณากรอกใหม่ค่ะ" --此卡无效或输入有误，请重试。
L.STORE.DELIVERY_FAILED_MSG = "เน็ตไม่ดีค่ะ กรุณาลองใหม่อีกครั้ง"--网络故障，系统将在您下次打开商城时重试
L.STORE.DELIVERY_SUCC_MSG = "ส่งสินค้าเรียบร้อยแล้ว ขอบคุณค่ะ"
L.STORE.TITLE_STORE = "ห้าง"
L.STORE.TITLE_CHIP = "ชิป"
L.STORE.TITLE_PROP = "ไอเทม"
L.STORE.TITLE_GOLD = "ชิปทองคำ"
L.STORE.TITLE_VIP = "VIP"
L.STORE.TITLE_MY_PROP = "ไอเทมของฉัน"
L.STORE.TITLE_HISTORY = "บันทึกการสั่งซื้อ"
L.STORE.RATE_CHIP = "1{2}={1}ชิป"
L.STORE.RATE_GOLD = "1{2}={1}ชิปทองคำ"
L.STORE.RATE_PROP = "1{2}={1}ไอเทม"
L.STORE.FORMAT_CHIP = "{1} ชิป"
L.STORE.FORMAT_PROP = "{1} ไอเทม"
L.STORE.FORMAT_GOLD = "{1} ชิปทองคำ"
L.STORE.REMAIN = "เหลือ：{1}{2}"
L.STORE.INTERACTIVE_PROP = "ไอเทม"
L.STORE.BUY = "ซื้อ"
L.STORE.USE = "ใช้"
L.STORE.BUY_CHIPS = "ซื้อ {1} ชิป"
L.STORE.BUY_DESC = "ซื้อ {1}"--"购买 {1}"
L.STORE.RECORD_STATUS = {
    "สั่งซื้อเรียบร้อย",
    "ส่งของเรียบร้อย",
    "คืนเงินเรียบร้อย"
}
L.STORE.USE_SUCC_MSG = "ใช้ไอเทมสำเร็จ"
L.STORE.USE_FAIL_MSG = "ใช้ไอเทมล้มเหลว"
L.STORE.NO_PRODUCT_HINT = "ยังไม่มีสินค้าค่ะ" 
L.STORE.NO_BUY_HISTORY_HINT = "ยังไม่มีประวัติเติมเงิน"
L.STORE.MY_CHIPS = "ชิปของฉัน {1}"
L.STORE.BUSY_PURCHASING_MSG = "กำลังสั่งซื้ออยู่ กรุณารอสักครู่.." --正在购买，请稍候..
L.STORE.CARD_INPUT_SUBMIT = "TOP UP"

L.STORE.PROP_DES = "เติมเงินสำเร็จ จะได้รับไอเทม {1} ครั้ง"--"购买后可获得{1}个互动道具"
L.STORE.KICK_CARD_DES = "เติมเงินสำเร็จ จะได้รับบัตรเตะ 1 ใบ"--"购买后可获得1张踢人卡"
L.STORE.E2P_TICKET_DES_1018 = "สั่งซื้อสำเร็จจะได้รับตั๋วชิงมือถือ 1 ใบ"
L.STORE.E2P_TICKET_DES_1019 = "สั่งซื้อสำเร็จจะได้รับตั๋วชิงเงินสด 300 บาท 1 ใบ"
L.STORE.E2P_TICKET_DES_1020 = "สั่งซื้อสำเร็จจะได้รับตั๋วชิงเงินสด 200 บาท 1 ใบ"
L.STORE.E2P_TICKET_DES_1021 = "สั่งซื้อสำเร็จจะได้รับตั๋วชิงทองคำ 1 ใบ"

-- login reward
L.LOGINREWARD.TITLE             = "โบนัสล็อกอินต่อเนื่อง"
L.LOGINREWARD.REWARD            = "โบนัสวันนี้{1}ชิป" 
L.LOGINREWARD.REWARD_ADD        = "1. ล็อกอินต่อเนื่อง {1} วัน รับฟรี {2} ชิป"--"1. 连续登录{1}天奖励{2}游戏币"
L.LOGINREWARD.REWARD_ADD_2      = "2. ล็อกอินผ่านบัญชีเฟสบุ๊ค รับฟรีเพิ่ม 20K ชิป"--"2. FB登录奖励20000筹码"
L.LOGINREWARD.REWARD_ADD_3      = " {1} "
L.LOGINREWARD.PROMPT            = "ล็อกอินต่อเนื่องจะได้รับรางวัลเพียบ มากสุดได้ถึง {1} ชิปต่อวัน"
L.LOGINREWARD.NO_REWARD         = "หลังรับรางวัลมือใหม่ครบ 3 ครั้งแล้วถึงสามารถรับได้ค่ะ"
L.LOGINREWARD.DAYS              = "{1}วัน"
L.LOGIN.CANCELLED_MSG           = "ยกเลิกการล็อกอินแล้ว"
L.LOGIN.FEED_BACK_HINT          = "กรุณาแจ้งปัญหาอล่างละเอียดพร้อมเบอร์โทรของท่าน ทางทีมงานจะรีบติดต่อท่านเพื่อแก้ปัญหาโดยเร็ว ขอบคุณค่ะ "
L.LOGIN.FEED_BACK_TITLE         = "ฟีดแบค"
L.LOGIN.PHONE_NUMBER            = " โปรดกรอกเบอร์โทร (ต้องกรอก)"

-- USERINFO MODULE
L.USERINFO.MAX_MONEY_HISTORY = "ยอดชิปสูงสุด:"
L.USERINFO.MAX_POT_HISTORY = "ชนะได้ชิปสูงสุด: "
L.USERINFO.WIN_RATE_HISTORY = "อัตราชนะ:"
L.USERINFO.INFO_RANKING = "แรงค์กิ้ง:" 
L.USERINFO.BEST_CARD_TYPE_HISTORY = "รูปแบบไพ่ที่ดีที่สุด:"
L.USERINFO.MY_PROPS = "ไอเทมของฉัน:"
L.USERINFO.MY_PROPS_TIMES="X{1}"
L.USERINFO.EXPERIENCE_VALUE = "{1}/{2}" -- 经验值
L.USERINFO.INVITE_FRIEND_COUNT = "เชิญเพื่อน:"
L.USERINFO.MY_GOODS = "ไอเทม"
L.USERINFO.MY_INFOS = "ส่วนตัว"
L.USERINFO.MY_MATCH = "บันทึกแข่ง" --比赛记录
L.USERINFO.HOLIDAY_PROP = "ไอเทมเทศกาล"--节日道具
L.USERINFO.USE_PROP = "ใช้ตอนนี้"--去使用
L.USERINFO.QUICK_USE_PROP = "ใช้ตอนนี้"

L.USERINFO.SCORE_TIPS = "1.ชิปเงินสดใช้แลกของรางวัลจริงได้ เช่น บัตรเงินสด\n\n2.เชิญเพื่อนสำเร็จ 1 ท่าน จะได้รับชิปเงินสด 1 บาท\n\n3.เล่นไพ่ในห้องแข่ง มีโอกาสสูงที่จะได้รับชิปเงินสด"
L.USERINFO.SCORE_TIPS_BTN = "แลก"

-- USERINFOMATCH MODULE
L.USERINFOMATCH.OTHER_CUP = "ถ้วยของเพื่อน"
L.USERINFOMATCH.SELF_CUP = "ถ้วยของฉัน"
L.USERINFOMATCH.WINRATE = "อัตราแชมป์"
L.USERINFOMATCH.MATCHCNT = "จำนวนเข้าแข่ง"

L.USERINFOMATCH.COUNT = "สถิติ"
L.USERINFOMATCH.TOOL = "ไอเทม"
L.USERINFOMATCH.GIFT = "ของขวัญ"
L.USERINFOMATCH.RECORD = "บันทึกการแข่ง"
L.USERINFOMATCH.TYPE = "ห้องแข่ง"
L.USERINFOMATCH.RANDING = "แรงค์กิ้ง"
L.USERINFOMATCH.REWARD = "รางวัล"
L.USERINFOMATCH.TIME = "เวลา"
L.USERINFOMATCH.FB_NOT_EDITSEX = "บัญชี FB ไม่สามารถเปลี่ยนข้อมูลส่วนตัวได้ค่ะ";
L.USERINFOMATCH.FB_NOT_EDITNICK = "บัญชี FB ไม่สามารถเปลี่ยนข้อมูลส่วนตัวได้ค่ะ";
L.USERINFOMATCH.NOREWARD = "ไม่ได้รับรางวัล";

-- FRIEND MODULE
L.FRIEND.NO_FRIEND_TIP = "ยังไม่มีเพื่อน"--暂无好友
L.FRIEND.SEND_CHIP = "ส่งชิป"
L.FRIEND.RECALL_CHIP = "สะกิด+{1}"--召回
L.FRIEND.ONE_KEY_SEND_CHIP = "ส่งชิปให้เพื่อน "
L.FRIEND.ONE_KEY_SEND_CHIP_TOO_POOR = "จำนวนชิปของคุณครึ่งหนึ่งมีไม่ถึงจำนวนชิปที่คุณอยากจะส่ง กรุณาเติมชิปก่อนค่ะ"
L.FRIEND.ONE_KEY_SEND_CHIP_CONFIRM = "คุณยืนยันที่จะส่งชิปทั้งหมด{2}ชิปให้เพื่อน{1}ท่านของคุณหรือไม่？"
L.FRIEND.ADD_FULL_TIPS = "จำนวนเพื่อนของคุณถึงขีดกำหนด{1}ท่านแล้ว ระบบจะลบเพื่อนที่ไม่ได้เล่นไพ่เป็นเวลานานของคุณออกโดยอัตโนมัติค่ะ"
L.FRIEND.SEND_CHIP_WITH_NUM = "ส่งชิป{1}"
L.FRIEND.SEND_CHIP_SUCCESS = "ท่านส่งชิป{1}ให้เพื่อนสำเร็จ"
L.FRIEND.SEND_CHIP_TOO_POOR = "ชิปของท่านมีไม่พอ100k ส่งชิปล้มเหลวค่ะ"
L.FRIEND.SEND_CHIP_COUNT_OUT = "วันนี้ท่านได้ส่งชิปให้เพื่อนคนนี้ไปแล้ว พรุ่งนี้มาส่งใหม่นะ"
L.FRIEND.INVITE_DESCRIPTION = "ส่งคำเชิญให้เพื่อน1คน จะได้รับชิป{1}ทันที\nถ้าเพื่อนได้รับคำเชิญและเข้าเล่นเกมส์ จะได้รางวัลอีก{2}\nและระบบจะส่งรางวัลมือใหม่{3}ให้เพื่อนของท่านอีกด้วย"
L.FRIEND.INVITE_REWARD_TIP = "ท่านได้รับรางวัลเชิญเพื่อนทั้งหมด{1}ชิปแล้ว"
L.FRIEND.INVITE_CODE = "รหัสเชิญของคุณ: "--您的邀请码：
L.FRIEND.INVITE_PROFIT = "ผลกำไรสะสม: "--累计收益：
L.FRIEND.SCAN_DOWN = "สแกน QR โค้ด"--扫描下载
L.FRIEND.INVITE_WITH_LINE = "เชิญผ่าน Line"--Line邀请
L.FRIEND.INVITE_WITH_SMS = "ส่งข้อความ"
L.FRIEND.INVITE_WITH_MORE = "อื่นๆ"--更多邀请
L.FRIEND.SELECT_ALL = "เลือกทั้งหมด"--全选
L.FRIEND.SELECT_NUM = "เลือก {1} คน"--选择{1}人
L.FRIEND.DESELECT_ALL = "ยกเลิก"--取消选择
L.FRIEND.SEND_INVITE = "เชิญเพื่อน"
L.FRIEND.INVITE_SUBJECT = "เกมส์นี้มันเจ๋งมาก"
L.FRIEND.INVITE_CONTENT = "เข้าเล่นเกมส์เก้าเกไทย จะได้รับโบนัส $150000ทันที  http://goo.gl/8RJoIe"
L.FRIEND.INVITE_CONTENT_OLDUSER = "ฉันกำลังเล่นเก้าเกไทยอยู่ เธอไม่ได้เล่นนานแล้ว มาเล่นด้วยกันสิ!"
L.FRIEND.INVITE_CONTENT_SEAT = "{1} กำลังเล่นเก้าเกไทยอยู่ ขอเชิญท่านไปเล่นด้วยกัน!"
L.FRIEND.INVITE_SELECT_TIP = "ท่านได้เลือกเพื่อน{1}คน ส่งคำเชิญก็จะได้รับชิป{2}ทันที"
L.FRIEND.INVITE_SUCC_TIP = "ส่งคำเชิญสำเร็จ ได้รับรางวัลชิป {1}"
L.FRIEND.INVITE_SUCC_FULL_TIP = "ส่งคำเชิญสำเร็จ วันนี้ได้รับรางวัลเชิญเพื่อน {1} ชิปแล้วค่ะ"--"成功发送邀请，今日已获得{1}邀请发送奖励。"
L.FRIEND.INVITE_FULL_TIP = "จำนวนเพื่อนที่เชิญครบจำนวนตามที่ระบบกำหนดไว้แล้ว พรุ่งนี้เชิญใหม่นะคะ" --您今日已达邀请上限，请明日再发送
L.FRIEND.RECALL_SUCC_TIP = "แจกรางวัล {1} ชิป หากเพื่อนรับคำเชิญเข้าเกมส์จะได้รับ {2} ชิปเพิ่ม" --发送成功奖励{1}，好友上线后即可获赠{2}筹码奖励。
L.FRIEND.RECALL_FAILED_TIP = "ส่งคำเชิญล้มเหลว กรุณารอสักครู่ค่อยลองใหม่อีกทีค่ะ" --发送失败，请稍后重试.
L.FRIEND.INVITE_LEFT_TIP = "วันนี้ท่านยังสามารถเชิญเพื่อนได้ {1} ท่าน"--今天还可以邀请{1}个好友
L.FRIEND.CANNOT_SEND_MAIL = "ท่านยังไม่ได้ตั้งค่าอีเมล์ ไปตั้งค่าตอนนี้เลยไหม?"
L.FRIEND.CANNOT_SEND_SMS = "ขออภัยค่ะ ส่งข้อความล้มเหลว"
L.FRIEND.MAIN_TAB_TEXT = {
    "เพื่อนของฉัน", 
    "ค้นหาเพื่อน", --查找用户
    "กลุ่ม"
}
L.FRIEND.INVITE_EMPTY_TIP = "กรุณาเลือกเพื่อนก่อนค่ะ"
L.FRIEND.INVITE_FRIENDS_NUM_LIMIT_TIP =  "ส่งคำเชิญให้เพื่อนมากสุดได้ครั้งละ 50 คนเท่านั้น"
L.FRIEND.TOO_MANY_FRIENDS_TO_ADD_FRIEND_MSG = "ท่านมีเพื่อน{1}คนแล้ว กรุณาลบเพื่อนออกบ้าง แล้วค่อยเพิ่มเพื่อนใหม่ค่ะ"

L.FRIEND.INVITE_OLD_USER_TIP = "ท่านต้องล็อกอินเกมส์ผ่านบัญชีเฟสบุ๊ค ถึงจะสามารถเชิญเพื่อนได้ค่ะ"  -- 您需要使用FB账号登陆才能发送邀请
L.FRIEND.RESTORE_BTN_TIP = "เลิกคำสั่งลบเพื่อน"
L.FRIEND.RETURN_BTN_TIP = "กลับ"
L.FRIEND.RESTORE_NO_DATA = "ท่านยังไม่มีเพื่อนที่ต้องเลิกคำสั่งค่ะ"
L.FRIEND.RESTORE_BTN = "เลิกคำสั่ง"

L.FRIEND.SEARCH_FRIEND = "กรุณากรอกชื่อเพื่อน FB ค่ะ" --"请输入FB好友名称"
L.FRIEND.INVITEMATCH_SELECT_TIP = "ท่านได้เลือกเพื่อนแล้ว {1} คน ส่งคำเชิญจะได้รับคูปองแข่งขัน {2} ใบ"
L.FRIEND.INVITEMATCH_CHIPCNT = "คูปองแข่งขัน+{1}"

L.FRIEND.ALERTLBL11 = "เชิญเพื่อน 1 คน จะได้คูปองแข่งขัน {1}  ทุกวันมีโอกาสรับคูปองมากสุด "
L.FRIEND.ALERTLBL12 = "{1} "
L.FRIEND.ALERTLBL13 = "{1} ใบ"
L.FRIEND.ALERTLBL14 = "เชิญเพื่อนสำเร็จ 1 ท่าน จะได้รับรางวัลแชมป์เพิ่ม: ชิปเงินสด 2 บาท   เชิญเพื่อนได้มากสุด {1} ท่านเท่านั้น โอกาสดีๆแบบนี้ ห้ามพลาด รีบเชิญเพื่อนเข้าเกมส์ รับรางวัลแชมป์ 2 เท่ากัน! "
L.FRIEND.ALERTLBL15 = "เชิญเพื่อนเข้าเกมส์สำเร็จ จะได้รับชิปเงินสดคืน {1} % ของชิปเงินสดที่ท่านใช้แลกสินค้า  เชิญเพื่อนได้มากสุดแค่ {2} ท่านเท่านั้น โอกาสดีๆแบบนี้ ห้ามพลาด รีบเชิญเพื่อนเข้าเกมส์กันเถอะ!"

L.FRIEND.INVITE_ALERTLBL21 = "เชิญเพื่อน 1 ท่าน จะได้รับ{1} " --邀请1位好友可获得
L.FRIEND.INVITE_ALERTLBL22 = "{1} ชิป" --xxx游戏币
L.FRIEND.INVITE_ALERTLBL23 = ",ทุกวันรับสูงสุดถึง {1} "--每天最多可获得
L.FRIEND.INVITE_ALERTLBL11 = "เชิญเพื่อนสำเร็จ 1 ท่าน จะได้รับ {1} " --每成功邀请一位好友,可获得
L.FRIEND.INVITE_ALERTLBL12 = ",หากเพื่อนเล่นไพ่ครบ 60 รอบ จะได้รับฟรี {1} เพิ่ม" -- 好友玩牌60局再奖励
L.FRIEND.RECALL_TITLE = "สะกิดเพื่อน" --召回好友

L.FRIEND.SEARCH = "ค้นหา" --查找
L.FRIEND.CLEAR = "ลบ" --清除
L.FRIEND.INPUT_USER_ID = "กรอกไอดีเพื่อน" --点击输入玩家ID
L.FRIEND.INPUT_USER_ID_NO_EXIST = "ไม่มีไอดีนี้ กรุณากรอกใหม่ค่ะ" --您输入的ID不存在，请确认后重新输入
L.FRIEND.NO_SEARCH_SELF = "ไม่สามารถค้นหาไอดีของตนเองได้ กรุณากรอกใหม่ค่ะ" --无法查找自己的ID，请重新输入
L.FRIEND.NO_LINE_APP = "คุณยังไม่ได้ติดตั้ง Line กรุณาเชิญเพื่อนผ่านช่องทางอื่นค่ะ"--"您没有安装Line应用,请使用其他方式邀请"

-- RANKING MODULE
L.RANKING.TRACE_PLAYER = "ติดตาม" --追踪玩家
L.RANKING.GET_REWARD_BTN = "รับ" --领取 --รับแล้ว
L.RANKING.GET_REWARD_SUCCESS = "รับรางวัลแรงค์กิ้งผลกำไรเมื่อวานสำเร็จ"--领取昨日盈利榜奖励成功
L.RANKING.ALREADY_GET_REWARD = "รับรางวัลแรงค์กิ้งผลกำไรเมื่อวานแล้ว"--昨日盈利榜排名奖励已领取
--提示：根据盈利榜每日24点排名进行奖励\n奖励隔天重置，请及时领取。
L.RANKING.GET_REWARD_TIPS = "คำเตือน : ระบบจะแจกรางวัลแรงค์กิ้งผลกำไรของวัน ณ เวลา 24:00 น.\nโดยรางวัลจะถูกเซ็ตค่าเป็น 0 ในวันถัดไปทุกวัน กรุณารับรางวัลให้ทันเวลาค่ะ"
L.RANKING.GET_REWARD_DESC = "ท่านได้ที่ {1} ใน\nแรงค์กิ้งผลกำไรของเมื่อวาน\nได้รับ {2}" --昨日盈利榜第{1}名\n获得\n{2}
L.RANKING.PROFIT_REWARD_DESC = "ผู้เล่น 20 ท่านแรกใน\nแรงค์กิ้งผลกำไรของเมื่อวาน\nจะได้รับ {1}" --昨日盈利榜前20名\n可获得\n{1}
L.RANKING.REFRESH_TIPS = "รีเฟรชบ่อยเกินไปค่ะ"--刷新的太频繁了！
L.RANKING.EXPECT_TIPS = "กรุณาติดตามด้วยนะคะ"--敬请期待
L.RANKING.NOT_DATA_TIPS = "ยังไม่มีข้อมูลค่ะ"--暂无数据
L.RANKING.YESTERDAY_PROFIT_TITLE = "แชมป์แรงกิ้งผลกำไรเมื่อวาน"--昨日盈利冠军
L.RANKING.YESTERDAY_PROFIT = "ผลกำไร{1}"--盈利
L.RANKING.NOT_IN_CHIP_RANKING = "ท่านไม่ติดอันดับแรงค์กิ้ง ยอดชิป: {1}" --你未能进入榜单，当前游戏币：{1}
L.RANKING.NOT_IN_PROFIT_RANKING = "ท่านไม่ติดอันดับแรงค์กิ้ง ยอดผลกำไร: {1}" --你未能进入榜单，当前盈利：{1}

L.RANKING.PROFIT_RANKING = "ท่านได้ที่ {1} ยอดผลกำไร: {2}" --你排第{1}名，当前盈利：{2}  
L.RANKING.CHIP_RANKING = "ท่านได้ที่ {1} ยอดชิป: {2}" --你排第{1}名，当前游戏币：{2}  
L.RANKING.CASH_RANKING = "ท่านได้ที่ {1} ยอดชิปเงินสด: {2}" --你排第{1}名，当前现金币：{2}  
 
L.RANKING.MAIN_TAB_TEXT = {
    "แรงค์กิ้งเซิร์ฟ", --总排行榜
    "แรงค์กิ้งเพื่อน", --好友排行
}

L.RANKING.SUB_TAB_TEXT_FRIEND = {
    "แรงค์กิ้งชิปเงินสด", -- 现金币榜
    "แรงค์กิ้งชิป", -- 游戏币榜
}

L.RANKING.SUB_TAB_TEXT_GLOBAL = {
    "แรงค์กิ้งผลกำไร", -- 今日盈利榜\n
    "แรงค์กิ้งชิป", -- 游戏币榜
    --"大师积分榜"
}

-- SETTING MODULE
L.SETTING.TITLE = "ตั้งค่า"
L.SETTING.NICK = "ชื่อ"
L.SETTING.PLEASE_USE_FACEBOOK = 'ใช้บัญชี FB รับรางวัลฟรีมากขึ้น!'

L.SETTING.LOGOUT = "ออกเกมส์"
L.SETTING.SOUND_VIBRATE = "เสียงและสั่น"
L.SETTING.SOUND = "เสียง"
L.SETTING.BG_SOUND = "ดนตรี"
L.SETTING.CHATVOICE = "แชทเสียง"
L.SETTING.VIBRATE = "สั่น"
L.SETTING.OTHER = "อื่นๆ"
L.SETTING.AUTO_SIT = "เข้าห้องนั่งลงอัตโนมัติ"
L.SETTING.AUTO_BUYIN = "นำชิปเข้าห้องอัตโนมัติ"
L.SETTING.APP_STORE_GRADE = "ชอบเกมส์นี้ ไปให้ 5 ดาวกัน"
L.SETTING.CHECK_VERSION = "ตรวจสอบเวอร์ชั่นล่าสุด"
L.SETTING.CURRENT_VERSION = "เวอร์ชั่นปัจจุบัน：V{1}"
L.SETTING.ABOUT = "เกี่ยวกับเกมส์"
L.SETTING.FANS = "หน้าแฟนส์"

L.HELP.TITLE = "ศูนย์ความช่วยเหลือ"
L.HELP.SUB_TAB_TEXT = {
    "ฟีดแบค",
    "ข้อสงสัย",
    "วิธีเล่นเกมส์",
    "กติกาเลเวล",
    "กฎเกมส์"
}

L.HELP.FEED_BACK_HINT = "ติดต่อทีมงานได้ทุกวันจันทร์-อาทิตย์ เวลา 09.00-23.00 น.\nเบอร์ติอต่อ： 02-670-0909/02-670-0919 กด 0\nอีเมล์ติดต่อ：9kfeedback@boyaa.com\nไม่ว่าจะติดต่อผ่านศูนย์ความช่วยเหลือในเกมส์หรือ อยากคุยโดยตรงก็ทำได้ทันทีค่ะ"
L.HELP.NO_FEED_BACK = "ยังไม่มีบันทึกฟีดแบค" --您现在还没有反馈记录
L.HELP.FEED_BACK_SUCCESS = "ส่งฟีดแบคสำเร็จ" --反馈成功
L.HELP.UPLOADING_PIC_MSG = "กำลังอัพโหลดรูป..." --正在上传图片，请稍候..
L.HELP.MUST_INPUT_FEEDBACK_TEXT_MSG = "กรุณากรอกเนื้อหาฟีดแบคค่ะ" --请输入反馈内容
L.HELP.MUST_INPUT_FEEDBACK_PHONE_NUM = "กรุณากรอกเบอร์โทรค่ะ"
L.HELP.VIEW_BACK_LIST = ">>บันทึกฟีดแบค" --反馈记录
L.HELP.MATCH_QUESTION = "ปัญหาการแข่งขัน" --比赛问题
L.HELP.FAQ = {
      {
        "รับชิปฟรีที่ไหนบ้าง",
        "มีโบนัสล็อกอิน โบนัสอัพเลเวล โบนัสภารกิจ โบนัสแฟนส์ โบนัสเชิญเพื่อน เป็นต้นแล้วยังมีกิจกรรมต่างๆด้วย"
    },
    {
        "ซื้อชิปอย่างไร",
        {
            "กดปุ่ม",
            "แล้วเลือกยอดชิปที่ท่านต้องการ"
        }
    },
    {
        "กลายเป็นแฟนส์อย่างไร",
        "กดปุ่ม ตั้งค่า มีช่องหน้าแฟนส์ที่ข้างล่าง\nหรือกดไลค์ลิ้งก์ https://www.facebook.com/9kThai\nทางระบบจะแจกโบนัสแฟนส์บ่อยๆค่ะ"
    },
    {
        "ห้องเกสองใบ เล่นอย่างไร",
        "ที่ห้องสู้สองใบ ระบบจะแจกใพ่ท่านละ 2 ใบ ผู้เล่นสามารถเกทับรอบแรกได้ หรือว่าเลือกผ่านก็ได้เมื่อเกทับรอบแรกเสร็จ ระบบจะแจกไพ่ใบที่3ให้ผู้เล่นแต่ละท่าน ผู้เล่นสามารถเกทับอีกรอบได้"
    },
    {
        "ล็อกเอาท์อย่างไร",
        "กดปุ่มตั้งค่า แล้วเลือกกด ออกระบบก็เรียบร้อยละ"
    },
    {
        "เปลี่ยนชื่อ รูป เพศอย่างไร",
        "กดรูปของตัวเองแล้วตั้งเปลี่ยนตามปุ่มที่โชว์ออกมา"
    }
}


L.HELP.RULE = {
    {
        "เงื่อนไขการเทียบรูปแบบไพ่",
        ""
    },
    {
        "กฎของการเรียงไพ่",
        "(A)การเรียงไพ่จากน้อยไปมาก ดังนี้：2<3<4<5<6<7<8<9<10<J<Q<K<A\n(B)การเรียงดอกจากน้อยไปหามาก ดังนี้：ดอกจิก < ข้าวหลามตัด < โพธิ์แดง < โพธิ์ดำ\n(C)การเรียงไพ่จากน้อยไปหามากดังนี้ ไพ่สี < ไพ่เรียง<  ไพ่เซียน<  ไพ่สเตรทฟลัช< ไพ่ตอง"
    },
    {
        "การเดิมพัน",
        "หลังจากที่ผู้เล่นได้ทำการเปิดดูไพ่ทั้งสามใบในมือเป็นที่เรียบร้อยแล้ว ผู้เล่นมีทางเลือกดังต่อไปนื้คือ\n(1) “หมอบ” คือ ยอมแพ้ในตานี้ โดยผู้เล่นจะเสียชิปเดิมพันเริ่มต้นไป\n(2) “เกทับ” คือเพิ่มชิปเดิมพันเพิ่มเข้าไปอีก โดยไม่ต่ำกว่าชิปเดิมพันเริ่มต้น\n(3) “สู้”คือการวางชิปเดิมพันเพิ่มเข้าไป ให้เท่ากับผู้เล่นที่เกทับไปก่อนหน้านี้\n(4) “ผ่าน”คือ การไม่เดิมพันเพิ่มเติม แต่ยังเล่นอยู่เหมือนเดิม"
    },
    {
        "การเปิดไพ่",
        "หลังจากที่ไม่มีผู้เล่นเพิ่มการเดิมพันแล้ว ผู้เล่นทุกท่านจะต้องทำการเปิดไพ่ (ยกเว้นผู้เล่นที่หมอบไปแล้ว)เพื่อทำการเทียบไพ่ หาผลแพ้ชนะ ในกรณีที่มีผู้เล่นหมอบกันหมด แล้ว เหลีอผู้เล่นเพียงท่านเดียว ผู้เล่นที่เหลือคือผู้ชนะ และสามารถเลือกได้ว่าจะทำการเปิดไพ่ให้ผู้เล่นที่เหลือดูหรือไม่"
    },
    {
        "ไพ่ธรรมดานับแต้ม",
        "คือไพ่นับแต้มตามเลขนั้นๆ ยกเว้น 10 J Q K นับเป็น 0 แต้มที่รวมกันเกินสิบ ให้ตัดเลขหลักสิบออก เหลือแต่เลขหลักหน่วย แต้มที่มีค่ามากที่สุดคือ9แต้ม กรณีที่มีแต้มเหมือนกัน ให้ดูไพ่สูงสุดของผู้มีแต่ละท่านว่าใครมีมากกว่ากัน ดูการเรียงไพ่จาก(A) ถ้าแต้มเท่ากันอีก ให้ดูสีของไพ่สูงสุดจาก(B)"
    },
    {
        "ไพ่สี ดอกเดียวกัน",
        "คือไพ่สามใบเป็นไพ่ที่มีดอกเดียวกัน ซึ่งในกรณีที่มีผู้เล่นมีไพ่ดอกเดียวกันหลายๆท่าน ก็ให้พิจารณาจากสีของไพ่ โดยการเรียงดอกของไพ่ให้ดูจากข้อ(B) แล้วถ้ายังเป็นดอกเดียวกันอีก  ก็ให้พิจารณาแต้มของไพ่สูงสุด โดยเทียบได้จากข้อ(A)"
    },
    {
        "ไพ่เรียง",
        "คือไพ่สามใบในมือมีเลขเรียงกัน เช่น 6,7,8 โดยการเรียงของตัวเลขให้ยึดตามข้อ(A)โดยเลขที่เรียงกันแต่ละใบ สีดอกของไพ่อาจจะไม่เหมือนกันก็ได้ ในกรณีที่ผู้เล่นที่ มีไพ่เรียงเหมือนๆกันหลายท่าน ให้พิจารณาจากแต้มการเรียงก่อน ซึ่งถ้ายังเท่ากันอยู่ ก็ให้ดูจากสีของไพ่ใบสูงสุด โดยเทียบสีไพ่ได้จากข้อ(B)"
    },
    {
        "ไพ่เซียน",
        "คือ ไพ่สามใบเป็นไพ่ที่อยู่ในกลุ่ม J Q K เท่านั้น เช่น JJQ, QQK เป็นต้น กรณีที่มีไพ่เซียนเหมือนๆกันหลายท่าน ให้พิจารณาจากแต้มของไพ่สูงสุดก่อน ซึ่งถ้ายังเท่ากันอยู่ ก็ให้ดูจากสีของไพ่สูงสุด"
    },
    {
        "ไพ่สเตรทฟลัช",
        "คือไพ่สามใบในมือเรียงกันโดยมีดอก(สี)เดียวกัน ในกรณีที่ผู้เล่นที่มีไพ่สเตรทฟลัชเหมือนๆกันหลายท่าน ให้พิจารณาจากสีของไพ่ก่อน โดยเทียบสีไพ่ได้จากข้อ(B) ซึ่งถ้ายังเท่ากันอีก ให้ดูที่แต้มไพ่ใบสูงสุดของแต่ละผู้เล่น"
    },
    {
        "ไพ่ตอง",
        "คือไพ่ที่มีเลขเดียวกันทั้งสามใบ (ตอง3มีค่ามากที่สุด รองลงมาคือ ตองA) กรณีตองสู้ตอง ให้พิจารณาจากแต้มของไพ่โดยไม่ต้องดูสีของไพ่ "
    }
}
L.HELP.LEVEL = {
    {
        "เล่นไพ่ได้รับ EXP",
        "ชนะจะได้เพิ่ม EXP  คะแนน EXP ที่ได้ = จำนวนผู้เล่นที่ชนะ x2；แพ้จะถูกหัก EXP1คะแนน  จำนวนคะแนน EXP เพิ่มมากสุดคือวันละ 600 คะแนน",
		"ช่วงมือใหม่(Lv1- LV 3)แพ้จะไม่ถูกหักEXP"
    },
    {
        "รางวัลอัพเลเวล",
      {
            {
                "LV", "สมญานาม", "EXP ทั้งหมด", "รางวัลเลเวล"
            },
            {
                "LV1", "รู้จักเก้าเก", "0", ""
            },
            {
                "LV2", "มือใหม่เก้าเก", "25", "10K ชิป"
            },
            {
                "LV3", "ผู้รักเก้าเก", "80", "20K ชิป"
            },
            {
                "LV4", "มือคลับ", "240", "30k ชิป"
            },
            {
                "LV5", "โปรคลับ", "520", "50k ชิปและไอเทม 10 ครั้ง"
            },
            {
                "LV6", "แชมป์คลับ", "1,249", "    50k ชิป"
            },
            {
                "LV7", "มือประจำเขต", "2,499", "50k ชิป"
            },
            {
                "LV8", "โปรเขต", "4,277", "50k ชิปและไอเทม 15 ครั้ง"
            },
            {
                "LV9", "แชมป์เขต", "7,198", "50k ชิป"
            },
            {
                "LV10", "มือประจำเมือง", "10,990", "200k ชิปและไอเทม 30 ครั้ง"
            },
            {
                "LV11", "โปรเมือง", "16,003", "200k ชิปและไอเทม 20ครั้ง"
            },
            {
                "LV12", "แชมป์เมือง", "22,466", "200k ชิป"
            },
            {
                "LV13", "มือประเทศ", "30,658", "200k ชิป"
            },
            {
                "LV14", "โปรประเทศ", "40,931", "200k ชิป"
            },
            {
                "LV15", "แชมป์ประเทศ", "53,748", "500k ชิป"
            },
            {
                "LV16", "มือเอเชีย", "69,744", "500k ชิปและไอเทม 30 ครั้ง"
            },
            {
                "LV17", "โปรเอเชีย", "89,816", "500k ชิป"
            },
            {
                "LV18", "แชมป์เอเชีย", "115,264", "200k ชิปและไอเทม 30 ครั้ง"
            },
            {
                "LV19", "มืออินเตอร์", "148,000", "500k ชิป"
            },
            {
                "LV20", "โปรอินเตอร์", "190,877", "1M ชิปและไอเทม 60 ครั้ง"
            },
            {
                "LV21", "แชมป์อินเตอร์", "248,186", "1M ชิป"
            },
            {
                "LV22", "มืออันดับโลก", "326,416", "1M ชิป"
            },
            {
                "LV23", "โปรระดับโลก", "435,424", "1M ชิปและไอเทม 60 ครั้ง"
            },
            {
                "LV24", "แชมป์โลก", "590,214", "1M ชิป"
            },
            {
                "LV25", "ตำนานเก้าเก", "813,671", "5M ชิปและไอเทม 100 ครั้ง"
            }
        }
    }
}

L.HELP.PUNISH = {
    {
        "เนื้อหาและนิยามของการกระทำการโกงชิปและการทุจริต",
        [[กระทำการใดๆ อันเป็นการทำลายความยุติธรรม หรือการทำการอันเป็นการเอาเปรียบผู้เล่นอื่น หรือส่งผลกระทบที่ไม่เป็นธรรมต่อสังคมในเกมส์โบยา เช่น การใช้โปรแกรมช่วยเล่นหรือโกงชิป ทุจริต ใช้ BUG (หรือเรียกว่า“ช่องโหว่”หรือ“ข้อบกพร่อง”) ของเกมส์เพื่อแสวงหาผลประโยชน์ที่ไม่ถูกต้อง หรือใช้อินเทอร์เน็ตหรือวิธีอื่น ใช้หรือโฆษณาโปรแกรมช่วยเล่น ซอฟต์แวร์ทุจริต BUG ฯลฯ โกงชิปหมายถึงอะไร？ผู้เล่น A ใช้โปรแกรมช่วยเล่น หรือสมัครบัญชี N ด้วยตนเอง ใช้ BUG ของระบบเพื่อได้รับชิป หรือได้รับชิปที่แจกฟรี (เช่น รางวัลล็อกอินประจำวัน ส่งชิปให้เพื่อนบนเวอร์ชั่นมือถือ) และบัญชีนี้ไม่ได้ถูกใช้เพื่อเล่นเกมส์ตามปกติ (หรือการบันทึกการเล่นไพ่เป็นต้น) การกระทำดังกล่าวถือว่าเป็นการโกงชิป
บทลงโทษ ：
๑.ระงับการใช้งานบัญชีชั่วคราว (ตามความรุนแรงของการฝ่าฝืน ระหว่าง 1~N วัน)
๒.ประกาศการกระทำฝ่าฝืนเพื่อแจ้งให้ผู้เล่นรับรู้และริบชิปที่ได้รับโดยวิธีการที่ผิดกฎเกมส์ หากผู้เล่นมีข้อสงสัยใดๆ สามารถแจ้งข้อสงสัยได้ที่อีเมล์ 9kfeedback@boyaa.com และเมื่อตรวจสอบแล้วไม่พบความผิดผู้เล่นจะได้รับชิปคืนหลังจากตรวจสอบเรียบร้อย ๓ วันต่อไป]]
    },
    {
        "เนื้อหาและนิยามของการเทชิป",
        [[ใช้วิธีเล่นไพ่ให้แพ้เพื่อกระทำการโอนชิป การขายชิป
เทชิปคืออะไร ผู้เล่นใช้วิธีทุจริต เช่นการโกงชิป ขโมยชิปเป็นต้น เพื่อให้ได้รับชิปโดยผิดกฎเกมส์ และโอน หรือขายชิปเข้าบัญชีอื่นต่อไป โดยใช้วิธีการเล่นไพ่ที่ไม่เป็นการเล่นเกมตามปกติ  การทุจริตในการเล่นคืออะไร
หมอบหลายครั้งโดยไม่มีเหตุผลใดๆในรอบเล่นไพ่ที่ผิดปกติ
รวมชิปจากบัญชีหลายตัวเพื่อเทเข้าบัญชีตัวเดียว
รับชิปฟรีแล้วเทออก
หมายเหตุ:ชิปทั้งหมดที่ได้รับจากช่องทางทางการ สามารถใช้ในการเล่นเกมส์ส่วนบุคคลเท่านั้น ห้ามโอนให้บุคคลที่สามโดยวิธีใดๆทั้งสิ้น
บทลงโทษ：
๑.ระงับการใช้งานบัญชีชั่วคราว (ตามความรุนแรงของการฝ่าฝืน ระหว่าง 1~N วัน)
๒.ประกาศการกระทำฝ่าฝืนเพื่อแจ้งให้ผู้เล่นรับรู้และริบชิปที่ได้รับโดยวิธีการที่ผิดกฎเกมส์ หากผู้เล่นมีข้อสงสัยใดๆ สามารถแจ้งข้อสงสัยได้ที่อีเมล์ csth@boyaa.com และเมื่อตรวจสอบแล้วไม่พบความผิดผู้เล่นจะได้รับชิปคืน
หมายเหตุ:หากมีผู้เล่นฟีดแบคมาว่าถูกขโมยชิปโดยผู้อื่น หลังการตรวจสอบ หากเป็นจริงตามที่ว่า จะทำการหักชิปคู่กรณีไว้ก่อน 3 วัน หากไอดีคู่กรณีไม่มีฟีดแบคโต้แย้งกลับมา ให้ทำการชดเชยชิปให้กับผู้ที่ฟีดแบค]]
    },
    {
        "เนื้อหาและนิยามของการการก่อความวุ่นวาย",
        [[เช่นการพิมพ์ข้อความซ้ำๆ เร็วๆ อย่างต่อเนื่องเป็นต้น ซึ่งเป็นการก่อกวน หรือทำลายสังคมในเกมส์
โพสต์ แชร์ หรือสื่อสารข้อความที่ผิดกฎหมาย ผิดศีลธรรม หรือน่ารังเกียจ รวมทั้งใช้คำไม่สุภาพ หมิ่นประมาท สาปแช่ง ด่าประจาน ให้ร้าย ก่อความวุ่นวายกับโบย่าหรือบุคคลอื่น หรือข้อความหยาบคาย ส่อเสียด ล่วงละเมิด หรือคุกคามทางเพศ ความปลอดภัย ชีวิต หรือทรัพย์สินของผู้เล่นอื่น หรือข้อความที่มีลักษณะชักชวน ส่งเสริม หรือยุยงให้เล่นการพนัน หรือเกิดความแตกแยกในสังคม หรือล่วงละเมิดศาสนา หรือสถาบันอันเป็นที่เคารพของคนไทย หรือข้อความที่มีลักษณะเป็นการยุยงให้เกิดการล้มล้างอำนาจการปกครองเป็นต้น หรือตั้งชื่อเว็บไซต์ ชื่อตัวละครในเกมส์ที่ส่อถึงความหมายดังกล่าว
บทลงโทษ：
๑.ตรวจสอบกระทำที่เป็นการฝ่าฝืน
๒.หากตรวจพบหลักฐานว่ามีการฝ่าฝืนจริง ครั้งแรกจะทำการตักเตือน หากมีครั้งต่อไป จะลงโทษตามความรุนแรงของการฝ่าฝืน (เช่นห้ามการสนทนาในเกมส์ ห้ามล็อกอินบัญชี ห้ามใช้บัญชี ระหว่าง 1-N วัน)]]
    },
    {
        "เนื้อหาและนิยามของการประกาศโฆษณา",
        [[ประกาศโฆษณา เสนอซื้อขาย หรือใช้ช่องทางการโพสต์ หรือการประกาศในเกมส์ในลักษณะที่เป็นการละเมิดผลประโยชน์ใดๆ ของโบย่าโดยมิชอบ เช่นขายเงินเกมส์ ไอเทมเกมส์ โปรแกรมช่วยเล่น หรือเทชิป โกงชิปเป็นต้น
บทลงโทษ：
๑.ตรวจสอบกระทำที่เป็นการฝ่าฝืน
๒.หากตรวจพบหลักฐานว่ามีการฝ่าฝืนจริง จะลงโทษตามความรุนแรงของการฝ่าฝืน (เช่นห้ามการสนทนาในเกมส์ ห้ามล็อกอินบัญชี ห้ามใช้บัญชี)]]
    },
    {
        "เนื้อหาและนิยามของการขโมยบัญชี",
        [[การขโมยบัญชีหรือไอเทมของผู้เล่นคนอื่น
บทลงโทษ：
๑.ระงับการใช้งานบัญชีชั่วคราว (ตามความรุนแรง ระหว่าง 1-N วัน) 
๒.ประกาศการกระทำฝ่าฝืนเพื่อแจ้งให้ผู้เล่นรับรู้และริบชิปที่ได้รับโดยวิธีการที่ผิดกฎเกมส์ หากผู้เล่นมีข้อสงสัยใดๆ สามารถแจ้งข้อสงสัยได้ที่อีเมล์ 9kfeedback@boyaa.com และเมื่อตรวจสอบแล้วไม่พบความผิดผู้เล่นจะได้รับชิปคืน]]
    }
}

L.UPDATE.TITLE = "มีเวอร์ชั่นใหม่"
L.UPDATE.DO_LATER = "ยังไม่อัพเดท"
L.UPDATE.UPDATE_NOW = "อัพเดทตอนนี้"
L.UPDATE.HAD_UPDATED = "ท่านใช้เวอร์ชั่นล่าสุดแล้ว"

L.ABOUT.TITLE = "ข้อมูล"
L.ABOUT.UID = "ID เกมส์ของท่าน: {1}"
L.ABOUT.VERSION = "เวอร์ชั่น：V{1}"
L.ABOUT.FANS = "หน้าแฟนส์："
L.ABOUT.FANS_URL = "https://www.facebook.com/9kThai"
L.ABOUT.FANS_OPEN = "https://www.facebook.com/9kThai"
L.ABOUT.SERVICE = "เงื่อนไขการใช้บริการและนโยบายความเป็นส่วนตัว"
L.ABOUT.COPY_RIGHT = "Copyright © 2009-2016 Boyaa Interactive...All Rights Reserved."

L.DAILY_TASK.GET_REWARD = "รับรางวัล" 
L.DAILY_TASK.HAD_FINISH = "สำเร็จ"
L.DAILY_TASK.COMPLETE_REWARD = "ยินดีด้วยค่ะ ท่านทำภารกิจ\"{1}\"สำเร็จ {2}" -- "ยินดีด้วย ท่านเสร็จสิ้นภารกิจ ได้รับ：{1}"
L.DAILY_TASK.CHIP_REWARD = "รางวัล{1}ชิป"
L.DAILY_TASK.TAB_TEXT = {
    "ภารกิจรายวัน",
    "ความสำเร็จ"
}

-- count down box
L.COUNTDOWNBOX.TITLE = "หีบสมบัติ"
L.COUNTDOWNBOX.SITDOWN = "ต้องนั่งลงก่อนถึงจะนับถอยหลังได้ค่ะ"
L.COUNTDOWNBOX.FINISHED = "วันนี้ท่านได้รับรางวัลหีบสมบัติทั้งหมดแล้ว พรุ่งนี้ยังมีอีกนะ"
L.COUNTDOWNBOX.NEEDTIME = "เล่นอีก{1}:{2} จะได้รับรางวัล{3} ชิป"
L.COUNTDOWNBOX.REWARD = "ยินดีด้วย ท่านได้รับรางวัลหีบสมบัติ{1}"
L.COUNTDOWNBOX.TIPS = "หากเชิญเพื่อนเข้าเกมส์สำเร็จ\nจะได้รับรางวัลคูณสอง"  --"成功邀请好友进游戏\n可以得到翻倍奖励"

L.USERINFO.UPLOAD_PIC_NO_SDCARD = "ไม่มี SD การ์ด อัพโหลดรูปไม่ได้ค่ะ"
L.USERINFO.UPLOAD_PIC_PICK_IMG_FAIL = "หารูปไม่เจอค่ะ"
L.USERINFO.UPLOAD_PIC_UPLOAD_FAIL = "อัพโหลดรูปล้มเหลว"
L.USERINFO.UPLOAD_PIC_IS_UPLOADING = "กำลังอัพโหลดรูป..."
L.USERINFO.UPLOAD_PIC_UPLOAD_SUCCESS = "อัพโหลดรูปสำเร็จ"

L.NEWESTACT.NO_ACT = "ยังไม่มีกิจกรรม"
L.NEWESTACT.TITLE = "กิจกรรมล่าสุด"
L.NEWESTACT.LOADING = "กำลังโหลดข้อมูล"
L.NEWESTACT.GET_REWARD_SUCC = "ท่านได้รับ {1} แล้ว"     --"你领取了{1}"

L.FEED.SHARE_SUCCESS = "แชร์สำเร็จ"
L.FEED.SHARE_FAILED = "แชร์ล้มเหลว"
L.FEED.SHARE_LINK = "http://goo.gl/8RJoIe"
L.FEED.LOGIN_REWARD = {
    name = "เก่งมากเลย เมื่อกี๊ได้รับรางวังชิป {1} ในเกมส์เก้าเกไทย ",
    caption = "ล็อกอินทุกวัน ชิปฟรีแจกไม่หยุด ",--天天登录筹码送不停
    link = "http://goo.gl/8RJoIe",
    picture = "http://pclptl9k02-static.boyaagame.com/static/nineke/nineke/share/youwin.jpg",
    message = "",
}
L.FEED.EXCHANGE_CODE = {
    name = "เพิ่งได้รับโบนัสแฟนส์ในเกมส์เก้าเกไทย{1} ",
    caption = "โบนัสแฟนส์แจกทุกวัน",
    link = "http://goo.gl/8RJoIe",
    picture = "http://pclptl9k02-static.boyaagame.com/static/nineke/nineke/images/feed/EXCHANGE_CODE1.jpg",
    message = "",
}
L.FEED.WHEEL_ACT = {
    name = "มาเล่นโชคดีหมุนๆกันเถอะ แจกรางวัลฟรีๆทุกวันเลย",
    caption = "เล่นโชคดีหมุนๆ ได้รับรางวัล100%", 
    link = "http://goo.gl/8RJoIe",
    picture = "http://pclptl9k02-static.boyaagame.com/static/nineke/nineke/images/feed/WHEEL_ACT1.jpg",
    message = "",
}
L.FEED.WHEEL_REWARD = {
    name = "ฉันได้รับรางวัล{1}ในเก้าเกไทย โชคดีหมุนๆไม่หยุด",
    caption = "เล่นโชคดีหมุนๆ ได้รับรางวัล100%",
    link = "http://goo.gl/8RJoIe",
    picture = "http://pclptl9k02-static.boyaagame.com/static/nineke/nineke/images/feed/WHEEL_REWARD1.jpg",
    message = "",
}
L.FEED.UPGRADE_REWARD = {
    name = "สสุดยอดเลย เมื่อกี๊อัพถึงLV{1}แล้ว ได้รับรางวัล{2}ด้วย ",
    caption = "อัพLV รับรางวัลใหญ่",
    link = "http://goo.gl/8RJoIe",
    picture = "http://pclptl9k02-static.boyaagame.com/static/nineke/nineke/images/feed/levelUp/level{1}.png",
    message = "",
}
L.FEED.MATCH_COMPLETE = {
    -- name = "ฉันเล่นเกมส์เก้าเกไทยใน {1} ได้ที่ {2} มาสู้กันซักตั้งสิ!",
    name = "ฉันได้ที่ {2} ใน {1} ของเกมส์เก้าเกไทย เข้าร่วมแข่งขัน รับบัตรเงินสดฟรีกัน！",
    caption = "มาสู้กัน!",
    link = "http://goo.gl/8RJoIe",
    picture = "http://pclptl9k02-static.boyaagame.com/static/nineke/nineke/share/match.jpg",
    message = "",
}
L.FEED.SCORE_EXCHANGE = {
    -- name = "ฉันได้ที่ {1} ในเกมส์เก้าเกไทย มีโอกาสรับบัตรเงินสดฟรี มาร่วมกันสิ",
    name = "ฉันได้รับ {1} ในเกมส์เก้าเกไทย เข้าร่วมแข่งขัน รับบัตรเงินสดฟรีกัน！",
    caption = "มาสู้กัน!",
    link = "http://goo.gl/8RJoIe",
    picture = "http://pclptl9k02-static.boyaagame.com/static/nineke/nineke/images/feed/exchange1.jpg",
    message = "",
}

L.FEED.PROMOT_ACT = {
    name = "",
    caption = "",
    link = "http://goo.gl/8RJoIe",
    picture = "http://pclptl9k02-static.boyaagame.com/static/nineke/nineke/images/mobileAct/team/coalition.jpg",
    message = "",
}

L.FEED.SONGKRAN_ACT = {
    name = "สะสม“สุข มันส์ รวย”แลกแพคเกจรางวัลใหญ่วันสงกรานต์！ล็อกอินเข้าเกมส์เช็คดูรายละเอียด >>>",
    caption = "รื่นเริงขอพร",
    link = "http://goo.gl/8RJoIe",
    picture = "http://pclptl9k02-static.boyaagame.com/static/nineke/nineke/images/mobileAct/playCards/sgjshare.png",
    message = "",
}

L.FEED.ACHIEVEMENT_REWARD = {
    name = "ฉันทำภารกิจ{1}สำเร็จในเกมส์เก้าเกไทย ได้รับรางวัล {2} มาเล่นด้วยกัน！",
    caption = "",
    link = "http://goo.gl/8RJoIe",
    picture = "http://pclptl9k02-static.boyaagame.com/static/nineke/nineke/images/achievement/share.png",
    message = "",
}

L.FEED.CHRISTMAS_ACT = {
    name = "",
    caption = "",
    link = "http://goo.gl/8RJoIe",
    picture = "http://pclptl9k02-static.boyaagame.com/static/nineke/nineke/share/christmas.png",
    message = "",
}

L.FEED.RANK_REWARD = {
    name = "ดีใจจัง เมื่อวานฉันชนะได้ {1} ชิปในเกมส์เก้าเกไทย มาเล่นไพ่กัน ！",
    caption = "",
    link = "http://goo.gl/8RJoIe",
    picture = "http://pclptl9k02-static.boyaagame.com/static/nineke/nineke/share/youwin.jpg",
    message = "",
}

L.SHARE.SUCANDCHECK = " ส่งภาพสำเร็จ\n ทีมงานกำลังเช็คอยู่ \n ระบบจะส่งชิปเงินสดให้ท่านภายใน 24 ชม. กรุณาเช็คดูค่ะ"
L.SHARE.FAIL = "ส่งภาพล้มเหลว กรุณาลองใหม่ค่ะ"
L.SHARE.FAIL_1 = "เน็ตไม่ดี กรุณาเช็คเน็ตก่อนค่อยลองใหม่นะคะ"
L.SHARE.FAIL_2 = "ขนาดภาพใหญ่เกินไป อัพภาพล้มเหลว"
L.SHARE.SHOTANDSAVE = "แคปภาพ"
L.SHARE.SHOTSAVESUC = "แคปภาพสำเร็จ"
L.SHARE.SHOTSAVEFAL = "ขออภัยค่ะ แคปภาพล้มเหลว กรุณาลองใหม่อีกครั้งค่ะ"
L.SHARE.DETAILINFO = "รายละเอียด"
L.SHARE.UPLOAD24 = "สองสามวันมานี้ ท่านยังไม่ได้แลกรางวัลเลยค่ะ\nหลังแลกรางวัล แชร์ภาพรางวัลที่ได้ผ่านบัญชี Line หรือ Facebook รับฟรีชิปเงินสด!\nรีบมาร่วมกัน"
L.SHARE.UPLOAD24_1 = "แลกตอนนี้"
L.SHARE.VIRTUALWORD = "ยินดีด้วยค่ะ ท่านแลกรางวัลสำเร็จ ได้รับ {1}"

-- message
L.MESSAGE.TAB_TEXT = {
    "ข้อความจากเพื่อน", 
    "ข้อความจากระบบ"
}
L.MESSAGE.EMPTY_PROMPT = "ท่านยังไม่มีบันทึกค่ะ"

--奖励兑换码
L.ECODE.TITLE = "แลกโบนัส"
L.ECODE.EDITDEFAULT = "กรอกรหัสโบนัส 6 หลัก / รหัสเชิญ 8 หลัก"--"请输入6位数字奖励兑换码或8位邀请码"
L.ECODE.DESC = "เข้าไปหน้าแฟนส์และกลายเป็นแฟนส์จะได้รับโบนัสทุกๆวันนะคะ \n\nลิงก์หน้าแฟนส์ \nhttps://www.facebook.com/9kThai"
L.ECODE.EXCHANGE = "แลกโบนัส"
L.ECODE.SUCCESS = "ยินดีด้วย แลกโบนัสสำเร็จ\nได้รับรางวัล{1}"
L.ECODE.ERROR_FAILED = "กรอกรหัสโบนัส/รหัสเชิญผิด กรุณากรอกใหม่ค่ะ"
L.ECODE.ERROR_INVALID="แลกโบนัสล้มเหลว รหัสโบนัสนี้หมดอายุแล้ว"
L.ECODE.ERROR_USED = "แลกโบนัสล้มเหลว 1 รหัสใช้แลกได้แค่ 1 ครั้งเท่านั้น\nท่านได้ใช้รหัสนี้แล้วค่ะ{1}"
L.ECODE.ERROR_END= "แลกรางวัลล้มเหลว รางวัลถูกรับไปหมดแล้ว ครั้งหน้ามาใหม่นะ"
L.ECODE.FANS = "เข้าหน้าแฟนส์"
L.ECODE.CODE = "รหัสพินคือ: {1}"
L.ECODE.CODE1 = "สามารถเช็ครหัส PIN ได้ที่บันทึกการแลก"
--大转盘
L.WHEEL.SHARE = "แชร์"
L.WHEEL.REMAIN_COUNT = "เหลือโอกาส"
L.WHEEL.REMAIN_COUNT2 = "เหลือสิทธิ์"
L.WHEEL.TIME = "ครั้ง"
L.WHEEL.TIME2 = "ครั้ง"
L.WHEEL.DESC1 = "บัญชีนักเที่ยวหมุนฟรีวันละ 2 ครั้ง"
L.WHEEL.DESC1_2 = "บัญชี FB หมุนฟรีวันละ 4ครั้ง"
L.WHEEL.DESC2_PRE = "ได้รางวัล"
L.WHEEL.DESC2_POST = "ทุกครั้ง"
L.WHEEL.DESC3 = "ได้รางวัลชัวร์ๆ มากสุดถึง 10m"
L.WHEEL.DESC4 = "เริ่มหมุนเลยค่ะ รอไม่ไหวละ"
L.WHEEL.PLAY = "เริ่ม\nหมุน"
L.WHEEL.REWARD = {
    "ได้รับรางวัล",
    "ยินดีด้วยค่ะ ท่านได้รับรางวัล {1}"
}
L.WHEEL.INVITE_FB = "เชิญเพื่อน"--邀请好友
L.WHEEL.RECALL_FB = "สะกิดเพื่อน"--召回好友
L.WHEEL.NEW_DESC1 = "ทุกวันจะมีโอกาสหมุนวงล้อ 4 ครั้ง"
L.WHEEL.NEW_DESC1_1 = "หากเชิญเพื่อน FB สำเร็จ 1 ท่าน จะเพิ่มโอกาสให้ 1 ครั้ง"
L.WHEEL.NEW_DESC1_2 = "(โอกาสมากสุด 10 ครั้ง/วัน)"
L.WHEEL.NEW_DESC2 = "หมุนวงล้อทุกครั้ง\nได้รางวัลทุกครั้ง"
L.WHEEL.GOTO_RECORD = "เช็คบันทึก"
L.WHEEL.REWARD_RECORD = "ยินดีด้วยค่ะ ท่านได้รางวัล{1}ในการหมุนโชคดีหมุนๆ"
L.WHEEL.DIALOG_CONTENT = "ยินดีด้วยค่ะ ท่านได้รางวัล {1}"
L.WHEEL.DIALOG_KNOWN = "รับทราบค่ะ"
L.WHEEL.DIALOG_SEE = "เช็คบันทึก"

L.WHEEL.LUCKTURN_COMFIRM_PAYFEE = "ยืนยันที่จะใช้ {1} ชิปเงินสดในการหมุนวงล้อ?"
L.WHEEL.LUCKTURN_NOT_ENOUGH_MONEY = "ขออภัย ชิปเงินสดของท่านไม่พอค่ะ"

L.WHEEL.LUCKYRANK = "แรงค์กิ้งโชคถล่ม"
L.WHEEL.MYRECORD = "บันทึกของฉัน"
L.WHEEL.NOLUCKYRANK = "ยังไม่มีท่านใดถูกรางวัลใหญ่เลย ไปหมุนวงล้อสิคะ ไม่แน่นะ ท่านจะเป็นคนโชคดีคนนั้น"
L.WHEEL.NOMYRECORD = "ยังไม่มีบันทึกการลุ้นรางวัลของท่าน ลองไปหมุนวงล้อสิคะ ท่านอาจเป็นผู้โชคดีท่านต่อไป"
L.WHEEL.NOTENOUGHMONEY = "ชิปของท่านมีไม่พอ กรุณาไปสะสมชิปก่อนค่อยมาใหม่นะ"

L.WHEEL.DOWNDUMMYPRESENT = "โหลดเกมส์ไพ่ดัมมี่รับสิทธิ์หมุนวงล้อ 2 ครั้ง"
L.WHEEL.DOWNDUMMYPRESENT2 = "ศูนย์กิจกรรมยังมีโบนัสบิ๊กไซส์แจกไม่อั้น"

L.WHEEL.NOCHANCE = "สิทธิ์หมุนวันนี้มีไม่พอค่ะ"
L.WHEEL.NOCHANCE2 = "ยังไม่มีสิทธิ์หมุนวงล้อ โหลดเกมส์ไพ่ดัมมี่รับสิทธิ์ทันที"

--银行
L.BANK.BANK_BUTTON_LABEL = "ธนาคาร"
L.BANK.BANK_GIFT_LABEL = "ของขวัญของฉัน"
L.BANK.BANK_DROP_LABEL = "ไอเทมของฉัน"
L.BANK.BANK_HALLOWEEN_PROP = "ไอเทมโคมฟักทอง"
L.BANK.BANK_LABA_LABEL = "ลำโพง"
L.BANK.SAVE_BUTTON_LABEL = "ฝากชิป"
L.BANK.DRAW_BUTTON_LABEL = "ถอนชิป"
L.BANK.CANCEL_PASSWORD_SUCCESS_TOP_TIP = "ยกเลิกรหัสสำเร็จ"
L.BANK.CANCEL_PASSWORD_FAIL_TOP_TIP = "ยกเลิกรหัสล้มเหลว"
L.BANK.EMPYT_CHIP_NUMBER_TOP_TIP = "กรุณากรอกยอดชิป"
L.BANK.USE_BANK_NO_VIP_TOP_TIP = "ท่านไม่ใช่ VIP ใช้ธนาคารไม่ได้ค่ะ"
L.BANK.USE_BANK_SAVE_CHIP_SUCCESS_TOP_TIP = "ฝากชิปสำเร็จ"
L.BANK.USE_BANK_SAVE_CHIP_FAIL_TOP_TIP = "ฝากชิปล้มเหลว"
L.BANK.USE_BANK_DRAW_CHIP_SUCCESS_TOP_TIP = "ถอนชิปสำเร็จ"
L.BANK.USE_BANK_DRAW_CHIP_FAIL_TOP_TIP = "ถอนชิปล้มเหลว"
L.BANK.BANK_POPUP_TOP_TITIE = "ธนาคารส่วนตัว"
L.BANK.BANK_INPUT_TEXT_DEFAULT_LABEL = "กรุณากรอกรหัส"
L.BANK.BANK_CONFIRM_INPUT_TEXT_DEFAULT_LABEL = "กรุณากรอกรหัสอีกครั้ง"
L.BANK.BANK_INPUT_PASSWORD_ERROR = "ใส่รหัสผิดค่ะ กรุณากรอกใหม่อีกครั้ง"
L.BANK.BANK_SET_PASSWORD_TOP_TITLE = "ตั้งรหัส"
L.BANK.BANK_SET_PASSWORD_SUCCESS_TOP_TIP = "ตั้งรหัสสำเร็จ"
L.BANK.BANK_SET_PASSWORD_FAIL_TOP_TIP = "ตั้งรหัสล้มเหลว"
L.BANK.BANK_LEVELS_DID_NOT_REACH = "ท่านยังไม่ถึง LV5 ใช้ธนาคารไม่ได้ค่ะ"
L.BANK.BANK_FORGET_PASSWORD_BUTTON_LABEL = "ลืมรหัส"
L.BANK.BANK_CACEL_PASSWORD_BUTTON_LABEL = "ยกเลิกรหัส"
L.BANK.BANK_SETTING_PASSWORD_BUTTON_LABEL = "เปลี่ยนรหัส"
L.BANK.BANK_SETTING_RESETPASSWORD_BUTTON_LABEL = "ตั้งค่ารหัส"

L.BANK.BANK_CANCEL_OR_SETING_PASSWORD = "ท่านสามารถยกเลิกรหัสหรือเปลี่ยนรหัสใหม่ได้ค่ะ"
L.BANK.BANK_FORGET_PASSWORD_FEEDBACK = "หากลืมรหัส กรุณาส่งข้อมูลเหล่านี้ในช่องฟีดแบค \n      1.จำนวนชิปในธนาคาร \n      2.เวลาครั้งล่าสุดที่ใช้ธนาคาร \n      3. เวลาล็อกอินเข้าเกมส์ครั้งแรก \n      4. เคยเติมเงินผ่านช่องทางไหนบ้าง "

L.BANK.USERINFO_BANK_TIPS = "เพื่อความปลอดภัย กรุณาตั้งรหัสผ่านธนาคารก่อนค่ะ"
L.BANK.PROTECT_QUESTIONS = {
    "วันเกิดของท่าน?",     --您的生日
    "วันเกิดของแฟน?",      --您配偶的生日
    "บิดาของท่านชื่อ?",    --您父亲的名字
    "มารดาของท่านชื่อ?",    --您母亲的名字
    "แฟนของท่านชื่อ?",     --您配偶的名字
    "ชอบดาราคนไหนมากที่สุด?" --您最喜欢的明星
}

L.BANK.PROTECT_SET = "ตั้งรหัสป้องกัน"    -- 设置密保
L.BANK.PROTECT_UPDATE = "แก้ไขรหัสป้องกัน" --修改密保
L.BANK.PROTECT_VERIFY = "ยืนยันรหัสป้องกัน"   --验证密保
L.BANK.PROTECT_ANSTIPS = "กรุณากรอกคำตอบค่ะ"  --请输入您的答案
-- L.BANK.PROTECT_TITLETIPS = "หากลืมรหัสสามารถตอบคำถามเพื่อเรียกคืนรหัสได้ ตั้งค่าครั้งแรก รับฟรี 10K ชิป" --忘记密码可通过回答问题找回
-- L.BANK.PROTECT_TITLETIPS = "หากลืมรหัส ตอบคำถามเรียกคืนรหัสได้ ตั้งค่าครั้งแรก รับ 10k ชิป" --忘记密码可通过回答问题找回
L.BANK.PROTECT_TITLETIPS_SET = "ตั้งค่ารหัสป้องกันครั้งแรกสำเร็จ รับรางวัล 10K ชิป" --首次设置密保,可获得10K游戏币
L.BANK.PROTECT_TITLETIPS_UPDATE = "หากลืมรหัส เรียกคืนรหัสผ่านรหัสป้องกันได้"--"忘记密码可通过密保重置密码"
L.BANK.PROTECT_TITLETIPS_VERIFY =  "ตอบคำถามดังต่อไปนี้เพื่อตั้งค่ารหัสใหม่"  --"正确回答以下问题重置密码"
L.BANK.PROTECT_ERRORTIPS = "กรุณากรอกคำตอบค่ะ"  --请输入问题答案
L.BANK.PROTECT_ANSERROR = "คำตอบผิดค่ะ"     --您的答案有误
L.BANK.PROTECT_ANSSUCCESS = "ยืนยันสำเร็จ  กรุณาตั้งค่ารหัสป้องกันใหม่หรือยกเลิกรหัสป้องกัน" --验证成功，请重新设置密码或取消密码
L.BANK.PROTECT_QUES1TITLE = "คำถามที่ 1:" --问题1:
L.BANK.PROTECT_QUES2TITLE = "คำถามที่ 2:" --问题2:
L.BANK.PROTECT_FEEDBACK = "ติดต่อทีมงาน"    --联系客服
L.BANK.PROTECT_ANSTITLE = "คำตอบ:"  --答案:
L.BANK.PROTECT_SETSUCC = "ตั้งค่ารหัสสำเร็จ ได้รับรางวัล 10K ชิป"   -- 密保设置成功
L.BANK.PROTECT_UPDATESUCC = "แก้ไขรหัสป้องกันสำเร็จ"   --密保修改成功
L.BANK.PROTECT_SETERROR = "ตั้งค่ารหัสป้องกันล้มเหลว"    --密保设置失败
L.BANK.PROTECT_VERIFYERROR = "ยืนยันรหัสป้องกันล้มเหลว"   --密保验证失败

L.BANK.MAIN_TAB_TEXT = {
    "ชิป", 
    "ชิปเงินสด"
}
L.BANK.MYSELFBANK="ธนาคาร"
L.BANK.CARRYMONEY="ชิปนอกธนาคาร"


--老虎机
L.SLOT.NOT_ENOUGH_MONEY = "ชิปของท่านไม่พอค่ะ เล่นสล็อตไม่ได้"
L.SLOT.NOT_ENOUGH_GCOINS = "ชิปทองคำนอกห้องของท่านมีไม่พอ เล่นสล็อตไม่ได้ค่ะ"
L.SLOT.SYSTEM_ERROR = "ระบบเกิดความผิดพลาด เล่นสล็อตไม่ได้"
L.SLOT.PLAY_WIN = "ท่านได้รับรางวัลชิป{1}"
L.SLOT.PLAY_WIN_BYGCOIN = "ท่านได้รับรางวัล {1} ชิปทองคำ"
L.SLOT.TOP_PRIZE = "ผู้เล่น{1} เล่นสล็อตได้รับรางวัล{2} ชิป"
L.SLOT.FLASHBAR_TIP = "รางวัลสูงสุด：{1}"
L.SLOT.FLASHBAR_WIN = "ท่านได้รับรางวัล：{1} ชิป"
L.SLOT.FLASHBAR_GCOINS_WIN = "ท่านได้รับ {1} ชิปทองคำ"
L.SLOT.AUTO = "อัตโนมัติ"
L.SLOT.GUIDE = "ว่างๆ อย่าลืมเล่นสล๊อตด้วยนะคะ"

--升级弹框
L.UPGRADE.OPEN = "เปิดรับรางวัล"
L.UPGRADE.SHARE = "แชร์"
L.UPGRADE.GET_REWARD = "ได้รับรางวัล{1}"

--礼物
L.GIFT.SET_SELF_BUTTON_LABEL = "ตั้งเป็นของขวัญของฉัน"
L.GIFT.BUY_TO_TABLE_GIFT_BUTTON_LABEL = "ซื้อให้ผู้เล่น{1}คน"
L.GIFT.CURRENT_SELECT_GIFT_BUTTON_LABEL = "ของขวัญที่ท่านเลือก"
L.GIFT.PRESENT_GIFT_BUTTON_LABEL = "ส่งมอบ"
L.GIFT.DATA_LABEL = "วัน"
L.GIFT.SELECT_EMPTY_GIFT_TOP_TIP = "กรุณาเลือกของขวัญ"
L.GIFT.BUY_GIFT_SUCCESS_TOP_TIP = "ซื้อของขวัญสำเร็จ"
L.GIFT.BUY_GIFT_FAIL_TOP_TIP = "ซื้อของขวัญล้มเหลว"
L.GIFT.SET_GIFT_SUCCESS_TOP_TIP = "ตั้งของขวัญสำเร็จ"
L.GIFT.SET_GIFT_FAIL_TOP_TIP = "ตั้งของขวัญล้มเหลว"
L.GIFT.PRESENT_GIFT_SUCCESS_TOP_TIP = "ส่งของขวัญสำเร็จ"
L.GIFT.PRESENT_GIFT_FAIL_TOP_TIP = "ส่งของขวัญล้มเหลว"
L.GIFT.PRESENT_TABLE_GIFT_SUCCESS_TOP_TIP = "ส่งของขวัญให้ผู้เล่นบนโต๊ะสำเร็จ"
L.GIFT.PRESENT_TABLE_GIFT_FAIL_TOP_TIP = "ส่งของขวัญให้ผู้เล่นบนโต๊ะล้มเหลว"
L.GIFT.NO_GIFT_TIP = "ท่านยังไม่มีของขวัญค่ะ"
L.GIFT.MY_GIFT_MESSAGE_PROMPT_LABEL = "กดเลือกของขวัญที่ต้องการเพื่อประดับรูปประจำตัว"


L.GIFT.SUB_TAB_TEXT_SHOP_GIFT = {
    "ขายดี", 
    "ชั้นเลิศ",
    "เทศกาล",
    "อื่นๆ"
}
L.GIFT.SUB_TAB_TEXT_MY_GIFT = {
    "ซื้อเอง", 
    "เพื่อนให้",
    "ของขวัญจากระบบ"
}

L.GIFT.MAIN_TAB_TEXT = {
    "ของขวัญในห้าง", 
    "ของขวัญของฉัน"
} 

-- 破产
L.CRASH.PROMPT_LABEL = "ท่านได้รับชิปบรรเทาล้มละลาย{1}แล้ว และได้สิทธิ์เข้าร่วมโปรโมชั่นพิเศษด้วย เติมเงินแล้วไปสู้ต่อกันเลย"
L.CRASH.THIRD_TIME_LABEL = "ท่านได้รับชิปบรรเทาล้มละลาย{1}แล้ว และได้สิทธิ์เข้าร่วมโปรโมชั่นพิเศษด้วย เติมเงินแล้วไปสู้ต่อกันเลย"
L.CRASH.OTHER_TIME_LABEL = "ท่านรับชิปบรรเทาล้มละลายไปหมดแล้ว ท่านสามารถไปเติมเงินที่ห้าง หรือล็อกอินทุกวันเพื่อรับชิปฟรีค่ะ"
L.CRASH.TITLE = "ท่านล้มละลายแล้ว" --你破产了！
L.CRASH.CHIPS_TIPS = "ชิปบรรเทา" --破产救济
L.CRASH.CHIPS_TIPS_2 = "ชิปล้มละลาย"--救济金
L.CRASH.REWARD_TIPS = "ล้มละลายไม่ต้องเครียด รับชิปล้มละลายแจกฟรีได้เลยค่ะ"--破产没有关系，还有救济金可以领取
L.CRASH.NO_REWARD_TIPS = "ชิปล้มละลายวันนี้รับหมดแล้ว พรุ่งนี้มารับฟรีเพิ่มนะคะ"--今日救济金已经领取完，明日再来领取

L.CRASH.CHIPS = "{1}ชิป" --游戏币
L.CRASH.CHIPS_INFO = "(ภายใน 2 วัน รับได้มากสุด 3 ครั้ง)"

L.CRASH.INVITE = "เชิญเพื่อน FB"
L.CRASH.INVITE_INFO = "เชิญเพื่อนสำเร็จ"--成功邀请好友

L.CRASH.RECALL = "เรียกเพื่อน FB กลับ"
L.CRASH.RECALL_INFO = "(เรียกเพื่อนกลับเข้าเกมส์ 1 ท่านสำเร็จ)"
L.CRASH.GET = "รับรางวัล"

L.CRASH.PRODUCT = "{1}\n{2}"
L.CRASH.GET_REWARD = "ได้รับรางวัล{1}ชิป" --获得{1}
L.CRASH.GET_REWARD_FAIL = "รับชิปล้มเหลว"  --领取游戏币失败
L.CRASH.E2P_TIP = "จำกัดเฉพาะช่องทาง {1} เท่านั้น" --支付文字提示

L.CRASH.AD_TITLE = "ชิปฟรี"   --免费游戏币
L.CRASH.AD_INFO = "(เล่นไพ่ครบ 10 นาที รับชิปฟรีไปเลย)"  --(试玩游戏10分钟即可领取)
L.CRASH.AD_BTN_TITLE = "เล่นไพ่" --去玩

L.CRASH.MATCH_TITLE = "เล่นห้องแข่งขันฟรี"
L.CRASH.MATCH_INFO = "ลงชื่อฟรีห้องชิงชิปเงินสด 2 บาทได้แล้ว"
L.CRASH.MATCH_BTN_TITLE = "เล่นเดี๋ยวนี้"

-- Facebook登录引导
L.FBGUIDE.TITLE              = 'ใช้บัญชี FB ล็อกอินเกมส์ดีอย่างไร?'
L.FBGUIDE.LINE_1             = '1.ล็อกอินต่อเนื่องทุกวัน รับโบนัสฟรีเพิ่มไปเลย 50K ชิป'
L.FBGUIDE.LINE_2             = '2.ใช้ฟังก์ชั่นเชิญเพื่อน รับชิปฟรีมหาศาล!'
L.FBGUIDE.SWITCH_FB_BTN_TEXT = 'เปลี่ยนเป็นบัญชี FB'
-- 比赛场
L.MATCH.AWARDDLGDESC = "ยินดีด้วยค่ะ {1}\n      ท่านเล่นไพ่ในห้อง {2} ได้ที่ {3} ({4}/{5})! สู้ๆนะคะ!{6}\n{7}"
L.MATCH.AWARDDLGDESC1 = "ท่านเล่นไพ่ใน{1} ได้ที่{2}({3}/{4})"
L.MATCH.AWARDDLGDESC2 = "{1}\n    ยินดีด้วยค่ะ ท่านเล่นไพ่ในห้อง {2} ได้ที่ {3} ({4}/{5})! ผลงานที่ดีที่สุดได้ที่ {6} สู้ๆนะคะ!{7}\n{8}"
L.MATCH.AWARDDLGDESC3 = "ยินดีด้วยค่ะ ท่านแข่งได้ที่ {1}  ได้รับ {2}"
L.MATCH.AWARDHUNT = "คุณกำจัดคู่แข่งไปแล้ว {1} ท่าน ได้ {2} ชิปทองคำ"
L.MATCH.AWARDDLGBACK = "กลับ"
L.MATCH.AWARDDLGSHARE = "แชร์"
L.MATCH.AWARDDLGONEMORE = "ลองอีกครั้ง"
L.MATCH.AWARDDLGWORD = "ได้รับรางวัล:"
L.MATCH.RANKWORD = "ลำดับที่:  "
L.MATCH.RANKINFO = "เดิมพัน:  {1}    "
L.MATCH.STARTINGTIP = "กำลังรอผู้เล่นท่านอื่นเข้าห้อง การแข่งขันจะเริ่มขึ้นในอีก 15 วินาทีข้างหน้าค่ะ"
L.MATCH.WAITOTHERROOMTIP = "ระบบกำลังจัดโต๊ะให้ท่านใหม่อยู่ กรุณารอสักครู่ค่ะ..."
L.MATCH.RANKWORD2 = "  ที่ {1}    "
L.MATCH.LOGINSUCCESS = "ล็อกอินสำเร็จ"
L.MATCH.PUSH = "แจ้งให้ทราบก่อนเปิดแข่ง"
L.MATCH.SCORETEXT = "{1} ชิปเงินสด"
L.MATCH.REALINFO = "ข้อมูลรางวัล"

L.MATCH.NOTENOUGHGAMECOUPON = "ขออภัยค่ะ คูปองแข่งขันของท่านมีไม่พอ"
L.MATCH.NOTENOUGHGOLDCOUPON = "ขออภัยค่ะ บัตรทองของท่านมีไม่พอ"
L.MATCH.NOTENOUGHGOLDCOIN = "ขออภัยค่ะ ชิปทองคำของท่านมีไม่พอ"
L.MATCH.NOTENOUGHCHIPS = "ขออภัย ชิปของท่านมีไม่พอค่ะ"
L.MATCH.NOTENOUGHSCORE = "ขออภัยค่ะ ชิปของท่านมีไม่พอ "
L.MATCH.REGISTERSUCC = "ลงชื่อสำเร็จ"
L.MATCH.REGISTERFAIL = "ลงชื่อล้มเหลว"
L.MATCH.UNREGISTERSUCC = "ยกเลิกการลงชื่อสำเร็จ"
L.MATCH.UNREGISTERFAIL = "ยกเลิกการลงชื่อล้มเหลว"
L.MATCH.REGTICKETSFIAL1 = "ขออภัยค่ะ ตั๋วเข้าแข่งของท่านหมดอายุแล้ว กรุณาเลือกวิธีลงชื่ออื่นๆค่ะ"
L.MATCH.REGTICKETSFIAL2 = "ขออภัยค่ะ ห้องแข่งนี้ใช้ตั๋วเข้าแข่งลงชื่อไม่ได้ กรุณาเลือกวิธีลงชื่ออื่นๆค่ะ"
L.MATCH.REGTICKETSFIAL3 = "ขออภัยค่ะ ท่านไม่มีคูปอง {1} แล้วค่ะ"

L.MATCH.SCORE = "ชิปเงินสด"
L.MATCH.SCOREX = "{1} บาท"
L.MATCH.GOLDCOUPON = "บัตรทอง"
L.MATCH.GAMECOUPON = "คูปองแข่งขัน"
L.MATCH.GOLDCOIN = "ชิปทองคำ"
L.MATCH.GAMECOUPONE2P = "E2P"
L.MATCH.MONEY = "ชิป"
L.MATCH.CHAMPION = "รางวัลแชมป์：{1}"

L.MATCH.SCORE_POOL = "รางวัลกองกลาง:{{1}}"
L.MATCH.ScoreExchange_TITLE = "ยินดีด้วยค่ะ ท่านได้อันดับที่ {1}\n รางวัล {2}"
L.MATCH.ScoreExchange_DESC = "อย่าลืมกรอกข้อมูลที่อยู่เพื่อรับรางวัลนะ และทีมงานจะติดต่อกับท่านภายใน 3 วัน กรุณารับสายด้วยค่ะ "
L.MATCH.SCORE_RANK_DESC = "อันดับที่ {1}: {2} ชิปเงินสด({3}% ของกองกลาง)"

L.MATCH.MATCHTEST = "ตั้งแต่วันนี้เป็นต้นไป เชิญเพื่อนเข้าเกมส์สำเร็จ 1 ท่าน  รับสิทธิ์เล่นห้องแข่งขัน 3 วัน มีโอกาสสูงที่จะได้รับบัตรเงินสดฟรี รีบเชิญเพื่อนแล้วมาสนุกด้วยกัน"

L.MATCH.MATCHFREE = "ฟรี"
L.MATCH.MATCHJOINCONDITION = "เงื่อนไขเข้าแข่ง:"
L.MATCH.MATCHRULE = "กติกา"
L.MATCH.REGISTER = "ลงชื่อ"
L.MATCH.CANCELREGISTER = "ยกเลิกการลงชื่อ"
L.MATCH.MATCHNOTOPEN = "ยังไม่เปิดให้บริการค่ะ"
L.MATCH.MATCHNOTOPENTIPS = "{1}อยู่ในระหว่างการทดสอบ ยังไม่เปิดให้บริการค่ะ ท่านสามารถสะสมคูปองแข่งขันไว้ก่อน รอให้ห้องแข่งขันเปิดตัวอย่างเป็นทางการ แล้วค่อยมาแข่งกันนะคะ!"
L.MATCH.LOGOUTWARNING = "ท่านกำลังแข่งขันอยู่ ยืนยันที่จะออกเกมส์?"
L.MATCH.REGISTER1 = "กำลังลงชื่อ..."
L.MATCH.CANCELREGISTER1 = "กำลังยกเลิก..."

L.MATCH.MATCHRANK = "ลำดับที่"
L.MATCH.MATCHAWARD = "รางวัล"
L.MATCH.MATCHREGNUM = "จำนวนผู้ลงชื่อทั้งหมด: {1}"

L.MATCH.JOINMATCHTIPS = "ห้องแข่งขันที่ท่านลงชื่อกำลังจะเริ่มแข่ง เข้าห้องไปแข่งตอนนี้หรือไม่?"
L.MATCH.JOINMATCHFAILTIPS = "การแข่งขันได้เริ่มขึ้นแล้ว ท่านมาช้าไป คราวหน้ามาเร็วๆนะคะ"

L.MATCH.NOTICE = "ยินดีด้วยค่ะ ท่านได้รับสิทธิ์เข้าร่วมการทดสอบห้องแข่งขัน ฉบับเบต้า หากท่านฟีดแบคปัญหาหรือให้ข้อเสนอแนะกับเรา แล้วทีมงานนำมาใช้จริงในเกมส์ ท่านจะได้รางวัล 50K ชิปฟรี"

L.MATCH.FEEDBACK = "ฟีดแบค"
L.MATCH.FEEDBACK_TYPE = "ชนิดปัญหา"
L.MATCH.FEEDBACK_DESC = "รายละเอียด"

L.MATCH.MATCHSERVERCLOSETIPS = "เชื่อมต่อห้องแข่งขันล้มเหลว กรุณาเข้าห้องแข่งขันใหม่ค่ะ"

L.MATCH.FEEDBACK_TYPE_LIST = {
    "ลงชื่อไม่ได้",
    "ล็อกอิน",
    "เปิดแข่ง",
    "ระหว่างแข่ง",
    "รางวัล",
    "แลกรางวัล",
    "อื่นๆ",
    "ข้อเสนอแนะ"
}
L.MATCH.FEED_BACK_HINT = "กรุณาแจ้งรายละเอียด พร้อมส่งภาพ screenshot ปัญหาที่พบเจอด้วยค่ะ เวลาทำการ 09.00-23.00 น." 

L.MATCH.LOGIN_ROOM_FAIL = "การแข่งขันได้เริ่มไปแล้ว  กรุณาลงชื่อใหม่ค่ะ"

L.MATCH.JOINGAME_COUNT = "เวลาเข้าแข่ง: {1}"

L.MATCH.CHANGING_ROOM_MSG = "กำลังรอห้องอื่นแข่งเสร็จอยู่"
L.MATCH.REGISTER_RET1 = "ลงชื่อซ้ำ"
L.MATCH.REGISTER_RET2 = "ไม่มีไอดีนี้ค่ะ "
L.MATCH.REGISTER_RET3 = "เน็ตไม่ดี" 
L.MATCH.REGISTER_RET4 = "คนลงชื่อครบแล้ว"
L.MATCH.REGISTER_RET5 = "คูปองแข่งขันไม่พอค่ะ"

L.MATCH.RULES_TILE = "ปัญหาที่พบบ่อย"
L.MATCH.RULES_LIST = {
    {
        "1.ความแตกต่างระหว่างตั๋วห้องชิงชิปเงินสดและคูปองแข่งขัน",
        "ตั๋วห้องชิงชิปเงินสดและคูปองแข่งขันสามารถนำมาลงชื่อเข้าแข่งได้ แต่ตั๋วห้องชิงชิปเงินสดแต่ละประเภทจะใช้ได้เฉพาะห้อง และกำหนดอายุการใช้งาน ถ้าหมดอายุจะไม่สามารถใช้งานได้ แต่คูปองแข่งขันจะใช้ได้ทุกห้อง และไม่จำกัดอายุการใช้งาน"
    },
    {
        "2.วิธีรับและใช้คูปองแข่งขัน",
        "เล่นไพ่ชิงชิปเงินสด 2 บาทและ 20 บาท หากได้อันดับตามที่ระบบกำหนด จะได้รับคูปองแข่งขัน ซึ่งคูปองแข่งขันนั้นใช้สำหรับลงชื่อเพื่อเข้าชิงชิปเงินสด 5 บาท 20 บาท และ 100 บาท สามารถหาซื้อได้ในห้าง"
    },
    {
        "3.วิธีรับและใช้บัตรทอง",
        "บัตรทองสามารถนำมาลงชื่อเข้าห้องชิงรางวัลจริงรายสัปดาห์และรายเดือนที่จะเปิดในเร็วๆนี้ได้"
    },
    {
        "4.วิธีรับและใช้ชิปเงินสด",
        "เข้าแข่งชิงชิปเงินสด 2 บาท 5 บาท 20 บาท และ 100 บาท ผู้ที่ได้อันดับต้นๆจะได้รับชิปเงินสดฟรี รายละเอียดรางวัลสามารถดูได้ตามห้องชิปต่างๆ โดยชิปเงินสดสามารถนำมาแลกรางวัลและเข้าร่วมหมุนวงล้อนำโชคได้"
    }
}
L.MATCH.CANCELTIP1 = "ผู้เข้าร่วมแข่งขันมีน้อยเกินไป การแข่งขันรอบนี้ถูกยกเลิก ค่าเข้าแข่งขันของท่านถูกส่งกลับเข้าบัญชีเรียบร้อยแล้ว กรุณาตรวจสอบค่ะ"
L.MATCH.CANCELTIP2 = "{2} {1} ที่ท่านลงชื่อไว้นั้นได้ถูกยกเลิกแล้ว ค่าเข้าแข่งขันของท่านถูกส่งกลับเข้าบัญชีเรียบร้อยแล้ว กรุณาตรวจสอบค่ะ"
L.MATCH.CANCELREASON1 = "เนื่องจากเน็ตของท่านช้าเกินไป"
L.MATCH.CANCELREASON2 = "เนื่องจากผู้ลงชื่อเข้าร่วมแข่งขันมีน้อยเกินไป"

L.MATCH.TIMESTART = "{1} เปิดแข่ง"
L.MATCH.LEFTTIMESTART = "เวลาเปิดแข่งขัน:"
L.MATCH.REGED = "ลงชื่อสำเร็จ"
L.MATCH.EVALMONEY = " (ประมาณเท่ากับ {1} บาท)"
L.MATCH.CONDITION1 = "เงื่อนไข:" 
L.MATCH.CONDITION2 = "เวลาเปิดแข่ง:"
L.MATCH.CONDITION3 = "รางวัล"
L.MATCH.CONDITION4 = "กติกา"
L.MATCH.CONDITION5 = "บันทึกการแข่ง"
L.MATCH.ONLY_SHOW = "แสดงผู้เล่นล่าสุด 100 คน"
L.MATCH.GOT_REWARD_MATCH = "ผู้เล่นที่ได้รับรางวัล"
L.MATCH.MY_MATCH_REWARD = "บันทึกของฉัน"
L.MATCH.BESTRECORD = "ผลงานเด่นสุด：อันดับที่ {1}，{2}"
L.MATCH.MATCHTIME = "เวลา"
L.MATCH.MATCHRANK = "อันดับ"
L.MATCH.MATCHREWARD = "รางวัล"
L.MATCH.MATCHACT = "ตรวจเช็ค"
L.MATCH.MATCHDETAIL = "เช็ครายละเอียด"
L.MATCH.REWARD_TIPS = "ยินดีด้วยค่ะ ท่านได้อันดับที่ {1} "
L.MATCH.REWARD_E2P_TIPS = "กรุณากรอกเบอร์ติดต่อ รางวัลจะส่งผ่านโทรศัพท์ของท่านไปให้ภายหลังค่ะ!"
L.MATCH.REWARD_E2P_ERROR = "กรุณาตรวจสอบเบอร์ติดต่อให้ถูกต้องอีกครั้งก่อนส่งค่ะ!"
L.MATCH.REWARD_CUP_TIPS = "ถ้วยแชมป์"
L.MATCH.NO_RECORD = "ไม่มีบันทึกการแข่ง"

L.MATCH.AVERAGE_TIME = "เวลาเปิดแข่งเฉลี่ย {1} วินาที"
L.MATCH.LEFT_TIME = "อีก {1} วินาทีเปิดแข่ง"
L.MATCH.ALERTTIPS1 = "เงื่อนไขการลงชื่อ：{1}"
L.MATCH.ALERTTIPS2 = "วิธีรับ：{1}"
L.MATCH.MATCHTIPSCANCEL = "ไม่แสดงอีก"
L.MATCH.INVITE_BUBBLETIP = "เชิญเพื่อนเข้าเกมส์สำเร็จ 1 ท่าน เล่นห้องแข่งขันได้ฟรี"
L.MATCH.RESULT_VITEFRIEND_TIPS1 = "ยินดีด้วยค่ะ ท่านได้เป็นแชมป์ในการแข่งรอบนี้ เชิญเพื่อนๆที่นี่ จะได้รับรางวัลพิเศษเพิ่มค่ะ!"
L.MATCH.RESULT_VITEFRIEND_TIPS2 = "ยินดีด้วยค่ะ ท่านได้ที่ 2 ในการแข่งรอบนี้ เชิญเพื่อนๆที่นี่ จะได้รับรางวัลชิปเงินสดเท่ากับที่แชมป์ได้นะคะ!"
L.MATCH.SCORE_VITEFRIEND_TIPS = "เชิญเพื่อนเข้าเกมส์สำเร็จ จะได้รับชิปเงินสดฟรี มากสุดมีโอกาสรับชิปเงินสดถึง {1} % ของชิปเงินสดที่ท่านใช้แลกสินค้าค่ะ "
L.MATCH.LEFTPLAYTIMES = "วันนี้ยังเหลือโอกาสเล่นฟรี {1} ครั้ง"
L.MATCH.LEFTPLAYTIMES_1 = "วันนี้เหลือโอกาสฟรี: {1} ครั้ง  หลัง {2} น. ฟรีอีก 1 ครั้ง"
L.MATCH.NOTIMESTIPS = "ทุกวันมีโอกาสเล่น {2} ฟรี {1} ครั้ง วันนี้ท่านใช้สิทธิ์ครบแล้ว ใช้ {3} ชิปสามารถแลกสิทธิ์เล่นเพิ่มได้ {4} ครั้ง ยืนยันที่จะแลก?"
L.MATCH.NOTIMESTIPS_1 = "ทุกวันมีโอกาสเล่น {2} ฟรี {1} ครั้ง วันนี้โอกาสของท่านใช้หมดแล้ว อีก {3} จะได้รับโอกาสฟรีอีก 1 ครั้งค่ะ"
L.MATCH.NOTIMESTIPS_2 = "ไม่อ่ะ ฉันจะใช้ {1} ชิปแลกโอกาส {2} ครั้งทันที"
L.MATCH.NOTIMESBUY = "ขออภัยค่ะ ชิปของท่านมีไม่พอ กรุณาเพิ่มชิปก่อนนะ จะซื้อชิปเดี๋ยวนี้ไหมคะ"
L.MATCH.NOTIMESEXFIAL = "แลกล้มเหลว กรุณาลองใหม่นะคะ"
L.MATCH.ROOMDEFEND = "ระบบกำลังปรับปรุงห้องนี้อยู่ กรุณารอสักครู่นะคะ"
L.MATCH.ROOMDEFEND1 = "ขออภัยค่ะ ห้องแข่งนี้ยังไม่ได้อัพเดทข้อมูลใหม่ ฝากติดตามด้วยนะคะ!"

L.MATCH.REBUYTITLE = "ซื้อใหม่"
L.MATCH.REBUYTIPS = "Tips: ชิปที่ซื้อใช้ได้เฉพาะห้องแข่งครั้งนี้ นำออกห้องไม่ได้ค่ะ"
L.MATCH.REBUYAVERAGE = "ขณะนี้ชิปเฉลี่ยของแต่ละคนคือ {1} กรุณาเลือกจำนวนชิปที่อยากจะซื้อใหม่ค่ะ"
L.MATCH.REBUYTIME = "เหลือเวลาคิด   {1}   วินาที"
-- 积分兑换奖励
L.SCOREMARKET.TAB1 = "แลกรางวัล"
L.SCOREMARKET.TAB2 = "บันทึกการแลก"
L.SCOREMARKET.SUBTAB1 = "ชุดของขวัญ"
L.SCOREMARKET.SUBTAB2 = "บัตรเงินสด"
L.SCOREMARKET.SUBTAB3 = "Line Coins"
L.SCOREMARKET.SUBTAB4 = "ของรางวัล"
L.SCOREMARKET.SUBTAB5 = "วงล้อนำโชค"
L.SCOREMARKET.SUBTAB6 = "รางวัลใหญ่"
L.SCOREMARKET.SUBTAB7 = "สปอนเซอร์"
L.SCOREMARKET.COPY = "คัดลอก"
L.SCOREMARKET.COPY_SUCCESS = "คัดลอกสำเร็จ"
L.SCOREMARKET.SEE = "ตรวจเช็ค"

L.SCOREMARKET.MYSCORE = "ชิปเงินสดของฉัน:"
L.SCOREMARKET.COMMINGTIPS = "สวัสดีค่ะ ผู้เล่นที่เคารพ ระบบกำลังเตรียมของอยู่ อย่าลืมติดตามกันนะคะ"
L.SCOREMARKET.NORECORD = "ยังไม่มีบันทึก"
L.SCOREMARKET.LEFTWORD = "จำนวนที่เหลือ: {1}"
L.SCOREMARKET.NOLEFT = "ถูกแลกหมดแล้ว"
L.SCOREMARKET.GOODSFULL = "ยังมีรางวัล"
L.SCOREMARKET.RECHANGENUM = "{1} ชิปเงินสด"
L.SCOREMARKET.NOTENOUGHTIPS = "ขออภัยค่ะ ชิปเงินสดสะสมของท่านมีไม่พอ กรุณาเลือกสินค้าอื่นค่ะ"
L.SCOREMARKET.RECHANGECONFIRM = "ท่านจะใช้ {1} ชิปเงินสด แลก {2}? "

L.SCOREMARKET.JOIN_LUCKTURN = "เข้าร่วม"
L.SCOREMARKET.RECEIVE_ADDRESS = "ที่อยู่"
L.SCOREMARKET.RECEIVE_INFOS = "ข้อมูลรับรางวัล"
L.SCOREMARKET.SAVE_ADDRESS = "บันทึก"
L.SCOREMARKET.USER_NAME = "ชื่อ-สกุล"
L.SCOREMARKET.USER_SEX = "เพศ"
L.SCOREMARKET.MOBEL_TEL = "เบอร์โทร"
L.SCOREMARKET.DETAIL_ADDRESS = "ที่อยู่"
L.SCOREMARKET.EMAIL = "อีเมล์"
L.SCOREMARKET.FEMALE = "หญิง"
L.SCOREMARKET.MAN = "ชาย"
L.SCOREMARKET.SAVEADDRESS_FAIL = "บันทึกที่อยู่ล้มเหลว"
L.SCOREMARKET.SAVEADDRESS_SUCCESS = "บันทึกที่อยู่สำเร็จ"

L.SCOREMARKET.CONSUME_SCORE = "ท่านต้องใช้ {1} ชิปเงินสดในการแลกค่ะ"
L.SCOREMARKET.CONFIRM_ADDRESS_TIP = "โปรดยืนยันข้อมูลอีกครั้ง！"
L.SCOREMARKET.CONFIRM_EXCHANGE = "ตกลง"
L.SCOREMARKET.EXCHANGE = "แลก"
L.SCOREMARKET.MODIFY_INFO = "แก้ไขข้อมูล>>"
L.SCOREMARKET.EXCHANGE_CONDITION = "เงื่อนไขการแลก"
L.SCOREMARKET.EXCHANGE_CONDITION_DESC = "ใช้ {1} ชิปเงินสดในการแลกรางวัล"
L.SCOREMARKET.EXCHANGE_LEFT_CNT = "เหลือ:{1}"
L.SCOREMARKET.NOTENOUGH_SCORE = "ชิปเงินสดของท่านมีไม่พอ ไปห้องแข่งชิงชิปเงินสดกันค่ะ"
L.SCOREMARKET.NOTENOUGH_GOODS = " สินค้าถูกแลกหมดแล้ว ระบบจะเพิ่มสินค้าให้ใหม่โดยเร็วค่ะ"
L.SCOREMARKET.NOTENOUGH_LEFT_CNT = "ถูกแย่งหมดแล้ว"
L.SCOREMARKET.EXCHANGE_SUCCESS_DESC = "ยินดีด้วยค่ะ ท่านแลก {1} สำเร็จ ทีมงานจะติดต่อกลับภายใน 3 วัน  กรุณารอรับสายด้วยค่ะ"
L.SCOREMARKET.EXCHANGE_SUCCESS_TIP = "แลกสำเร็จ"
L.SCOREMARKET.EXCHANGE_CONFIRM = "ตกลง"
L.SCOREMARKET.ALERT_WRITEADDRESS = "กรุณากรอก {1}"

L.SCOREMARKET.CITY = {
    "กรุงเทพฯ",
"สมุทรปราการ",
"นนทบุรี",
"ปทุมธานี",
"อยุธยา",
"อ่างทอง",
"ลพบุรี",
"สิงห์บุรี",
"ชัยนาท",
"สระบุรี",
"นครนายก",
"ชลบุรี",
"ระยอง",
"จันทบุรี",
"ตราด",
"ฉะเชิงเทรา",
"ปราจีนบุรี",
"สระแก้ว",
"นครราชสีมา",
"บุรีรัมย์",
"สุรินทร์",
"ศรีสะเกษ",
"อุบลราชธานี",
"ยโสธร",
"บึงกาฬ",
"ชัยภูมิ",
"อำนาจเจริญ",
"หนองบัวลำภู",
"ขอนแก่น",
"อุดรธานี",
"เลย",
"หนองคาย",
"มหาสารคาม",
"ร้อยเอ็ด",
"กาฬสินธุ์",
"สกลนคร",
"นครพนม",
"มุกดาหาร",
"เชียงใหม่",
"ลำพูน",
"ลำปาง",
"อุตรดิตถ์",
"แพร่",
"น่าน",
"พะเยา",
"เชียงราย",
"แม่ฮ่องสอน",
"นครสวรรค์",
"อุทัยธานี",
"กำแพงเพชร",
"ตาก",
"สุโขทัย",
"พิษณุโลก",
"พิจิตร",
"เพชรบูรณ์",
"ราชบุรี",
"กาญจนบุรี",
"สุพรรณบุรี",
"นครปฐม",
"สมุทรสาคร",
"สมุทรสงคราม",
"เพชรบุรี",
"ประจวบคีรีขันธ์",
"นครศรีธรรมราช",
"กระบี่",
"พังงา",
"ภูเก็ต",
"สุราษฎร์ธานี",
"ระนอง",
"ชุมพร",
"สงขลา",
"สตูล",
"ตรัง",
"พัทลุง",
"ปัตตานี",
"ยะลา",
"นราธิวาส"
}

L.SCOREMARKET.CONFIRM_RECEIVER_REWARD = "ฉันได้รับรางวัลแล้ว"
L.SCOREMARKET.UPDATE_ORDER_STATUS_FAIL = "อัพเดทสถานะออเดอร์รางวัลล้มเหลว:{1}"
L.SCOREMARKET.EXCHANGE_NUM_TXT = "{1} ท่านแลกแล้ว"
L.SCOREMARKET.RECEIVER_TIME = "เวลาได้รับรางวัล: {1}"
L.SCOREMARKET.GETWAY_TXT = "วิธีได้รับรางวัล: {1}"
L.SCOREMARKET.BTN_GOOD_TXT = "ให้คะแนน 5 ดาว"
L.SCOREMARKET.CARD_LBL = "ข้อมูลบัตร"
L.SCOREMARKET.PIN_CODE_LBL = "รหัส PIN：{1}"
L.SCOREMARKET.CARD_NUM_LBL = "ซีเรียลบัตร：{1}"
L.SCOREMARKET.VALIDITY_LBL = "เวลาหมดอายุ：{1}"
L.SCOREMARKET.TIPS_DSC_MSG = "ท่านได้รับรางวัล {1} คำเตือน：สามารถ copy รหัส PIN กรุณาใช้บัตรเติมเงินก่อนหมดอายุนะคะ"
L.SCOREMARKET.GOODS_STATUST_TITLE = "สถานะ"
L.SCOREMARKET.GOODS_STATUST_TEL = "กรุณาติดต่อทีมงาน"
L.SCOREMARKET.GOODS_STATUST_TELED = "ยืนยันที่อยู่แล้ว"
L.SCOREMARKET.GOODS_STATUST_DELIVER = "กำลังจัดส่งของอยู่"
L.SCOREMARKET.GOODS_STATUST_DELIVERED = "ส่งของแล้ว"
L.SCOREMARKET.GOODS_STATUST_RECEIVE = "ได้รับของแล้ว"
L.SCOREMARKET.GOODS_STATUST_RECEIVED = "รับของเรียบร้อย"
L.SCOREMARKET.GOODS_STATUST_SUCC = "เสร็จเรียบร้อย"
L.SCOREMARKET.GM_TEL_TXT = "ฝ่ายบริการลูกค้า 026700909/026700919 กด 0 ทุกวันจันทร์-อาทิตย์ เวลา 09.00-18.00 น."
L.SCOREMARKET.BTN_RECEIVER_TXT = "ฉันได้รับรางวัลแล้ว"
L.SCOREMARKET.BTN_UP_PIC_TXT = "อัพโหลดรูป"
L.SCOREMARKET.BTN_GOOD_TIPS_TXT = "ความสนับสนุนของท่านคือแรงผลักดันของทีมงานค่ะ"
L.SCOREMARKET.BTN_UP_PIC_TIPS_TXT = "อัพโหลดรูป ทำความรู้จักกับเพื่อนอื่นๆ"
L.SCOREMARKET.EXCHANGE_INFO_LBL = "มีผู้เล่น {1} ท่านแลกรางวัลสำเร็จแล้ว"
L.SCOREMARKET.SEE_BTN_LBL = "ตรวจเช็ค"
L.SCOREMARKET.CHECKBOX_TEXT = "ตรวจเช็คบันทึกทั้งหมด"
L.SCOREMARKET.FOCUS_SUCC = "ติดตามสำเร็จ"
L.SCOREMARKET.FOCUS_TXT = "ติดตาม"
L.SCOREMARKET.MATCH_REAL_ALERT_TIPS = "ยินดีด้วยค่ะ  คุณได้รับรางวัล {1} เพื่อความปลอดภัยของรางวัลถึงมือคุณ 100% กรุณาติดต่อฝ่ายบริการลูกค้าภายใน 3 วัน ฝ่ายบริการลูกค้า 02-670-0909/02-670-0919 กด 0 ทุกวันจันทร์-อาทิตย์ เวลา 09.00-18.00 น. ขอบคุณค่ะ"
L.SCOREMARKET.MARKET_REAL_ALERT_TIPS = "สวัสดีค่ะ รางวัลชิ้นนี้มีมูลค่าสูง เพื่อความปลอดภัยของรางวัลถึงมือผู้เล่น 100% บริษัทโบย่าขอสงวนสิทธิ์ให้ผู้เล่นมารับของรางวัลที่บริษัทพร้อมบัตรประชาชนด้วยตนเองเท่านั้น ไม่เช่นนั้นจะถือว่าสละสิทธิ์ในการรับรางวัล ท่านยืนยันที่จะแลกรางวัลนี้หรือไม่คะ?"
L.SCOREMARKET.STATUST_TIPS = {
    "ยินดีด้วยค่ะ  คุณได้รับรางวัล {1}  กรุณาติดต่อฝ่ายบริการลูกค้าเพื่อยืนยันที่อยู่อีกครั้งภายใน 3 วัน ขอบคุณค่ะ",
    "ยืนยันที่อยู่เรียบร้อยแล้ว ระบบกำลังจัดส่งรางวัลอยู่ค่ะ",
    "ระบบส่งรางวัลเรียบร้อยแล้ว   กรุณารอรับสายทีมงานจัดส่งของด้วย  เพื่อป้องกันสินค้าตีกลับค่ะ ",
    "ยินดีด้วยค่ะ รางวัลถึงมือท่านแล้ว ขอบคุณที่ให้การสนับสนุนกับเกมส์เก้าเกไทยมาโดยตลอดค่ะ ",
    "ยินดีด้วยค่ะ คุณได้รับรางวัล {1}  กรุณาติดต่อฝ่ายบริการลูกค้าเพื่อยืนยันวันและเวลาที่จะมารับรางวัลภายใน 3 วัน ขอบคุณค่ะ."
}
L.SCOREMARKET.STATUST_TXT = {
    ["1"]=L.SCOREMARKET.GOODS_STATUST_TEL,
    ["2"]=L.SCOREMARKET.GOODS_STATUST_RECEIVE,
    ["3"]=L.SCOREMARKET.GOODS_STATUST_RECEIVED,
    ["4"]=L.SCOREMARKET.GOODS_STATUST_DELIVER,
    ["5"]=L.SCOREMARKET.GOODS_STATUST_SUCC,

    ["11"]=L.SCOREMARKET.GOODS_STATUST_TELED,
    ["12"]=L.SCOREMARKET.GOODS_STATUST_DELIVERED,
}
L.SCOREMARKET.STATUST_RESLIST = {
    ["1"]="sm_status_1.png",
    ["2"]="sm_status_3.png",
    ["3"]="sm_status_5.png",
    ["4"]="sm_status_2.png",
    ["5"]="sm_status_4.png",
    ["11"]="sm_status_1.png",
    ["12"]="sm_status_3.png",
}
L.SCOREMARKET.UPLOAD_PIC_NO_SDCARD = "ไม่มี SD การ์ด อัพโหลดรูปไม่ได้ค่ะ"
L.SCOREMARKET.UPLOAD_PIC_PICK_IMG_FAIL = "หารูปไม่เจอค่ะ"
L.SCOREMARKET.UPLOAD_PIC_UPLOAD_FAIL = "อัพโหลดรูปล้มเหลว กรุณาลองใหม่ค่ะ "
L.SCOREMARKET.UPLOAD_PIC_IS_UPLOADING = "กำลังอัพโหลดรูป กรุณารอสักครู่ค่ะ"
L.SCOREMARKET.UPLOAD_PIC_UPLOAD_SUCCESS = "อัพโหลดรูปสำเร็จ"

L.SCOREMARKET.GET_GOODS_WAY_LIST = {"รางวัลห้องแข่ง", "วงล้อนำโชค"}
L.SCOREMARKET.NIL_EXCHANGE_TIP = "ยังไม่มีคนแลก"
L.SCOREMARKET.BIG_EXCHANGE_SUCC_MSG = "{1} ท่านแลกแล้ว"

L.SCOREMARKET.LINE_COIN_BTN_LBL = "วิธีใช้งาน"
L.SCOREMARKET.LINE_COIN_DESC = "PIN CODE Line Free Coins ใช้อย่างไร?"
L.SCOREMARKET.LINE_COIN_TITLE = "วิธีใช้ PIN CODE Line Free Coins"
L.SCOREMARKET.LINE_COIN_DESC_LIST = {    
    "1.ล็อกอินบัญชี Line ของท่านที่เว็บไซต์ ",
    "2.กด [เติมเงิน] เพื่อเข้าสู่หน้าเติมเงิน",
    "3.กดเลือก [LINE GIFT CODE] แล้วเลือก [ต่อไป]",
    "4.กรอก PIN CODE ของท่าน แล้วกด [เติมเงิน]",
    "5.เติมเงินสำเร็จ"
}

L.SCOREMARKET.TRUE_FLOW_SEE_DESC = "เปิดดูธีใช้แพ็คเกจเสริมเน็ต"
L.SCOREMARKET.TRUE_DESC_TITLE = "วิธีใช้แพ็คเกจเสริมเน็ตทรู {1}M："
L.SCOREMARKET.TRUE_DESC_LIST = {"1.หากได้รับรหัส PIN แล้ว เติมเน็ตโดยกด *799*5* ตามด้วยรหัส PIN 10 หลัก กด*{1}# แล้วโทรออก", "2.หลังเปิดใช้งานแล้ว แพ็คเกจเสริมเน็ตทรู {2}M ต้องใช้ให้หมดภายใน {1} วัน"}
L.SCOREMARKET.TRUE_DESC_TIPS = "คุณได้รับแพ็คเกจเสริมเน็ตทรู {1} กรุณาเติมเน็ตโดยกด *799*5* ตามด้วยรหัส PIN 10 หลัก กด *{2}# แล้วโทรออก  หลังเปิดใช้งานแล้ว กรุณาใช้ให้หมดภายใน {3} วันค่ะ"

-- 流失玩家回归任务
L.PLAYER_BACK.TITLE           = 'ผู้เล่นที่กลับมาล็อกอินต่อเนื่อง 5 วัน มีรางวัลแจก'
L.PLAYER_BACK.N_DAY           = 'วันที่ {1}'
L.PLAYER_BACK.GOTO            = 'ไปทำภารกิจ'
L.PLAYER_BACK.GET_REWARD      = 'รับรางวัล'
L.PLAYER_BACK.GOT_REWARD      = "รับรางวัลแล้ว"  ---'已领奖'
L.PLAYER_BACK.GOT_REWARD_NEXT = "ท่านได้รับรางวัลของวันนี้ไปแล้ว พรุ่งนี้มาใหม่นะคะ"--'您已经领取过今天的奖励,明天再来吧!'
L.PLAYER_BACK.GOT_A_REWARD    = "ท่านได้รับรางวัลไปแล้ว ขอให้สนุกในการเล่นเกมส์นะคะ"--'您领取了奖励,祝您游戏愉快!'
L.PLAYER_BACK.COME_LATER_N    = "หลัง {1} วันค่อยมาทำภารกิจรับรางวัลใหม่นะคะ"--'请{1}天后再来做任务领取奖励吧!'
L.PLAYER_BACK.CANNOT_DO       = "เสียใจด้วยนะคะ ภารกิจหมดเขตแล้ว" --'很遗憾，任务已过期!'
L.PLAYER_BACK.GET_REWARD_SUCC = "รับรางวัลสำเร็จ" --"领取奖励成功"

L.PLAYER_BACK.TASK_NAME_1     = 'เล่นไพ่ชนะครั้งแรก'
L.PLAYER_BACK.TASK_NAME_2     = 'มุ้งมิ๊งสองต่อสอง'
L.PLAYER_BACK.TASK_NAME_3     = 'ส่งไอเทมหรรษา'
L.PLAYER_BACK.TASK_NAME_4     = 'ประลองฝีมือ'
L.PLAYER_BACK.TASK_NAME_5     = 'เวทีพิฆาต'
L.PLAYER_BACK.TASK_NAME_6     = 'เพอร์เฟ็คคิง'

L.PLAYER_BACK.TASK_DESC_1     = 'เล่นในห้องธรรมดา/มืออาชีพชนะ 1 รอบ/วัน'
L.PLAYER_BACK.TASK_DESC_2     = 'เพิ่มเพื่อนต่างเพศอย่างต่ำ 1 ท่าน/วัน'
L.PLAYER_BACK.TASK_DESC_3     = 'ส่งไอเทมให้เพื่อนในห้อง 1 ครั้ง'
L.PLAYER_BACK.TASK_DESC_4     = 'เล่นกับเพื่อนในห้องเดียวกันครบ 10 รอบ/วัน'
L.PLAYER_BACK.TASK_DESC_5     = 'เล่นในห้องธรรมดา/มืออาชีพชนะ 10 รอบ/วัน'
L.PLAYER_BACK.TASK_DESC_6     = 'ทำทุกภารกิจ 5 วันก่อนหน้าอย่างต่อเนื่องสำเร็จ'


L.FIRST_PAY.BTN_TEXT = "แย่งก่อนหมด"--"立即抢购"
L.FIRST_PAY.PRICE_TIPS = "กดสั่งซื้อแพคเกจ หัก {1} บาทจากค่าโทร (ไม่รวมภาษี 7%) สิทธิ์ 1 ครั้ง/ไอดี"--点击抢购将从话费中扣除 {1}THB（不含7%增值税）,每人仅限一次
L.E2P_TIPS.SMS_SUCC = "ส่งข้อความสำเร็จ ระบบกำลังเติมเงิน กรุณารอสักครู่ค่ะ"--"短信已发送成功,正在充值 请稍等."
L.E2P_TIPS.NOT_SUPPORT = "โทรศัพท์ของท่านไม่สามารถเติมเงินผ่านช่องทาง Easy 2 Pay ได้ กรุณาเลือกช่องทางอื่นๆค่ะ"--"你的手机暂时无法完成easy2pay充值,请选择其他渠道充值"
L.E2P_TIPS.NOT_OPERATORCODE = "Easy 2 Pay ไม่สนับสนุนเครือข่ายซิมการ์ดของท่าน กรุณาเลือกช่องทางอื่นๆค่ะ"--"easy2pay暂时不支持你的手机运营商,请选择其他渠道充值"
L.E2P_TIPS.SMS_SENT_FAIL = "ส่งข้อความล้มเหลว กรุณาเช็คยอดเงินคงเหลือก่อนค่ะ"--"短信发送失败,请检查你的手机余额是否足额扣取"
L.E2P_TIPS.SMS_TEXT_EMPTY = "ไม่มีเนื้อหาในข้อความ กรุณาเลือกช่องทางอื่นและติดต่อทีมงานโบย่าค่ะ"--"短信内容为空,请选择其他渠道充值并联系官方"
L.E2P_TIPS.SMS_ADDRESS_EMPTY = "ไม่มีชื่อผู ้รับ กรุณาเลือกช่องทางอื่นๆและติดต่อทีมงานโบย่าค่ะ"--"没有发送目标,请选择其他渠道充值并联系官方"
L.E2P_TIPS.SMS_NOSIM = "ไม่มีซิมการ์ด ไม่สามารถเติมเงินผ่านช่องทาง Easy 2 Pay ได้ กรุณาเลือกช่องทางอื่นๆค่ะ"--"没有SIM卡,无法使用easy2pay渠道充值,请选择其他渠道充值"
L.E2P_TIPS.SMS_NO_PRICEPOINT = "ไม่มีชื่อผู้รับ กรุณาเลือกช่องทางอื่นๆและติดต่อทีมงานโบย่าค่ะ"--"没有发送目标,请选择其他渠道充值并联系官方"
L.E2P_TIPS.PURCHASE_TIPS = "คุณกำลังจะเติมเงิน {1} \nค่าบริการ {2} บาท(ไม่รวมภาษี7%) \nจะถูกหักออกจากเงินในมือถือของคุณ"--"您将要购买{1}，共花费{2}铢（不含7%增值税），将会从您的话费里扣除"
L.E2P_TIPS.BANK_PURCHASE_TIPS = "คุณกำลังจะเติมเงิน {1} \nค่าบริการ {2} บาท(ไม่รวมภาษี7%) \nจะถูกหักออกจากเงินในบัตรธนาคารของคุณ"--"您将要购买{1}，共花费{2}铢（不含7%增值税），将会从您的银行卡里扣除"

L.GUIDE_PAY.TITLE_DISCOUNT_COUNTDOWN = "ชิปราคาพิเศษ รีบมาแย่งกัน!"--"限时特价游戏币，赶快抢购"
L.GUIDE_PAY.TITLE_SUPPLY = "ชิปของท่านน้อยกว่าชิปนำเข้าต่ำสุด {1} ชิป" --"您的游戏币不足最小买入{1}"
L.GUIDE_PAY.TITLE__MATCH_SUPPLY = "การลงชื่อต้องใช้ชิป {1}" --"报名需要{1}游戏币"
L.GUIDE_PAY.TITLE_GCOINS_SUPPLY = "ชิปทองคำของท่านน้อยกว่ายอดนำเข้าต่ำสุด {1} ชิปทองคำ" --"您的黄金币不足最小买入{1}"
L.GUIDE_PAY.TITLE_GCOINS_MATCH_SUPPLY = "การลงชื่อต้องใช้ {1} ชิปทองคำ" --"报名需要{1}黄金币"
L.GUIDE_PAY.MORE_PAY_METHOD = "วิธีเติมเงินอื่นๆ >>"--"更多支付方式>>"
L.GUIDE_PAY.ENTER_ROOM_WATCH = "เข้าห้องยืนดู >>" --"进入房间旁观>>"
L.GUIDE_PAY.TIPS_PAY_METHOD = "คำเตือน：สนับสนุนเฉพาะช่องทาง {1} เท่านั้นค่ะ" --"提示：以上订单只支持E2P支付方式"
L.GUIDE_PAY.PRICE_ORIGAL_TIPS = "(ราคาเดิม:{1}THB)"

L.HALLOWEEN.TIPS1 = "ตอนนี้ไปเล่นไพ่ที่ห้องเติมพัน {1} หรือขึ้นไปครบ {2} รอบ  จะได้รับรางวัลตั๋วห้องชิงชิปเงินสดและชิปเงินสด！"
L.HALLOWEEN.TIPS2 = "เล่นไพ่อีก {1} รอบในห้องนี้ จะได้รับรางวัลตั๋ว ชิป หรือชิปเงินสดนะคะ！"
L.HALLOWEEN.TIPS3 = "ท่านเล่นไพ่ในห้องนี้ครบ {1} รอบแล้ว สามารถไปรับรางวัลที่ศูนย์กิจกรรมได้ค่ะ！"
L.HALLOWEEN.GOPLAY = "เล่นทันที"
L.HALLOWEEN.GOMATCH = "เข้าห้องแข่งทันท"
L.HALLOWEEN.NOT_ENOUGH_PROP = "คุณยังไม่มีไอเทมพิเศษ เล่นไพ่ต่อกัน รับไอเทมพิเศษเลยค่ะ！"
L.HALLOWEEN.NAUGHTY_UTTERS = {
    "แฮปปี้ฮาโลวีนจ้า",
    "ไม่ให้กุหลาบ ก็จะตามหลอก อิอิ",
    "ทิ้งโคมฟักทองกัน"
}

--疯狂宝箱
L.CRAZED.TITLE = "หีบสมบัติอลเวง"--疯狂的宝箱
L.CRAZED.QUESTION = "เปิดหีบสมบัติยังไง?" --怎么开启宝箱?
L.CRAZED.TIME = "เวลานับถอยหลัง:"--倒计时
L.CRAZED.TOMORROW = "พรุ่งนี้มาใหม่นะคะ"--明天再来
L.CRAZED.COST_50K = "ใช้ 50K ชิป"--使用5W游戏币
L.CRAZED.COST_500K = "ใช้ 500K ชิป"--使用50W游戏币
L.CRAZED.ANSWER = {
    "1.ต้องออนไลน์ 15 นาที ถึงจะเปิดหีบทองแดงได้ 1 ครั้ง (จำกัด 1 ครั้ง/วัน)",--铜宝箱需要在线15分钟可开启1次（每日限1次）
    "2.ต้องจ่าย 50K ชิป ถึงจะเปิดหีบเงินได้ 1 ครั้ง (ทุกวันไม่จำกัดจำนวน)",--银宝箱需要消耗5W游戏币可开启1次（每日不限次数）
    "3.ต้องจ่าย 500K ชิป ถึงจะเปิดหีบทองได้ 1 ครั้ง (ทุกวันไม่จำกัดจำนวน)"--金宝箱需要消耗50W游戏币可开启1次（每日不限次数）
}
L.CRAZED.NOT_OPEN_BOX_TIPS = {
    "เวลาออนไลน์ของท่านไม่ถึง 15 นาที กรุณาลองใหม่ภายหลังค่ะ!",--你的在线时长还不足15分钟，请稍后重试！
    "ชิปของท่านมีไม่พอ 50K  เปิดหีบเงินไม่ได้ค่ะ!",--你的游戏币不足5W，无法开启银宝箱！
    "ชิปของท่านมีไม่พอ 500K  เปิดหีบทองไม่ได้ค่ะ!",--你的游戏币不足50W，无法开启金宝箱！
}
L.CRAZED.GET_COPPER_REWARD = "ยินดีด้วยค่ะ ท่านเปิดหีบทองแดง ได้รับ {1}!"--恭喜你打开铜宝箱，获得XX！
L.CRAZED.GET_SILVER_REWARD = "ยินดีด้วยค่ะ ท่านเปิดหีบเงิน ได้รับ {1}!"--恭喜你打开银宝箱，获得XX！
L.CRAZED.GET_GLOD_REWARD = "ยินดีด้วยค่ะ ท่านเปิดหีบทอง ได้รับ {1}!"--恭喜你打开金宝箱，获得XX！

--铜宝箱奖励内容:\n{1}
L.CRAZED.COPPER_TIPS = "รางวัลหีบทองแดง:\n{1}"
--银宝箱奖励内容:\n{1}
L.CRAZED.SILVER_TIPS = "รางวัลหีบเงิน:\n{1}"
--金宝箱奖励内容:\n{1}
L.CRAZED.GLOD_TIPS = "รางวัลหีบทอง:\n{1}"

L.VIP.ROOM_SEND_EXPRESSIONS_FAILED = "ชิปนอกห้องของคุณน้อยกว่า 5000 ชิป ไม่สามารถใช้อีโม VIP ได้ค่ะ"--"您的场外筹码不足5000，暂时无法使用VIP表情"
L.VIP.ROOM_SEND_EXPRESSIONS_TIPS = "คุณยังไม่ได้ซื้อ VIP จะเสีย {1} ชิปเพื่อใช้อีโม VIP หรือไม่？"--"你当前还不是VIP用户，需要消耗100筹码？"
L.VIP.PDENG_SEND_EXP_TIPS = "คุณยังไม่ได้เปิดสิทธิ์ VIP จะเปิดสิทธิ์หรือไม่？" -- 您还不是VIP，是否立即成为VIP？
L.VIP.OPEN_VIP = "ซื้อ VIP ทันที"--开通VIP免费使用

L.VIP.REWARD_TITLE_LIST = {
    "เปิดทันที",--"立即开通"
    "บัตรเตะ",--"踢人卡"
    "อีโม VIP",--"VIP表情"
    "ชิปพิเศษ",--"破产优惠"
    "ค่า EXP",--"经验"
    "ชิปล็อกอิน",--"登录返还"
    "ชิป",--"筹码"
}

L.VIP.NOT_VIP = "ยังไม่ได้เปิด"--"未开通"
L.VIP.AVAILABLE_DAYS = "เหลืออีก {1} วัน"--"剩余{1}天"
L.VIP.PAY_AGAIN = "ต่อ VIP\n"--"续费"
L.VIP.BROKE_REWARD = "ส่ง {1}% ชิปเพิ่ม\nทุกวัน {2} ครั้ง"--"多送{1}% 每天{2}次"
L.VIP.ALREADY_IS_TIPS = "คุณเป็น {1} แล้ว หากซื้อ VIP ซ้ำ จะได้รับสิทธิ์ VIP เฉพาะการซื้อใหม่เท่านั้น ไม่สามารถรับสิทธิ์พิเศษซ้ำได้"--"您已经是{1}，重复购买将只享受新购买的VIP，不可叠加享受优惠。"
L.VIP.LOGINREWARD =  "{1}*31วัน"--"{1}*31天"

L.VIP.KICK_CARD = "บัตรเตะ"
L.VIP.KICK_SUCC = "เตะคนสำเร็จ รอบไพ่นี้จบ ผู้เล่นท่านนี้จะโดนไล่ออกจากห้องนี้ค่ะ "
L.VIP.KICK_FAILED = "เตะคนล้มเหลว รอสักพัก แล้วลองใหม่อีกทีนะคะ"
L.VIP.KICKED_TIP = "ขออภัยค่ะ คุณถูก {1} เตะออกจากห้อง รอบไพ่นี้จบ จำเป็นต้องออกไปจากห้องนี้ค่ะ"
L.VIP.KICKER_TOO_MUCH = "คุณใช้บัตรเตะครบจำนวนครั้งของวันแล้ว ใจเย็นๆก่อน เล่นไพ่อย่างเป็นมิตรนะคะ"
L.VIP.KICKED_ENTER_AGAIN = "คุณถูกเชิญออกจากห้องนี้ จะไม่สามารถเข้าห้องนี้ได้ภายใน 20 นาที คุณสามารถเลือกห้องอื่นๆหรือกดปุ่มเริ่มทันทีได้ค่ะ"
L.VIP.COUPON = "คูปอง VIP"

L.PUSHREWARD.TITLE = "สมนาคุณ มอบตั๋วฟรี ！"--"感恩有你，门票免费派送！"
L.PUSHREWARD.GET_REWARD = "ท่านได้รับ {1}"--"你获得了 {1}"
L.PUSHREWARD.EXPIRE_TIME = "วันหมดอายุ:{1}"--"过期时间:{1}"
L.PUSHREWARD.BTN_CHECK_TICKET = "ตรวจเช็คตั๋ว"--"查看门票"
L.PUSHREWARD.BTN_GO_MATCH = "ลงชื่อทันที"--"立即报名"

L.LOTTERY.TITLE = "ศูนย์แทงหรรษา"
L.LOTTERY.RULE = "กติกาการถูกรางวัล:\nรางวัลที่ 1：เลขที่ซื้อตรงกับเลขรางวัลที่ 1 ที่ออกทุกตัว   รางวัล：{1}\nรางวัลที่ 2：เลขที่ซื้อตรงกับเลขรางวัลที่ 2 ที่ออก   รางวัล：{2}\nรางวัลที่ 3：เลขที่ซื้อตรงกับเลขรางวัลที่ 3 ที่ออก   รางวัล：{3}\nรางวัลที่ 4：เลขที่ซื้อตรงกับเลขรางวัลที่ 4 ที่ออก   รางวัล：{4}\nรางวัลที่ 5：เลขที่ซื้อตรงกับเลขรางวัลที่ 5 ที่ออก   รางวัล：{5}\nรางวัลข้างเคียง：เลขที่ซื้อข้างเคียงกับรางวัลที่ 1 ที่ออก    รางวัล：{6}\nเลขหน้า 3 ตัว：เลขหน้า 3 ตัวที่ซื้อตรงกับเลขหน้า 3 ตัวที่ออก   รางวัล：{7}\nเลขท้าย 3 ตัว：เลขท้าย 3 ตัวที่ซื้อตรงกับเลขท้าย 3 ตัวที่ออก  รางวัล：{8}\nเลขท้าย 2 ตัว：เลขท้าย 2 ตัวที่ซื้อตรงกับเลขท้าย 2 ตัวที่ออก รางวัล：{9}"
L.LOTTERY.TIMETIPS = "หวยงวดนี้ออกเวลา"
L.LOTTERY.RESULT_CHECK = "เช็คผลหวยงวดที่แล้ว"
L.LOTTERY.TAB_BUY = "ล็อบบี้หวย"
L.LOTTERY.TAB_RULE = "กติกา"
L.LOTTERY.TAB_RECORD = "บันทึกการซื้อ"
L.LOTTERY.BUY_TIPS1 = "เลือกเลข"
L.LOTTERY.BUY_TIPS2 = "限购一张"
L.LOTTERY.CASH_BUY = "{1} ชิปเงินสด"
L.LOTTERY.COIN_BUY = "{1} ชิป"
L.LOTTERY.CASH_BUY_TIPS = "รับรางวัลได้ที่กองชิปเงินสดเท่านั้น"
L.LOTTERY.COIN_BUY_TIPS = "รับรางวัลได้ที่กองชิปเท่านั้น"
L.LOTTERY.TICKET_BUY_NUMBERS = "ซื้อ {1} ใบแล้ว"
L.LOTTERY.PRE_COIN_TOTAL = "งวดนี้จะขายหวยชิป {1} ฉบับ"
L.LOTTERY.COIN_TOTAL = "กองชิป {1} ชิป"
L.LOTTERY.PRE_CASH_TOTAL = "งวดนี้จะขายหวยชิปเงินสด {1} ฉบับ"
L.LOTTERY.CASH_TOTAL = "กองชิปเงินสด {1} ชิปเงินสด"
L.LOTTERY.RECORD_TITLE1 = "งวด"
L.LOTTERY.RECORD_TITLE2 = "เลขที่ซื้อ"
L.LOTTERY.RECORD_TITLE3 = "จำนวนที่ซื้อ"
L.LOTTERY.RECORD_TITLE4 = "ผลหวย"
L.LOTTERY.RESULT_WIN_LEVEL = "รางวัลที่ {1}"
L.LOTTERY.RESULT_WIN_NONE = "ไม่ถูกรางวัล"
L.LOTTERY.RESULT_WIN_GOT = "รับรางวัลแล้ว"
L.LOTTERY.RESULT_NOT_OPEN = "ยังไม่ออก"
L.LOTTERY.NUMBER_SOLD = "ขออภัยค่ะ เลขนี้ถูกขายออกแล้ว กรุณาเลือกเลขใหม่ค่ะ"
L.LOTTERY.NUMBER_TYPE1_SOLD_OUT = "หวยชิปขายหมดแล้ว กรุณาซื้อหวยชิปเงินสดนะคะ"
L.LOTTERY.NUMBER_TYPE2_SOLD_OUT = "หวยชิปเงินสดขายหมดแล้ว กรุณาซื้อหวยชิปนะคะ"
L.LOTTERY.NUMBER_SOLD_OUT = "เลขงวดนี้ขายหมดแล้ว อย่าลืมติดตามงวดหน้านะคะ"
L.LOTTERY.REWARD_TIPS = "ยินดีด้วยค่ะ ท่านได้อันดับที่ {1} "
L.LOTTERY.COINS_OUT_TIPS = "จำนวนชิปของท่านมีไม่ถึง {1} ชิป กรุณาไปเพิ่มชิปก่อนค่ะ!"
L.LOTTERY.CASH_OUT_TIPS = "จำนวนชิปเงินสดของท่านมีไม่ถึง {1} ชิปเงินสด ไปห้องแข่งชิงชิปเงินสดก่อนแล้วค่อยมาใหม่ค่ะ! "
L.LOTTERY.BUY_SUCC_TIPS = "ซื้อสำเร็จ！"
L.LOTTERY.BUY_STOP_TIPS = "หวยงวดนี้หมดเวลาซื้อแล้ว"
L.LOTTERY.BUY_CONFIRM_TIPS = "ท่านยืนยันจะใช้ {1} ชื้อหวย 1 ใบ ไหมคะ"


L.HIGHROOMREWARD.TITLE = "เล่นไพ่รับตั๋วฟรี"
L.HIGHROOMREWARD.LIST_TITLE1 = "ห้องเดิมพัน"
L.HIGHROOMREWARD.LIST_TITLE2 = "รางวัล"
L.HIGHROOMREWARD.LIST_TITLE3 = "จำนวนรอบเล่นไพ่"
L.HIGHROOMREWARD.LIST_TITLE4 = "สถานะ"
L.HIGHROOMREWARD.CHECK_TICKET = "เช็คดูตั๋ว"


L.PUSHMSG.PUSH_POPUP_TITLE = "เชิญเพื่อนออฟไลน์"
L.PUSHMSG.SEND_CHIP_MSG = "คุณส่ง {1} ชิปให้ {2} สำเร็จ จะแจ้งให้เขาทราบและมารับชิปตอนนี้หรือไม่?"
L.PUSHMSG.MSG_TO = "แจ้งให้ทราบ"
L.PUSHMSG.POPUP_TITLE = "ส่งข้อความ"
L.PUSHMSG.PUSH_ROOM_BTN = "เชิญเพื่อน"
L.PUSHMSG.ROOM_PUSH = "{1} มาเล่นไพ่ด้วยกัน！——จาก {2}"
L.PUSHMSG.SENDCHIP_PUSH = "{1} ได้ส่งชิป 10K ให้คุณ รีบมารับสิ！"
L.PUSHMSG.MATCH_WIN = "ฉันแข่งได้ที่ 1 ในห้องแข่งเกมส์เก้าเกไทย ได้รับรางวัล {1}  มาเล่นด้วยกันสิ  แจกรางวัลจริงด้วย！"
L.PUSHMSG.PUSH_MATCH = "บอกเพื่อน"

L.PLAYERBACK.TITLE = "โบนัสผู้ที่กลับมาเล่นเกมส์อีก"
L.PLAYERBACK.TASK_TIPS = {
    "รางวัลกลับเล่นเกมส์",
    "ห้องธรรมดาเล่น 1 รอบ",
    "ห้องแข่งเล่น 1 รอบ",
    "สะกิดเพื่อน"
}



L.PLAYERBACK.OLD_CONTENT = "สวัสดีปีใหม่ค่ะ ขอขอบพระคุณเพื่อนๆที่คอยให้การสนับสนุนนะคะ ระบบเตรียมรางวัล 50K ชิปไว้ให้ รับตอนนี้เลยสิ!"
L.PLAYERBACK.NORMAL_PLAY = "เล่นไพ่ที่ห้องธรรมดา 1 รอบ รับฟรีตั๋วห้องชิงชิปเงินสด 10 บาท 1 ใบ!"
L.PLAYERBACK.MATCH_PLAY = "ใช้ตั๋วลงชื่อเข้าห้องแข่งจะได้รับ 5 ชิปเงินสดฟรีทันที ซึ่งมีมูลค่าถึง 5 บาท!"
L.PLAYERBACK.RECALL = "รหัสสะกิดของท่านคือ :{1}\n บอกรหัสสะกิดของท่านให้เพื่อนๆที่ไม่ได้เล่นเกมส์นาน เมื่อเพื่อนกลับเข้าเกมส์และกรอกรหัสสะกิดของท่านที่หน้าล็อกอิน ท่านและเพื่อนๆจะได้รับชิปเงินสดคนละ 5 บาท"
L.PLAYERBACK.GET_REWARD = "รับทันที"
L.PLAYERBACK.GOT_REWARD = "รับแล้ว"
L.PLAYERBACK.PLAY_NOW = "เล่นไพ่ทันที"
L.PLAYERBACK.GET_TICKET = "รับตั๋ว"
L.PLAYERBACK.CHECK_TICKET = "เช็คตั๋ว"
L.PLAYERBACK.INMATCH_NOW = "เข้าแข่งทันที"
L.PLAYERBACK.COIN_SUGGEST = "ความรู้เกี่ยวกับชิปเงินสด"
L.PLAYERBACK.CHECK_FIRENDS = "เช็คเพื่อนที่สะกิดได้"
L.PLAYERBACK.INPUT_HINT_MSG = "กรอกรหัสสะกิดของเพื่อน"
L.PLAYERBACK.GET_COIN = "รับ 5 ชิปเงินสด"
L.PLAYERBACK.RECALL_CODE = "รหัสสะกิดของท่านคือ :{1}"
L.PLAYERBACK.RECALL_CODE_DESC = "บอกรหัสสะกิดของท่านให้เพื่อนๆที่ไม่ได้เล่น เกมส์นาน เมื่อเพื่อนกลับเข้าเกมส์และกรอกรหัสสะกิดของ ท่านที่หน้าล็อกอิน ท่านและเพื่อนๆจะได้รับชิปเงินสดคนละ 5 บาท "
L.PLAYERBACK.FRIENDLIST_TITLE = "เพื่อนที่สะกิดได้"
L.PLAYERBACK.GET_REWARD_SUCC = "รับรางวัลสำเร็จ"
L.PLAYERBACK.GET_REWARD_FAIL = "รับรางวัลล้มเหลว"
L.PLAYERBACK.NOT_INPUT_FUID_ERROR = "กรุณากรอกรหัสสะกิดของเพื่อนท่านก่อน"

L.PLAYERBACK.GOT_REWARD_ERROR = "รับรางวัลแล้ว "--"已领取过奖励了"
L.PLAYERBACK.TASK_NOT_START = "กรุณาทำภารกิจด้านบนก่อนนะคะ"--"先完成上一个任务吧"

L.BILLDETAIL.NO_RECORDLOG = "ไม่มีรายละเอียด"
L.BILLDETAIL.TITLE_TIME = "เวลา"
L.BILLDETAIL.TITLE_WAY = "วิธีรับ"
L.BILLDETAIL.TITLE_CHANGE = "การเปลี่ยนแปลง"
L.BILLDETAIL.TITLE_LEFT = "เหลือ"
L.BILLDETAIL.TITLE_STR = "รายละเอียดการทำรายการล่าสุด 7วัน"
L.BILLDETAIL.TAB_TYPES = {
    "ชิปเงินสด",
    "ชิปทองคำ",
    "คูปองแข่งขัน"
}

L.MixCurrent.MIX_TITLE = "เครื่องหลอม"
L.MixCurrent.MIX_DESC = "ทุกวันสามารถหลอมได้ {1} ครั้ง ท่านยังเหลือโอกาส {2} ครั้ง"
L.MixCurrent.MIX_BTNLBL = "ยืนยัน"
L.MixCurrent.MIX_T1 = "สิ่งที่ต้องการ"
L.MixCurrent.MIX_T2 = "จำนวนที่มีอยู่"
L.MixCurrent.MIX_T3 = "จำนวนที่ต้องการ"
L.MixCurrent.MIX_T4 = "หลอมเป็น {1}"
L.MixCurrent.MIX_NOT_ENOUGH_CON = "เงื่อนไขไม่พอ ไม่สามารถหลอมได้ค่ะ"
L.MixCurrent.MIX_NOT_ENOUGH_NUM = "โอกาสหลอมวันนี้ของท่านใช้หมดแล้ว"
L.MixCurrent.MIX_DESC_MSG = "ท่านยืนยันที่จะใช้ {1} หลอมเป็น {2} หรือไม่?"

L.TICKET.label = "ตั๋วแข่งขัน"
L.TICKET.ALERT_INROOM_MSG = "ไม่สามารถใช้ตั๋วในห้องได้ค่ะ！"
L.TICKET.APPLY_LABLE = " ลงชื่อทันที"
L.TICKET.OVERDUE_LABLE = "หมดอายุ"
L.TICKET.FORMAT_DATE = "หมดอายุ {2} {1}{3}"
L.TICKET.REGED_SUCC_ALERT = "ใช้{1}ลงชื่อ{2}สำเร็จ!"
L.TICKET.REGED_FAIL_ALERT = "ท่านเคยลงชื่อ{1}แล้ว "
L.TICKET.ERROR_OVERDATE = "ตั๋วหมดอายุค่ะ!"
L.TICKET.TICKET_NEXTOVERDATE = "ตั๋วบางใบของท่านใกล้หมดอายุแล้ว"
L.TICKET.MONTHS = {
    "ม.ค.",
    "ก.พ.",
    "มี.ค.",
    "เม.ย.",
    "พ.ค.",
    "มิ.ย.",
    "ก.ค.",
    "ส.ค.",
    "ก.ย.",
    "ต.ค.",
    "พ.ย.",
    "ธ.ค.",
}

L.TICKET.TITLE_DESC1 = "คำเตือนสำหรับตั๋ว"
L.TICKET.TITLE_DESC = "คำเตือนสำหรับตั๋วที่ใกล้จะหมดอายุ"
L.TICKET.TIP_LBL1 = "คำเตือน：ตั๋วบางใบของท่านใกล้หมดอายุแล้ว กรุณารีบใช้นะคะ!"
L.TICKET.TIP_TITLE1 = "ตั๋วห้องชิงชิปเงินสด"
L.TICKET.TIP_TITLE2 = "เวลาหมดอายุ"
L.TICKET.TIP_TITLE3 = "จำนวนที่เหลือ"
L.TICKET.BUTTON_TEXT = "ใช้ตอนนี้"

L.HALL.GOLD_DESC = "บัตรทอง: ใช้ลงชื่อห้องแข่งรายสัปดาห์และรายเดือน ฯลฯ รับฟรีหากชนะติดอันดับในห้องแข่ง ไม่จำกัดอายุการใช้"
L.HALL.COUPON_DESC = "คูปองแข่งขัน: ใช้ลงชื่อเพื่อเข้าห้องแข่ง ซื้อได้ที่ห้างหรือรับฟรีโดยเล่นที่ห้องธรรมดา ไม่จำกัดอายุการใช้ "
L.HALL.SCORE_DESC = "ชิปเงินสด: ใช้แลกรางวัลต่างๆที่ห้าง รับฟรีโดยเล่นที่ห้องธรรมดา/ชนะติดอันดับในห้องแข่ง ไม่จำกัดอายุการใช้"
L.HALL.CHIP_DESC = "บัตรทองสามารถนำมาลงชื่อเข้าห้องชิงรางวัลจริงรายสัปดาห์และรายเดือนที่จะเปิดในเร็วๆนี้ได้"
L.HALL.GOLDCOIN_DESC = "คำเตือน：คูปองสามารถแลกเป็นชิปทองคำหรือลงชื่อได้"

L.MATCHDETAIL.CRANK_LBL_STR = "อันดับตอนนี้: "
L.MATCHDETAIL.CCHIP_LBL_STR = "เดิมพันปัจจุบัน: "
L.MATCHDETAIL.NCHIP_LBL_STR = "เดิมพันรอบถัดไป: "
L.MATCHDETAIL.MAXCHIP_LBL_STR = "จำนวนชิปมากสุด: "
L.MATCHDETAIL.ACHIP_LBL_STR = "จำนวนชิปเฉลี่ย: "
L.MATCHDETAIL.ONLINE_LBL_STR = "จำนวนผู้เข้าแข่ง: "
L.MATCHDETAIL.MATHC_DETAIL = "สกอร์การแข่ง"
L.MATCHDETAIL.MATHC_REWARD = "รางวัล "

L.COINROOM.SCORE = "ชิปทองคำ"
L.COINROOM.BUY_IN_TITLE = "ชิปทองคำนำเข้า"
L.COINROOM.BUY_IN_DESC = "หลังเริ่มเกมส์ระบบจะหัก{1}ชิปทองคำเป็นค่าบริการค่ะ"--"游戏开始扣除{1}现金为服务费"
L.COINROOM.SELF_CHIP_NO_ENOUGH_SEND_DELEAR = "ชิปทองคำของท่านมีไม่พอ ให้ทิปสาวแจกไพ่ไม่ได้ค่ะ"--"你的现金币不足，无法赠送荷官小费"
L.COINROOM.NOT_ENOUGH_MONEY_TO_PLAY_NOW_MSG = "ชิปทองคำของท่านต่ำกว่ายอดนำเข้าต่ำสุด {1} ชิปทองคำ  สามารถแข่งชิงชิปทองคำที่ห้องแข่งขันได้ค่ะ"--"你的现金币不足，你可前往比赛场参赛获得！"


L.SONGKRAN_ACT.NUMBER_TEXT = "จำนวนพร:{1}"
L.SONGKRAN_ACT.CARD1_TEXT = "เล่นไพ่ที่ห้องเดิมพัน 2000 หรือขึ้นไป"
L.SONGKRAN_ACT.CARD2_TEXT = "เล่นไพ่ที่ห้องแข่ง(ยกเว้นห้องฟรี)"
L.SONGKRAN_ACT.CARD3_TEXT = "แชร์โพสต์ อัพรูปที่ครบ50ไลค์ให้ระบบ"
L.SONGKRAN_ACT.CARD1_TIPS = "เล่นไพ่ที่ห้องเดิมพัน 2000 หรือขึ้นไปครบ 20 รอบ รับฟรีโอกาสรับรางวัล 1 ครั้ง"
L.SONGKRAN_ACT.CARD2_TIPS = "เล่นไพ่ที่ห้องแข่ง 1 รอบ (ยกเว้นห้องแข่งฟรี) จะได้รับรางวัลทันที"
L.SONGKRAN_ACT.GOMATCH = "เข้าห้องแข่ง"
L.SONGKRAN_ACT.CARD2_FINISH_TIPS = "ท่านทำภารกิจสำเร็จ กรุณาไปรับรางวัลที่หน้ากิจกรรมค่ะ"
L.SONGKRAN_ACT.CARD3_UPLOAD = "อัพรูป"
L.SONGKRAN_ACT.CARD3_UPLOAD_HINT = "กรุณาแคปรูปก่อนค่ะ"
L.SONGKRAN_ACT.UPLOAD_PIC_IS_UPLOADING = "กำลังอัพรูปอยู่ กรุณารอสักครู่นะคะ"
L.SONGKRAN_ACT.CARD3_UPLOAD_SUCCESS = " อัพรูปสำเร็จ ระบบกำลังตรวจสอบ "
L.SONGKRAN_ACT.CARD3_PENDING = "กำลังตรวจ"
L.SONGKRAN_ACT.CARD3_REJECTED = "ไม่ผ่าน"
L.SONGKRAN_ACT.CARD3_REJECTED_REASON = "กรุณาอัพภาพใหม่ค่ะ (ภาพที่ท่านอัพไม่ใช่ภาพกิจกรรมนี้หรือจำนวนไลค์ไม่ครบ 50 ไลค์)"
L.SONGKRAN_ACT.CARD_REWARD = "รับรางวัล"
L.SONGKRAN_ACT.GOT_REWARD = "รับแล้ว"
L.SONGKRAN_ACT.CARD_SEND = "ส่ง"
L.SONGKRAN_ACT.CARD_SEND_TITLE = "ส่งให้เพื่อน"
L.SONGKRAN_ACT.CARD_SEND_BUTTON = "ส่ง 1 คำอวยพร"
L.SONGKRAN_ACT.CARD_SEND_NOT_ENOUGH = "{1} ของท่านมีไม่พอ"
L.SONGKRAN_ACT.CARD_SEND_SUCCESS = "{1} ส่งสำเร็จ"
L.SONGKRAN_ACT.CARD_SEND_FAILED = "ส่งล้มเหลว"
L.SONGKRAN_ACT.CARD_EXCHANGE = "แลก"
L.SONGKRAN_ACT.CARD_EXCHANGE_TEXT = 'ต้องใช้ "สุข" "มันส์" "รวย" 3 คำในการแลก จำกัดเพียง 1 ครั้งเท่านั้น'
L.SONGKRAN_ACT.CARD_EXCHANGE_TIPS = "ท่านยืนยันที่จะใช้ สุข มันส์ รวยอย่างละ 1 ตัว แลกแพคเกจรางวัลใหญ่วันสงกรานต์หรือไม่ค่ะ? "
L.SONGKRAN_ACT.PART1_TEXT = "ทำภารกิจ ลุ้นรางวัล"
L.SONGKRAN_ACT.PART2_TEXT = "สะสมพรแลกแพคเกจ"
L.SONGKRAN_ACT.PART3_TEXT = "บริษัทโบย่าสงวนสิทธิ์สุดท้ายของกิจกรรมนี้"
L.SONGKRAN_ACT.HELP_TEXTS = {
    "กติกา:\n  สะสมคำอวยพร:\n    วิธีที่ 1：ทำภารกิจวันสงกรานต์สำเร็จ รับฟรีโอกาสลุ้นรางวัลรับคำอวยพร 1 ครั้ง ",
    "      1.เล่นไพ่：เล่นไพ่ที่ห้องเดิมพัน 2000 หรือขึ้นไปครบ 20 รอบ รับฟรีโอกาสรับรางวัล 1 ครั้ง (นับจำนวนรอบไพ่เฉพาะวัน)",
    "      2.ร่วมแข่ง：เล่นไพ่ที่ห้องแข่ง 1 รอบ (ยกเว้นห้องชิงชิปเงินสด 2 และ 5 บาท) รับฟรีโอกาสรับรางวัล 1 ครั้ง",
    "      3.แชร์โพสต์：แชร์โพสต์ออกไป แล้วแคปรูปที่มีจำนวนไลค์ครบ 50 ไลค์อัพให้ระบบ หลังระบบตรวจสอบแล้ว จะได้คำอวยพร 100% （ระบบตรวจสอบภายใน 48 ชั่วโมง）",
    "    วิธีที่ 2：สามารถขอคำอวยพรจากเพื่อนหรือส่งคำอวยพรให้เพื่อนได้ (ระบบจะหักจำนวนคำอวยพรของฝ่ายที่ส่ง)",
    "แพคเกจรางวัลใหญ่:\n    สามารถใช้ สุข มันส์ รวยอย่างละ 1 ตัว แลกแพคเกจรางวัลใหญ่วันสงกรานต์ได้ (ทุกไอดีมีโอกาสแลกแพคเกจรางวัลใหญ่เพียง 1 ครั้งเท่านั้น)"
}

--荷官商城
L.DEALERSHOP.EXPIRY_DATE = "有效期{1}天"
L.DEALERSHOP.PRICE = "{1}游戏币"
L.DEALERSHOP.BUY_TIPS = "确定花费{1}使用此荷官么？"
L.DEALERSHOP.SETTING = "设为我的荷官"
L.DEALERSHOP.STATE_DESC = {
    "免费",
    "已购买({1}天)",
    "未购买"
}

L.ROOM_4K.TIPS = {
    "กรุณาเลือกทิ้งไพ่ 2 ใบค่ะ",--"请点击选中需要丢弃的两张牌",
    "กรุณาเลือกทิ้งไพ่อีกใบค่ะ",--"请点击选择需要丢弃的第二张牌",
    "กรุณากดปุ่ม【ทิ้งไพ่】เพื่อทิ้งไพ่ 2 ใบ",--"请点击丢牌按钮确认丢弃选中的两张牌",
    "รอผู้เล่นท่านอื่นทิ้งไพ่"--"等待其他玩家丢牌"
}

L.ROOM_4K.BTN_DROP = "ทิ้งไพ่"--"丢牌"
L.ROOM_4K.BTN_FOLD = "หมอบไพ่"--"弃牌"

L.POKER_ACT.TIME_TITLE = "นับเวลาถอยหลัง"
L.POKER_ACT.TASK_TITLE = "เล่นไพ่ที่ห้องเดิมพัน \n{1} ({2}) รอบ"
L.POKER_ACT.TASK_REWARD = "รางวัลคนกล้า {1} ชิป"
L.POKER_ACT.TASK_REWARD_GCOIN = "รางวัลคนกล้า {1} ชิปทองคำ"
L.POKER_ACT.TASK_REWARD_COIN = "รางวัลคนกล้า {1} ชิปเงินสด"
L.POKER_ACT.TASK_GET = "ทำภารกิจ"
L.POKER_ACT.TASK_PROGRESS = "กำลังทำภารกิจ"
L.POKER_ACT.TASK_GIVEUP = "ยกเลิกทำภารกิจ"
L.POKER_ACT.TASK_GIVEUP_TIPS = "คำเตือน：หากยกเลิก ระบบจะรีเซ็ตจำนวนรอบไพ่เป็น 0 นะคะ！"

L.DICE.HELP_TITLE = "กติกา"

L.DICE.CURR_USER_COUNT = "ผู้เล่นห้องนี้ ：{1} ท่าน"
L.DICE.USERINFO_CHIPS = "ชิป:{1}"
L.DICE.NO_OPER_TIPS = "คุณไม่ได้แทงชิปมากกว่า 10 ครั้ง ถูกเชิญออกจากห้องค่ะ"
L.DICE.MONEY_NOT_ENOUGH = "ชิปคุณมีไม่ถึง 100K ไม่สามารถเล่นไพ่ในห้องนี้ต่อได้ กรุณาเติมชิปก่อนหรือเล่นห้องอื่นนะคะ"
L.DICE.BET_FAIL = "ชิปของคุณมีไม่พอ แทงชิปล้มเหลว"
L.DICE.KICK_OFF = "คุณไม่ได้แทงชิปนานเกินไป หากรอบถัดไปไม่แทงชิป ระบบขอเชิญออกห้องค่ะ"
L.DICE.TO_HALL_CONFIRM = "รอบนี้ยังไม่ได้จบ หากชนะจะเสียชิป คุณยืนยันจะออกจากห้องนี้หรือไม่?"

L.DICE.ERROR_TIP_MONEY_NOT_ENOUGH = "ขออภัยค่ะ ชิปของคุณมีไม่พอ เข้าห้องล้มเหลวค่ะ"
L.DICE.ERROR_TIP_ROOM_FULL = "ขออภัยค่ะ ศึกชิงพิภพห้องนี้มีผู้เล่นเต็มแล้ว กรุณาลองเข้าห้องอื่นๆค่ะ"
L.DICE.AUTO_BUYIN = "ระบบช่วยคุณนำ {1} ชิปเข้าห้องนี้โดยอัตโนมัติค่ะ"
L.DICE.ROOM_ID = "ห้อง {1}"
L.DICE.BET_DOUBLE = "2 เท่า"
L.DICE.BET_LAST = "แทงเท่าเดิม"
L.DICE.NOT_ENOUGH_MONEY = "ชิปของคุณมีไม่ถึง {1} ชิป กรุณาเติมชิปก่อนหรือเล่นไพ่ที่ห้องระดับอื่นๆค่ะ"

L.RICHMAN.COUNTDOWN = "อีก (d/h/m) แจกรางวัล"
L.RICHMAN.TITLETABLE = {
    "อันดับ",
    "รางวัลแรงค์กิ้ง",
    "ชื่อ",
    "ยอดคะแนน",
    "คะแนน+ - \nเทียบกับเมื่อวาน"
}

L.RICHMAN.RANKTAG = "อันดับที่ "
L.RICHMAN.NEXT_PAGE = "ถัดไป"
L.RICHMAN.PRE_PAGE = "ก่อนหน้า"
L.RICHMAN.NOT_IN_RANK = "ไม่ได้ขึ้นแรงค์กิ้ง"
L.RICHMAN.RANK = "คุณติดอันดับที่"
L.RICHMAN.MY_SCORE = "ยอดคะแนนของคุณ"
L.RICHMAN.RULE_TITLE = "กติกาการสะสมคะแนน"

L.GROUP.ACTWORD = "คะแนนแอคทีฟ:{1}"
L.GROUP.OWNERREBATE = "เติมเงินรับฟรีชิปเพิ่ม:{1}"
L.GROUP.MEMBERNUM = "สมาชิกกลุ่ม:{1}/{2}"

L.GROUP.MSG = "ข่าวจากกลุ่ม"
L.GROUP.LOGOUT = "ออกกลุ่ม"
L.GROUP.JOINSET = "ตั้งค่าเข้ากลุ่ม"
L.GROUP.JOINLIST = "รายการขอเข้ากลุ่ม"
L.GROUP.CHANGEBTN = "โอนกลุ่ม"
L.GROUP.KICKEDOUTBTN = "เตะออกกลุ่ม"
L.GROUP.ADDFRIENDBTN = "เช็ครายละเอียด"--查看信息
L.GROUP.TRACEBTN = "ตามเข้าห้อง"

L.GROUP.OUTCONFIRM = "คุณยืนยันที่จะออกจากกลุ่มหรือไม่？"
L.GROUP.CHANGECONFIRM = "คุณยืนยันที่จะโอนกลุ่มให้ท่านอื่นหรือไม่？โอนแล้วคุณจะเสียสิทธิ์ในการเป็นเจ้าของกลุ่ม กรุณาพิจารณาอีกทีนะคะ"
L.GROUP.KICKEDOUTCONFIRM = "คุณยืนยันที่จะเตะผู้เล่นท่านนี้ออกจากกลุ่มหรือไม่？"
L.GROUP.CHANGEFAIL0 = "ทำไม่สำเร็จ"
L.GROUP.CHANGEFAIL1 = "คุณเป็นเจ้าของ ไม่สามารถถอนออกจากกลุ่มได้ กรุณาโอนกลุ่มให้ท่านอื่นก่อนนะคะ"

L.GROUP.INVITENEW = "เชิญสมาชิกใหม่"
L.GROUP.TOTALACT = "ยอดคะแนน"
L.GROUP.TODAYACT = "คะแนนวันนี้"
L.GROUP.ROOMOWNER_BET = "เติมพันต่ำสุด≥{1}ชิปทองคำ"
L.GROUP.CREATROOM = "สร้างห้อง"
L.GROUP.JOINROOM = "เข้าห้อง"

L.GROUP.JOINGROUP = "เข้ากลุ่ม"
L.GROUP.SEARCHGROUP = "ค้นหากลุ่ม"--搜索群组
L.GROUP.CREATGROUP = "สร้างกลุ่ม"
L.GROUP.BACKGROUP = "กลับกลุ่ม"--返回群组
L.GROUP.CREATGROUPTIPS = "คุณยืนยันที่จะใช้ {1} ชิปทองคำในการสร้างกลุ่มหรือไม่？"
L.GROUP.LEVELENOUGH = "เลเวลของคุณไม่ถึง {1} สร้างกลุ่มล้มเหลว" -- 5
L.GROUP.GCOINENOUGH = "ชิปทองคำของคุณน้อยกว่า{1} ชิปทองคำ สร้างกลุ่มล้มเหลว" -- 500
L.GROUP.ONLYONE = "ขออภัยค่ะ คุณเคยเข้ากลุ่มใดกลุ่มหนึ่งแล้ว ต้องถอนออกจากกลุ่มนั้นก่อนถึงสามารถเข้ากลุ่มอื่นๆได้ค่ะ "
L.GROUP.CREATGROUPFAIL = "สร้างกลุ่มล้มเหลว"
L.GROUP.INPUTINVITECODE = "กรุณากรอกรหัสยืนยันของกลุ่ม:"--请输入群验证码
L.GROUP.GROUPFULLTIPS = "กลุ่มนี้มีสมาชิกครบแล้ว เข้ากลุ่มล้มเหลว"
L.GROUP.CODEERRORTIPS = "รหัสยืนยันไม่ถูกต้อง เข้ากลุ่มล้มเหลว"
L.GROUP.REVIEWTIPS = "ส่งคำขอเข้ากลุ่มแล้ว รอเจ้าของกลุ่มอนุญาตก่อนนะคะ"
L.GROUP.REVIEWTIPS1 = "สมัครเข้ากลุ่มสำเร็จ!"
L.GROUP.GROUPGNTIPS = "Tips:การสร้างกลุ่มหรือเข้ากลุ่มจะทำให้เล่นไพ่กับเพื่อนสนิทได้ สัมผัสความเป็นส่วนตัว พร้อมทั้งสมนาคุณพิเศษในการซื้อชิป รางวัลต่างๆ ฯลฯ "
L.GROUP.MOREBTN = "ดูข้อมูลเพิ่ม"
L.GROUP.GROUPCATEGORY = {
    "กลุ่มรอบตัว",
    "กลุ่มฮอท"
}
L.GROUP.ROOMPSWERROR = "รหัสไม่ถูกต้อง"
L.GROUP.ENTERROOMFAIL = "เข้าห้องกลุ่มล้มเหลว"
L.GROUP.ENTERROOMFAIL1= "ผู้เล่นท่านนี้ยังไม่ได้ล็อกอินเข้าเกมส์  รีบเชิญเขามาเล่นไพ่กันตอนนี้สิคะ"
L.GROUP.ENTERROOMFAIL2= "ตอนนี้ผู้เล่นท่านนี้ไม่ได้เล่นไพ่ที่ห้อง！"
L.GROUP.ENTERROOMFAIL3= "ห้องนี้โดนลบแล้ว ระบบกำลังอัพเดทรายการห้องใหม่"

L.GROUP.CANDYINFO = "ยินดีด้วยค่ะ คุณชิงได้  {2} ชิปทองคำจากของขวัญของคุณ {1}"
L.GROUP.CANDYAWARD = "ยินดีด้วยค่ะ คุณชิงได้ {1} ชิป "
L.GROUP.CANDYNULL = "ของขวัญโดนสมาชิกอื่นๆแย่งไปหมดแล้ว"

L.GROUP.CHECKPOPTITLE = "รายการขอเข้ากลุ่ม"
L.GROUP.CHECKPOPNAME = "ชื่อ"
L.GROUP.CHECKPOPMONEY = "ชิปทองคำ"
L.GROUP.CHECKPOPACTION = "อนุญาต/ปฏิเสธ"
L.GROUP.CHECKPOPFULL = "กลุ่มนี้มีสมาชิกครบแล้ว ไม่สามารถเพิ่มสมาชิกใหม่ได้"
L.GROUP.CHECKPOPAGREE = "อนุญาต"
L.GROUP.CHECKPOPREFUSE = "ปฏิเสธ"

L.GROUP.ROOM_PLAY_CARD = "เล่นไพ่กัน"--一起玩牌
L.GROUP.ENTER_ROOM_PLAY = "เข้าห้อง"--进入房间
L.GROUP.ROOM_INVITE_TITLE = "เชิญ"--邀请
L.GROUP.ROOM_INVITE_TEXT = "กรุณากรอก ID เพื่อน "--请输入好友ID
L.GROUP.ROOM_INVITE_HOLDER = "กรอก ID เพื่อน"--输入好友ID
L.GROUP.ROOM_INVITE_SEARCH = "ค้นหา"--搜索
L.GROUP.ROOM_INVITE_SEARCH_ERR = "ID นี้ไม่ได้อยู่ในรายชื่อสมาชิกกลุ่มนี้ กรุณากรอกใหม่ค่ะ"--"您输入的ID不在当前列表，请确认后重新输入"
L.GROUP.INVITE_SUCC = "เชิญเพื่อนสำเร็จ"--邀请成功！！！
L.GROUP.INVITE_ERROR = "เพื่อนท่านนี้ไม่ได้อยู่ในกลุ่มนี้แล้วค่ะ"--被邀请人已不在当前群！！！
L.GROUP.INVITE_FAIL = "เชิญเพื่อนล้มเหลว"--邀请失败！！！
L.GROUP.INTRODUCTION_TITLE = "คำแนะนำของกลุ่ม:"--群简介
L.GROUP.INTRODUCTION_HINT = "กรอกคำแนะนำของกลุ่ม จำกัดอักษรไม่เกิน {1} ตัว"--点击输入群组简介，不得超过X字

L.GROUP.CROOMPOPTITLE = "สร้างห้องกลุ่ม"
L.GROUP.ROOM_TYPE = "ห้องชิป/ชิปทองคำ"--场次类型
L.GROUP.ROOM_PLAY_TYPE_TITLE = "วิธีเล่น"--房间玩法
L.GROUP.ROOM_PLAY_TYPE = "ห้องมืออาชีพ"--专业场
L.GROUP.ROOM_PLAY_TYPE_CHIP = "ชิป"--游戏币
L.GROUP.ROOM_PLAY_TYPE_GCOIN = "ชิปทองคำ"
L.GROUP.CROOMPOPNUMWORD = "จำนวนผู้เล่น"--桌子类型
L.GROUP.CROOMPOPNUM5 = "5 คน"
L.GROUP.CROOMPOPNUM9 = "9 คน"
L.GROUP.CROOMPOPBETWORD = "เลือกเดิมพันต่ำสุด"
L.GROUP.CROOMPOPPWD = "ตั้งค่ารหัส"
L.GROUP.CROOMPOPPWDNULL = "ไม่มีรหัส"
L.GROUP.CROOMPOPPWDNUM = "กรอกเลขรหัส 4 ตัว"
L.GROUP.CROOMPOPCREATE = "สร้างห้อง"
L.GROUP.CROOMPOPERROR1 = "ในเวลาเดียวกัน 1 ท่านสามารถสร้างห้องได้ 1 ห้องเท่านั้น"
L.GROUP.CROOMPOPERROR2 = "คะแนนแอคทีฟกลุ่มมีไม่ถึง 100 คะแนน ไม่สามารถสร้างห้องได้"
L.GROUP.CROOMPOPERROR3 = "สร้างห้องล้มเหลว"
L.GROUP.CROOMPOPERROR4 = "รหัสห้องเป็นเลข 4 ตัวค่ะ"
L.GROUP.CROOMPOPNOPASSTIPS = "คุณยืนยันที่จะสร้างห้องที่ไม่มีรหัสหรือไม่？"

L.GROUP.INTRPOPTITLE = "คำอธิบายของกลุ่ม"
L.GROUP.INTRPOP1 = "1.คะแนนแอคทีฟกลุ่มคือ?\n   a.คะแนนแอคทีฟกลุ่มเป็นหลักฐานเดียวที่สามารถตัดสินเลเวลกลุ่มได้ คะแนนแอคทีฟกลุ่มยิ่งสูง โบนัสสมาชิกยิ่งเยอะ\n   b.คะแนนแอคทีฟกลุ่ม รวมถึงคะแนนแอคทีฟส่วนตัวและยอดคะแนนแอคทีฟกลุ่ม โดยยอดคะแนนแอคทีฟกลุ่มคือยอดรวมของคะแนนแอคทีฟของสมาชิกทุกท่าน\n\n2.วิธีรับคะแนนแอคทีฟ?\n   a.ทุกวันล็อกอินเข้าเกมส์จะได้รับ 1 คะแนนแอคทีฟกลุ่ม\n   b.ทุกวันเล่นไพ่ที่ห้องเดิมพันตามที่กำหนดไว้ 1 รอบจะได้รับ 1 คะแนนแอคทีฟ จำกัดแค่ 50 รอบแรกเท่านั้น(สามารถตรวจเช็คห้องเดิมพันที่กำหนดไว้ได้ที่รายการห้องส่วนตัว)\n   c.ทุกวันทุกการเติมเงิน 1 ดอลล่าร์(ซื้อชิปทองคำ)จะได้รับ 1 คะแนนแอคทีฟ และกลุ่มนั้นๆจะได้รับโบนัสชิปทองคำตามจำนวนที่ระบบกำหนดไว้ตามสัดส่วน(เนื่องจากอัตราการแลกเปลี่ยนคะแนนแอคทีฟจะมีการเปลี่ยนแปลงอยู่เสมอ ดังนั้นค่าคะแนนแอคทีฟที่ได้เพิ่มจะมีการปรับขึ้นลงเล็กน้อย)\n\n3.รหัสเชิญของกลุ่ม\n   a.สมาชิกทุกท่านจะมีรหัสเชิญส่วนตัว สามารถเช็ครหัสเชิญส่วนตัวได้ที่หน้าเชิญเพื่อนของกลุ่ม\n   b.ส่งรหัสเชิญให้เพื่อนที่ไม่เคยเล่นเก้าเกไทยของคุณ หากเขารับคำเชิญสมัครเข้ากลุ่มคุณสำเร็จ คุณจะได้รับ  30 ชิปทองคำ\n   c.ส่งรหัสเชิญให้เพื่อนที่เล่นเก้าเกไทยอยู่เข้ากลุ่มคุณ คุณจะไม่ได้รับรางวัลค่ะ\n\n4.รางวัลยอดคะแนนแอคทีฟ"
L.GROUP.INTRPOP2 = {
    {"รางวัลยอดคะแนนแอคทีฟ","รางวัลสมาชิก (1 รางวัล/ท่าน/วัน)"},
    {"1000","สมาชิกเติมเงินจะได้รับชิปทองคำเพิ่ม 5%"},
    {"10000","สมาชิกเติมเงินจะได้รับชิปทองคำเพิ่ม 10%"},
    {"100000","สมาชิกเติมเงินจะได้รับชิปทองคำเพิ่ม 15%"},
    {"500000","สมาชิกเติมเงินจะได้รับชิปทองคำเพิ่ม 20%"},
    {"1000000","สมาชิกเติมเงินจะได้รับชิปทองคำเพิ่ม 25%"},
}
L.GROUP.INTRPOP3 = "\n5.เงื่อนไขการสร้างห้องส่วนตัว:หากมีคะแนนแอคทีฟถึง 100 คะแนน สมาชิกจะสามารถสร้างกลุ่มส่วนตัวได้ แต่เจ้าของกลุ่มไม่จำเป็นต้องมีคะแนนแอคทีฟถึง 100 คะแนนในการสร้างห้อง(ในเวลาเดียวกัน สมาชิกทุกท่านสามารถสร้างห้องส่วนตัวกลุ่มเพียง 1 ห้องเท่านั้น ระบบจะเก็บคืนห้องว่างหลัง 24 ชั่วโมง)\n\n6.หากสมาชิกได้รับคะแนนแอคทีฟโดยวิธีโกง ระบบจะหักคะแนนแอคทีฟทั้งหมดออก พร้อมคะแนนแอคทีฟรวมของกลุ่มนี้ด้วย "

L.GROUP.INVITEPOPTITLE = "เชิญสมาชิกใหม่"
L.GROUP.INVITEPOPCODE = "ส่งรหัสเชิญของกลุ่มให้เพื่อนของคุณ：{1}"
L.GROUP.INVITEPOPINVITEBTN = "เชิญ"
L.GROUP.INVITPOPRESULT1 = "รับคำเชิญสำเร็จ รอคำยืนยันจากเจ้าของห้อง"
L.GROUP.INVITPOPRESULT2 = "กลุ่มนี้มีสมาชิกครบแล้ว รับคำเชิญล้มเหลว "
L.GROUP.INVITPOPRESULT3 = "รับคำเชิญสำเร็จ คุณสมัครเข้ากลุ่มเรียบร้อย สามารถเปิดกลุ่มเช็คดูได้ค่ะ！！"

L.GROUP.MSGPOPTITLE = "ข่าวจากกลุ่ม"

L.GROUP.PWDPOPTITLE = "**กรุณากรอกรหัส**"
L.GROUP.PWDPOPINPUT = "กรุณากรอกรหัส"
L.GROUP.PWDPOPCONFIRM = "ยืนยัน"

L.GROUP.SETPOPTITLE = "ตั้งค่าเข้ากลุ่ม"
L.GROUP.SETPOPCONDITION = "เงื่อนไขการเข้ากลุ่ม:"
L.GROUP.SETPOPALLOWALL = "อนุญาตทั้งหมด"
L.GROUP.SETPOPLEVEL = "เลเวล"
L.GROUP.SETPOPPROPERTY = "จำนวนชิปทองคำ"
L.GROUP.SETPOPREVIEW = "ตรวจสอบก่อนเข้ากลุ่ม:"
L.GROUP.SETPOPAUTOIN = "ไม่ตรวจ เข้ากลุ่มโดยอัตโมมัติ"
L.GROUP.SETPOPREVIEWIN = "ตรวจสอบก่อนเข้ากลุ่ม"
L.GROUP.SETPOPCONFIRM = "ตั้งค่าเรียบร้อย"
L.GROUP.SETPOPSETSUCC = "ตั้งค่าสำเร็จ"
L.GROUP.SETPOPSETFAIL = "ตั้งค่าล้มเหลว"
L.GROUP.SETPOPONLYNUM = "กรุณากรอกตัวเลขค่ะ！！"
L.GROUP.SETPOPROPERTY10Y = "ยอดชิปทองคำต้องน้อยกว่า 10 B ชิปทองคำ！！"
L.GROUP.SETPOPLEVEL30 = "เลเวลต้อง<= 30！！"

L.GROUP.JOINLEVELERROR = "เลเวลคุณไม่ถึงเลเวลที่เจ้าของกลุ่มกำหนด เข้ากลุ่มล้มเหลว！"
L.GROUP.JOINLEVELERROR_1 = "เลเวลเพื่อนคุณไม่ถึงเลเวลที่เจ้าของกลุ่มกำหนด ไม่สามารถเข้ากลุ่มได้！"
L.GROUP.JOINGCOINERROR = "ชิปทองคำของคุณมีไม่พอ ไม่สามารถเข้ากลุ่มได้ ！"
L.GROUP.JOINGCOINERROR_1 = "ชิปทองคำของเพื่อนคุณมีไม่พอ ไม่สามารถเข้ากลุ่มได้ ！"
L.GROUP.JOINMONEYERROR = "ชิปของคุณมีไม่พอ ไม่สามารถเข้ากลุ่มได้ ！"
L.GROUP.JOINMONEYERROR_1 = "ชิปของเพื่อนคุณมีไม่พอ ไม่สามารถเข้ากลุ่มได้ ！"

L.CARD_ACT.TITLE = "กิจกรรมเชิญ/สะกิดเพื่อน"
L.CARD_ACT.ACT_TIME = "ระยะเวลากิจกรรม:{1}"
L.CARD_ACT.INPUT_CODE = "กรอกรหัสเชิญ"
L.CARD_ACT.ENTER_CODE = "ยืนยัน"
L.CARD_ACT.REWARD_COUNT = "กำไรสะสม:{1}"
L.CARD_ACT.INVITE_NUM = "จำนวนเพื่อนใหม่ที่เชิญสำเร็จ："
L.CARD_ACT.RECALL_NUM = "จำนวนเพื่อนเก่าที่สะกิดสำเร็จ："
L.CARD_ACT.REWARD_DESC = "โบนัสสุดพิเศษ"
L.CARD_ACT.PAY_REWARD = "เติมเงินรับชิปฟรี:"
L.CARD_ACT.PLAY_REWARD = "เล่นไพ่รับชิปฟรี:"
L.CARD_ACT.GET_REWARD = "รับ"
L.CARD_ACT.GOTO_FINISH = "ทำภารกิจทันที"
L.CARD_ACT.RULE = "กติกา"
L.CARD_ACT.NOTICE = "คำเตือน"
L.CARD_ACT.BIND_ERROR = "ผูกมัดล้มเหลว"
L.CARD_ACT.MONEY = " ชิป"
L.CARD_ACT.REWARD_FAIL = "รับรางวัลล้มเหลว"
L.CARD_ACT.CHECK = "เช็คดู"

L.CARD_ACT.BIND_ERROR_MORE = "มีผู้เล่นผูกรหัสนี้ครบ 15 ท่านแล้ว"
L.CARD_ACT.BIND_SUCC = "ผูกรหัสสำเร็จ！"
L.CARD_ACT.BIND_ERROR_CODE = "รหัสเชิญไม่ถูกต้อง กรุณากรอกรหัสใหม่ค่ะ！"
L.CARD_ACT.BIND_ERROR_BINDED = "คุณใช้รหัสเชิญนี้แลกรางวัลไปแล้วค่ะ！"
L.CARD_ACT.BIND_ERROR_SELF = "ไม่สามารถกรอกรหัสตัวเองแลกรางวัลได้ค่ะ！" 

L.CARD_ACT.REWARD_DESC_NEW = "คำอธิบาย"
L.CARD_ACT.GOTO_USE = " ใช้ทันที"


L.PDENG.GET_POKER = "จั่วไพ่"
L.PDENG.NOT_GET_POKER = "ไม่จั่ว"
L.PDENG.AUTO_GET_POKER = "ออโต้จั่วไพ่"
L.PDENG.AUTO_NOT_GET_POKER = "ออโต้ไม่จั่ว"
L.PDENG.GRAB_DEALER = "เป็นเจ้า"
L.PDENG.DROP_DEALER = "ยกเลิกเป็นเจ้า"
L.PDENG.WAIT_OTHER_BET = "รอผู้เล่นเดิมพัน"
L.PDENG.BET_TIPS = "กรุณากดชิปเดิมพัน"
L.PDENG.GET_CARD_TIPS = "กรุณาเลือกจั่วไพ่/ไม่จั่ว"
L.PDENG.BET_LIMIT_TIPS = "ชิปเดิมพันต่อรอบของคุณถึงขีดสูงสุดที่ระบบกำหนดไว้แล้วค่ะ" 
L.PDENG.GRAB_DEALER_SUCCESS = "ชิงเป็นเจ้าสำเร็จ คุณจะเป็นเจ้าในรอบถัดไปโดยอัตโนมัติ"
L.PDENG.GRAB_DEALER_SUCCESS_WAIT = "ชิงเป็นเจ้าสำเร็จ หลังเจ้ารอบนี้ยกเลิกการเป็นเจ้า คุณจะเป็นเจ้าโดยอัตโนมัติ"
L.PDENG.GRAB_DEALER_SUCCESS_WAIT_X = "ชิงเป็นเจ้าสำเร็จ ยังมีผู้เล่นอีก {1} ท่านรอคิวเป็นเจ้าก่อนคุณค่ะ" 
L.PDENG.GRAB_DEALER_SUCCESS_WAIT_NEXT = "ชิงเจ้าสำเร็จ กรุณารอรอบไพ่นี้จบก่อนค่ะ"--"抢庄成功,正在等待本局结束......"
L.PDENG.GRAB_DEALER_FAILED = "ชิงเป็นเจ้าล้มเหลว"
L.PDENG.GRAB_DEALER_FAILED_MONEY_LIMIT = "ชิปของคุณมีไม่พอ ชิงเป็นเจ้าล้มเหลวค่ะ"
L.PDENG.GRAB_DEALER_FAILED_ALREADY = "คุณส่งคำขอเป็นเจ้าเรียบร้อยแล้วค่ะ" 
L.PDENG.GRAB_DEALER_FAILED_FULL = "คิวรอเป็นเจ้าเต็มแล้ว ชิงเป็นเจ้าล้มเหลวค่ะ"
L.PDENG.WAIT_GRAB_DEALER = "รอเป็นเจ้า" 
L.PDENG.DEALER_CANDIDATE_TITLE = "รายชื่อผู้รอเป็นเจ้า" 
L.PDENG.BACK_TIPS_IN_GAME = "ทำรายการสำเร็จ จบรอบนี้คุณจะออกจากห้องได้ค่ะ"
L.PDENG.STAND_TIPS_IN_GAME = "ทำรายการสำเร็จ จบรอบนี้คุณจะลุกขึ้นได้ค่ะ"
L.PDENG.DROP_DEALER_TIPS_IN_GAME = "ทำรายการสำเร็จ จบรอบนี้คุณจะเลิกเป็นเจ้าต่อโดยอัตโนมัติค่ะ " 
L.PDENG.BACK_ERROR_IN_THREE = "ทำรายการล้มเหลว ภายใน 3 รอบไพ่ เจ้ามือไม่สามารถออกจากห้องได้ "
L.PDENG.STAND_ERROR_IN_THREE = "ทำรายการล้มเหลว ภายใน 3 รอบไพ่ เจ้ามือไม่สามารลุกขึ้นได้"
L.PDENG.DROP_DEALER_ERROR_IN_THREE = "ทำรายการล้มเหลว ภายใน 3 รอบไพ่ เจ้ามือไม่สามารยกเลิกการเป็นเจ้าได้"
L.PDENG.BACK_TIPS_WHEN_NO_OPR = "คุณไม่ได้ทำการใดๆต่อเนื่อง {1} รอบแล้ว หากยังไม่ทำการใดๆต่อ จบรอบนี้คุณจะออกจากห้องโดยอัตโนมัติ"
L.PDENG.DROP_DEALER_TIPS_WHEN_POOR = "ชิปของคุณมีไม่ถึงชิปต่ำสุดในการเป็นเจ้า ระบบยกเลิกการเป็นเจ้าแล้วค่ะ"

L.FOOTBALL.RULE_DESC ={
    "1.ความรู้เกี่ยวกับกิจกรรมทายบอล ?\nระบบจะเลือกฟุตบอลคู่ฮอตให้ได้ทายกัน หลังจบการแข่งจะประกาศผลการแข่งให้ทราบโดยทั่วกัน ผู้เล่นที่ทายถูกจะได้รับรางวัลตามอัตราตอบแทนสุดท้าย",
    "\n\n2.ความรู้เกี่ยวกับอัตราตอบแทน?\nอัตราตอบแทนจะเปลี่ยนแปลงตามจำนวนการแทงสะสม โดยรางวัลสุดท้าย = จำนวนชิปที่ทาย * อัตราตอบแทนสุดท้าย ( เมื่อหยุดการทายจะแสดงอัตราตอบแทนสุดท้าย)",
    "\n\n3.วิธีการทายบอล?\nวิธีการทายบอลมี 2 รูปแบบ ได้แก่ ทายเดี่ยวและทายชุด ซึ่งหากต้องการทายชุด จะต้องเลือกอย่างน้อย 3 ทีม และต้องทายถูกทั้งหมดถึงจะได้รับรางวัล (เช่น: เลือกทายทีม A, B, C และผลออกมาว่า 3 ทีมที่เลือกชนะ รางวัลที่ได้รับ = จำนวนชิปที่ทาย * อัตราตอบแทนสุดท้ายของทีม A * อัตราตอบแทนสุดท้ายของทีม B * อัตราตอบแทนสุดท้ายของทีม C)",
    "\n\n4.เวลาแจกรางวัล?\nหลังจบการแข่ง ระบบจะประกาศผลการแข่งและแจกรางวัลให้ผู้เล่นภายใน 1 วันทำการ\nหากพบปัญหาการรับรางวัล กรุณาติดต่อฝ่ายบริการลูกค้าภายใน 10 วันหลังวันประกาศผลบอล หากเลยเวลาที่กำหนด จะถือว่าสละสิทธิ์ในการรับรางวัลค่ะ"
}

L.FOOTBALL.MATCH_TITLES = 
{
    "เวลาแข่ง",--开赛时间
    "เหย้า VS เยือน",--主队VS客队
    "อัตราตอบแทน (เปลี่ยนตามเวลา)",--赔率(实时变动)
    "อัตราการแทง"--投注比例
}

L.FOOTBALL.BET_TITLES =
{
    "ชนะ",--胜
    "เสมอ",--平
    "แพ้"--负
}

L.FOOTBALL.BET_MODES =
{
    "แทงเดี่ยว",--单独下注
    "แทงชุด"--组合下注
}

L.FOOTBALL.RECORD_TITLES ={
    "วิธีการแทง",--投注方式
    "เวลาแข่ง",--开赛时间
    "เหย้า VS เยือน",--主队VS客队
    "การแทงของฉัน",--已投竞猜
    "คะแนนทีม",--全场比分
    "สถานะ\n(อัตราตอบแทน)",--状态
}

L.FOOTBALL.REWARD_STATE ={
    "ยังไม่เริ่มแข่ง",--未开赛
    "แทงผิด",--未猜中
    "รับรางวัล",--领奖
    "รับรางวัลแล้ว"--已领奖
}

L.FOOTBALL.BET_INFO = "ข้อมูลการแทง"--投注信息
L.FOOTBALL.BET_MODE = "วิธีการแทง"--投注方式
L.FOOTBALL.BET_TOTAL_TITLE = "ยอดชิปที่แทง: "--当前下注总额
L.FOOTBALL.BET_REWARD_TITLE = "คำนวณอัตราตอบแทนสูงสุดแบบคร่าวๆ: "--按当前赔率预计最高获得
L.FOOTBALL.TOTAL_MONEY_TITLE = "ชิปทั้งหมด (ไม่รวมชิปธนาคาร): "--总资产(不含保险箱)
L.FOOTBALL.MONEY_INFO = "{1} ชิป, {2} ชิปทองคำ"--{1}游戏币, {2}黄金币
L.FOOTBALL.CONFIRM_BET = "ยืนยันการแทง"--确认投注
L.FOOTBALL.SELECTED_MATCH = "การแข่ง\nที่เลือก"--已选比赛
L.FOOTBALL.BET_MONEY = "จำนวนชิปที่แทง"--投注金额
L.FOOTBALL.GROUP_BET_TIPS = "ต้องเลือก\nการแข่งถึงสามารถแทงได้"--至少选择3场\n才可以投注
L.FOOTBALL.BET_CHIP_TIPS = "จำนวนชิปที่แทงต้องมากกว่า {1} ชิป"--游戏币投注不能小于{1}
L.FOOTBALL.BET_GCOINS_TIPS = "จำนวนชิปทองคำที่แทงต้องมากกว่า {1} ชิปทองคำ"--黄金币投注不能小于{1}
L.FOOTBALL.MIN_BET_CHIP = "แทงต่ำสุด  {1} ชิป"--"最低投注 {1} 游戏币"
L.FOOTBALL.MIN_BET_GCOINS = "แทงต่ำสุด {1} ชิปทองคำ"--最低投注 {1} 黄金币
L.FOOTBALL.MAX_BET_CHIP = "ชิปที่แทงชุดต้องน้อยกว่า 1M ชิป"--单笔组合下注不能超过1M游戏币
L.FOOTBALL.BET_TOTAL_MONEY_TIPS = "จำนวนชิปที่แทงต้องน้อยกว่าจำนานชิปที่มีค่ะ"--下注总额度不能超过身上携带资产数
L.FOOTBALL.ALONE_TITLE = "เดี่ยว"--单独
L.FOOTBALL.GROUP_TITLE = "ชุด"--组合
L.FOOTBALL.BET_SUCC_TIPS = "แทงสำเร็จ"--投注成功
L.FOOTBALL.BET_TIMEOUT_TIPS = "การแข่งนี้หมดเวลาให้เลือกแล้ว กรุณาเลือกการแข่งอื่นๆค่ะ "--所选比赛已到截止时间,请重新选择下注
L.FOOTBALL.BET_FAIL_TIPS = "แทงชิปล้มเหลว กรุณาลองใหม่ค่ะ"--投注失败，请重新投注
L.FOOTBALL.GET_REWARD_SUCC_TIPS = "รับรางวัลสำเร็จ"--领奖成功
L.FOOTBALL.GET_REWARD_FAIL_TIPS = "รับรางวัลล้มเหลว กรุณาลองอีกทีค่ะ"--领奖失败,请重新领取
L.FOOTBALL.BET_ODDS = "({1})"

L.SONGKRAN.CUR_WATER_VALUE = "น้ำหยดตอนนี้ ({1}/1000)"--当前蓄水值({1}/1000)
L.SONGKRAN.TASK_REWARD = "น้ำ  {1} หยด"--{1}蓄水值
L.SONGKRAN.TASK_PROGRESS = "({1}/{2})"
L.SONGKRAN.LABBER_NUM = "{1} ครั้ง"--次
L.SONGKRAN.NOT_ENOUGH_MONEY = "ชิปมีไม่พอ กรุณาเติมชิปก่อนนะคะ"--身上携带钱不足，请充值后再进行抽奖
L.SONGKRAN.LABBER_ERROR_TIPS = "กรุณาเลือกเพื่อนๆก่อนค่ะ"--选择好友才可以泼水
L.SONGKRAN.SELECTED_FRIEND_TIPS = "สามารถเลือกเพื่อนได้มากสุด 3 ท่าน"--最多选择三个好友
L.SONGKRAN.NO_RANKING = "ไม่ได้ขึ้นแรงกิ้ง"--未上榜
L.SONGKRAN.GO_TO_BTN = "ไปทันที"--立即前往
L.SONGKRAN.NOT_ENOUGH_PROP = "ไอเทมเทศกาลมีไม่พอ กรุณาร่วมกิจกรรมเทศกาลก่อนนะคะ"--节日道具数量不足，请通过节日活动获取
L.SONGKRAN.USE_PROP_FAIL = "ใช้ไอเทมล้มเหลว กรุณาลองใหม่อีกครี้งนะคะ"--使用道具失败，请重试

L.WATERLAMP.BLESSING1 = "สุขสันต์วันลอยกระทงค่า"
L.WATERLAMP.BLESSING2 = "ขอให้โชคดีจ้า"
L.WATERLAMP.BLESSING3 = "ขอให้สุขใจสบายกายทุกท่าน"

L.WATERLAMP.BLESSING21 = "สุขสันต์วันลอยกระทงค่า"
L.WATERLAMP.BLESSING22 = "ขอให้ปีนี้เฮงๆๆ เรื่องแย่ๆก็ให้ลอยไปกับสายน้ำ"
L.WATERLAMP.BLESSING23 = "ขอให้เจอแต่สิ่งดีๆ แฮปปี้ในทุกๆ เรื่อง"
L.WATERLAMP.BLESSING24 = "ขอให้มีแต่ความสุข สุขภาพร่างกายแข็งแรง"

L.WATERLAMP.WATER_LAMP_PROP = "ไอเทมกระทง"

L.WATERLAMP.BLESSING_SUCCESS = "ส่งคำอวยพรสำเร็จค่ะ"

L.WATERLAMP.NO_MONEY_TIP = "ชิปของคุณมีไม่พอ กรุณาไปเติมชิปที่ห้างก่อนแล้วมาใหม่นะคะ"

L.WATERLAMP.DEFAULT_ID_TIP = "ไอดีเพื่อน"
L.WATERLAMP.DEFAULT_BLESSING_TIP = "กรอกคำอวยพรด้วยตนเอง/เลือกคำอวยพรที่ระบบให้"

L.WATERLAMP.INPUT_ID_TIP = "Tips: กรุณาเลือกไอดีเพื่อนก่อนค่ะ"
L.WATERLAMP.INPUT_BLESSING_TIP = "Tips: ยังไม่ได้กรอก/เลือกคำอวยพรค่ะ"

return lang
